#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CharacterPG_Menu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_CharacterPG_Menu.ABP_CharacterPG_Menu_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_CharacterPG_Menu_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_CharacterPG_Menu_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_CharacterPG_Menu_C_AnimGraph");
static_assert(sizeof(ABP_CharacterPG_Menu_C_AnimGraph) == 0x000010, "Wrong size on ABP_CharacterPG_Menu_C_AnimGraph");
static_assert(offsetof(ABP_CharacterPG_Menu_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_CharacterPG_Menu_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_CharacterPG_Menu.ABP_CharacterPG_Menu_C.CacheGunModulesValues
// 0x01A0 (0x01A0 - 0x0000)
struct ABP_CharacterPG_Menu_C_CacheGunModulesValues final
{
public:
	class AItem_Module_General*                   L_ModuleIt;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F64[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AItem_Module_Underbarrel_Grip*          K2Node_DynamicCast_AsItem_Module_Underbarrel_Grip; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F65[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F66[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F67[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorRelativeLocation_ReturnValue;     // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AItem_Module_General*                   CallFunc_Array_Get_Item;                           // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F68[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F69[0x3];                                     // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F6A[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CharacterPG_Menu_C_CacheGunModulesValues) == 0x000010, "Wrong alignment on ABP_CharacterPG_Menu_C_CacheGunModulesValues");
static_assert(sizeof(ABP_CharacterPG_Menu_C_CacheGunModulesValues) == 0x0001A0, "Wrong size on ABP_CharacterPG_Menu_C_CacheGunModulesValues");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, L_ModuleIt) == 0x000000, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::L_ModuleIt' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, Temp_int_Array_Index_Variable) == 0x000008, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, K2Node_DynamicCast_AsItem_Module_Underbarrel_Grip) == 0x000010, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::K2Node_DynamicCast_AsItem_Module_Underbarrel_Grip' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000020, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, CallFunc_DoesSocketExist_ReturnValue) == 0x000038, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::CallFunc_DoesSocketExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, CallFunc_GetSocketTransform_ReturnValue) == 0x000040, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, CallFunc_BreakTransform_Location) == 0x0000A0, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, CallFunc_BreakTransform_Rotation) == 0x0000B8, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, CallFunc_BreakTransform_Scale) == 0x0000D0, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000E8, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, K2Node_SwitchEnum_CmpSuccess) == 0x000100, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, CallFunc_GetActorRelativeLocation_ReturnValue) == 0x000108, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::CallFunc_GetActorRelativeLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, CallFunc_Divide_VectorVector_ReturnValue) == 0x000120, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, CallFunc_Array_Get_Item) == 0x000138, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000140, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000158, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, CallFunc_Array_Length_ReturnValue) == 0x000170, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, CallFunc_Add_VectorVector_ReturnValue) == 0x000178, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, CallFunc_IsValid_ReturnValue) == 0x000190, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, Temp_int_Loop_Counter_Variable) == 0x000194, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, CallFunc_Less_IntInt_ReturnValue) == 0x000198, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_CacheGunModulesValues, CallFunc_Add_IntInt_ReturnValue) == 0x00019C, "Member 'ABP_CharacterPG_Menu_C_CacheGunModulesValues::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function ABP_CharacterPG_Menu.ABP_CharacterPG_Menu_C.ExecuteUbergraph_ABP_CharacterPG_Menu
// 0x0080 (0x0080 - 0x0000)
struct ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F6B[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AItem_Gun_General* OldGun)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AItem_Gun_General*                      K2Node_CustomEvent_oldGun;                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F6C[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerState_Menu_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Menu;      // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F6D[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_PG_Menu_Character_C*>        CallFunc_GetAllActorsOfClass_OutActors;            // 0x0068(0x0010)(ReferenceParm)
	class ABP_PG_Menu_Character_C*                CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu) == 0x000008, "Wrong alignment on ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu");
static_assert(sizeof(ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu) == 0x000080, "Wrong size on ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu");
static_assert(offsetof(ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu, EntryPoint) == 0x000000, "Member 'ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu, K2Node_CustomEvent_oldGun) == 0x000038, "Member 'ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu::K2Node_CustomEvent_oldGun' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000048, "Member 'ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu, K2Node_DynamicCast_AsBP_PG_Player_State_Menu) == 0x000058, "Member 'ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu::K2Node_DynamicCast_AsBP_PG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu, CallFunc_GetAllActorsOfClass_OutActors) == 0x000068, "Member 'ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu, CallFunc_Array_Get_Item) == 0x000078, "Member 'ABP_CharacterPG_Menu_C_ExecuteUbergraph_ABP_CharacterPG_Menu::CallFunc_Array_Get_Item' has a wrong offset!");

// Function ABP_CharacterPG_Menu.ABP_CharacterPG_Menu_C.OnSetPrimaryGun_Event
// 0x0008 (0x0008 - 0x0000)
struct ABP_CharacterPG_Menu_C_OnSetPrimaryGun_Event final
{
public:
	class AItem_Gun_General*                      OldGun;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CharacterPG_Menu_C_OnSetPrimaryGun_Event) == 0x000008, "Wrong alignment on ABP_CharacterPG_Menu_C_OnSetPrimaryGun_Event");
static_assert(sizeof(ABP_CharacterPG_Menu_C_OnSetPrimaryGun_Event) == 0x000008, "Wrong size on ABP_CharacterPG_Menu_C_OnSetPrimaryGun_Event");
static_assert(offsetof(ABP_CharacterPG_Menu_C_OnSetPrimaryGun_Event, OldGun) == 0x000000, "Member 'ABP_CharacterPG_Menu_C_OnSetPrimaryGun_Event::OldGun' has a wrong offset!");

}

