#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Actions

#include "Basic.hpp"


namespace SDK
{

// Enum Actions.EActionState
// NumValues: 0x0006
enum class EActionState : uint8
{
	Preparing                                = 0,
	Running                                  = 1,
	Success                                  = 2,
	Failure                                  = 3,
	Cancelled                                = 4,
	EActionState_MAX                         = 5,
};

// ScriptStruct Actions.ActionsTickGroup
// 0x0018 (0x0018 - 0x0000)
struct FActionsTickGroup final
{
public:
	float                                         TickRate;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TickTimeElapsed;                                   // 0x0004(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAction*>                        Actions;                                           // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FActionsTickGroup) == 0x000008, "Wrong alignment on FActionsTickGroup");
static_assert(sizeof(FActionsTickGroup) == 0x000018, "Wrong size on FActionsTickGroup");
static_assert(offsetof(FActionsTickGroup, TickRate) == 0x000000, "Member 'FActionsTickGroup::TickRate' has a wrong offset!");
static_assert(offsetof(FActionsTickGroup, TickTimeElapsed) == 0x000004, "Member 'FActionsTickGroup::TickTimeElapsed' has a wrong offset!");
static_assert(offsetof(FActionsTickGroup, Actions) == 0x000008, "Member 'FActionsTickGroup::Actions' has a wrong offset!");

// ScriptStruct Actions.RootAction
// 0x0018 (0x0018 - 0x0000)
struct FRootAction final
{
public:
	TWeakObjectPtr<class UObject>                 Owner;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAction*>                        Actions;                                           // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRootAction) == 0x000008, "Wrong alignment on FRootAction");
static_assert(sizeof(FRootAction) == 0x000018, "Wrong size on FRootAction");
static_assert(offsetof(FRootAction, Owner) == 0x000000, "Member 'FRootAction::Owner' has a wrong offset!");
static_assert(offsetof(FRootAction, Actions) == 0x000008, "Member 'FRootAction::Actions' has a wrong offset!");

}

