#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: APB_Pistol_DesertEagle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function APB_Pistol_DesertEagle.APB_Pistol_DesertEagle_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct APB_Pistol_DesertEagle_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(APB_Pistol_DesertEagle_C_AnimGraph) == 0x000008, "Wrong alignment on APB_Pistol_DesertEagle_C_AnimGraph");
static_assert(sizeof(APB_Pistol_DesertEagle_C_AnimGraph) == 0x000010, "Wrong size on APB_Pistol_DesertEagle_C_AnimGraph");
static_assert(offsetof(APB_Pistol_DesertEagle_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'APB_Pistol_DesertEagle_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function APB_Pistol_DesertEagle.APB_Pistol_DesertEagle_C.ExecuteUbergraph_APB_Pistol_DesertEagle
// 0x0090 (0x0090 - 0x0000)
struct APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_322B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Item_Pistol_DesertEagle_C*          K2Node_DynamicCast_AsBP_Item_Pistol_Desert_Eagle;  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_322C[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponentByClass_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle) == 0x000010, "Wrong alignment on APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle");
static_assert(sizeof(APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle) == 0x000090, "Wrong size on APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle");
static_assert(offsetof(APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle, EntryPoint) == 0x000000, "Member 'APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle::EntryPoint' has a wrong offset!");
static_assert(offsetof(APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle, K2Node_DynamicCast_AsBP_Item_Pistol_Desert_Eagle) == 0x000070, "Member 'APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle::K2Node_DynamicCast_AsBP_Item_Pistol_Desert_Eagle' has a wrong offset!");
static_assert(offsetof(APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle, CallFunc_AddComponentByClass_ReturnValue) == 0x000080, "Member 'APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000088, "Member 'APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle, CallFunc_SetStaticMesh_ReturnValue) == 0x000089, "Member 'APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle, CallFunc_IsValid_ReturnValue) == 0x00008A, "Member 'APB_Pistol_DesertEagle_C_ExecuteUbergraph_APB_Pistol_DesertEagle::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

