#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: APB_Pistol_DesertEagle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass APB_Pistol_DesertEagle.APB_Pistol_DesertEagle_C
// 0x0090 (0x03E0 - 0x0350)
class UAPB_Pistol_DesertEagle_C final : public UAnimInstance
{
public:
	uint8                                         Pad_322A[0x8];                                     // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0388(0x0048)()
	class UStaticMeshComponent*                   SpareMagazineMesh;                                 // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void AnimNotify_SpareMag_End();
	void AnimNotify_SpareMag_Start();
	void ExecuteUbergraph_APB_Pistol_DesertEagle(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"APB_Pistol_DesertEagle_C">();
	}
	static class UAPB_Pistol_DesertEagle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAPB_Pistol_DesertEagle_C>();
	}
};
static_assert(alignof(UAPB_Pistol_DesertEagle_C) == 0x000010, "Wrong alignment on UAPB_Pistol_DesertEagle_C");
static_assert(sizeof(UAPB_Pistol_DesertEagle_C) == 0x0003E0, "Wrong size on UAPB_Pistol_DesertEagle_C");
static_assert(offsetof(UAPB_Pistol_DesertEagle_C, UberGraphFrame) == 0x000350, "Member 'UAPB_Pistol_DesertEagle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAPB_Pistol_DesertEagle_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UAPB_Pistol_DesertEagle_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAPB_Pistol_DesertEagle_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UAPB_Pistol_DesertEagle_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAPB_Pistol_DesertEagle_C, AnimGraphNode_Root) == 0x000368, "Member 'UAPB_Pistol_DesertEagle_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAPB_Pistol_DesertEagle_C, AnimGraphNode_Slot) == 0x000388, "Member 'UAPB_Pistol_DesertEagle_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UAPB_Pistol_DesertEagle_C, SpareMagazineMesh) == 0x0003D0, "Member 'UAPB_Pistol_DesertEagle_C::SpareMagazineMesh' has a wrong offset!");

}

