#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Item_Gear_Watch_02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "POLYGON_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Item_Gear_Watch_02.BP_Item_Gear_Watch_02_C
// 0x0028 (0x0338 - 0x0310)
class ABP_Item_Gear_Watch_02_C final : public AItem_Watch_General
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget_Functional;                                 // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         KillsCounter;                                      // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SavedKills;                                        // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Item_Gear_Watch_02_Display_C*       DisplayWidget;                                     // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     AsInventoryItem;                                   // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void EnableFunctional();
	void ExecuteUbergraph_BP_Item_Gear_Watch_02(int32 EntryPoint);
	void OnAddedGameScore_Event(const TArray<struct FScoreInfoBlueprint>& ScoreInfos);
	void ReceiveBeginPlay();
	void SaveKillsProgress();
	void SaveWatchProgress_Failure(const struct FPlayFabError& Error, class UObject* Param_CustomData);
	void SaveWatchProgress_Success(const struct FClientExecuteCloudScriptResult& Result, class UObject* Param_CustomData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Item_Gear_Watch_02_C">();
	}
	static class ABP_Item_Gear_Watch_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Item_Gear_Watch_02_C>();
	}
};
static_assert(alignof(ABP_Item_Gear_Watch_02_C) == 0x000008, "Wrong alignment on ABP_Item_Gear_Watch_02_C");
static_assert(sizeof(ABP_Item_Gear_Watch_02_C) == 0x000338, "Wrong size on ABP_Item_Gear_Watch_02_C");
static_assert(offsetof(ABP_Item_Gear_Watch_02_C, UberGraphFrame) == 0x000310, "Member 'ABP_Item_Gear_Watch_02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Item_Gear_Watch_02_C, Widget_Functional) == 0x000318, "Member 'ABP_Item_Gear_Watch_02_C::Widget_Functional' has a wrong offset!");
static_assert(offsetof(ABP_Item_Gear_Watch_02_C, KillsCounter) == 0x000320, "Member 'ABP_Item_Gear_Watch_02_C::KillsCounter' has a wrong offset!");
static_assert(offsetof(ABP_Item_Gear_Watch_02_C, SavedKills) == 0x000324, "Member 'ABP_Item_Gear_Watch_02_C::SavedKills' has a wrong offset!");
static_assert(offsetof(ABP_Item_Gear_Watch_02_C, DisplayWidget) == 0x000328, "Member 'ABP_Item_Gear_Watch_02_C::DisplayWidget' has a wrong offset!");
static_assert(offsetof(ABP_Item_Gear_Watch_02_C, AsInventoryItem) == 0x000330, "Member 'ABP_Item_Gear_Watch_02_C::AsInventoryItem' has a wrong offset!");

}

