#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Item_Gear_Watch_16

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Item_Gear_Watch_16.BP_Item_Gear_Watch_16_C.ExecuteUbergraph_BP_Item_Gear_Watch_16
// 0x0570 (0x0570 - 0x0000)
struct BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year_1;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month_1;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day_1;                      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour_1;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute_1;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond_1;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FDateTime                              CallFunc_Now_ReturnValue_1;                        // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year_2;                     // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month_2;                    // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day_2;                      // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour_2;                     // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute_2;                   // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second_2;                   // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond_2;              // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C9[0x4];                                     // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x01D8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_5;           // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year_3;                     // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month_3;                    // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day_3;                      // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour_3;                     // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute_3;                   // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second_3;                   // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond_3;              // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32CA[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_6;           // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_7;           // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x0340(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x0430(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_3;  // 0x0448(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0530(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0538(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0550(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_useFovMaterial;                       // 0x0559(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32CB[0x2];                                     // 0x055A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast_1;         // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast_2;         // 0x0564(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast_3;         // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16) == 0x000008, "Wrong alignment on BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16");
static_assert(sizeof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16) == 0x000570, "Wrong size on BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, EntryPoint) == 0x000000, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Now_ReturnValue) == 0x000008, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Year) == 0x000010, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Month) == 0x000014, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Day) == 0x000018, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Hour) == 0x00001C, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Minute) == 0x000020, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Second) == 0x000024, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Millisecond) == 0x000028, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Year_1) == 0x00002C, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Year_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Month_1) == 0x000030, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Month_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Day_1) == 0x000034, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Day_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Hour_1) == 0x000038, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Hour_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Minute_1) == 0x00003C, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Minute_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Second_1) == 0x000040, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Second_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Millisecond_1) == 0x000044, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Millisecond_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000048, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000050, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000068, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x000070, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000078, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000080, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_MakeRotator_ReturnValue) == 0x000098, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_MakeRotator_ReturnValue_1) == 0x0000B0, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0000C8, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Now_ReturnValue_1) == 0x0001B0, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Now_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Year_2) == 0x0001B8, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Year_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Month_2) == 0x0001BC, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Month_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Day_2) == 0x0001C0, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Day_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Hour_2) == 0x0001C4, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Hour_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Minute_2) == 0x0001C8, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Minute_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Second_2) == 0x0001CC, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Second_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Millisecond_2) == 0x0001D0, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Millisecond_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0001D8, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Conv_IntToDouble_ReturnValue_4) == 0x0002C0, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Conv_IntToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Conv_IntToDouble_ReturnValue_5) == 0x0002C8, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Conv_IntToDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x0002D0, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Year_3) == 0x0002D8, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Year_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Month_3) == 0x0002DC, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Month_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Day_3) == 0x0002E0, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Day_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Hour_3) == 0x0002E4, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Hour_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Minute_3) == 0x0002E8, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Minute_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Second_3) == 0x0002EC, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Second_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_BreakDateTime_Millisecond_3) == 0x0002F0, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_BreakDateTime_Millisecond_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x0002F8, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Conv_IntToDouble_ReturnValue_6) == 0x000300, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Conv_IntToDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000308, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x000310, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_MakeRotator_ReturnValue_2) == 0x000318, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Conv_IntToDouble_ReturnValue_7) == 0x000330, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Conv_IntToDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000338, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_K2_SetRelativeRotation_SweepHitResult_2) == 0x000340, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_K2_SetRelativeRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000428, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_MakeRotator_ReturnValue_3) == 0x000430, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_K2_SetRelativeRotation_SweepHitResult_3) == 0x000448, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_K2_SetRelativeRotation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_GetPlayerController_ReturnValue) == 0x000530, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, K2Node_CreateDelegate_OutputDelegate) == 0x000538, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_GetOwner_ReturnValue) == 0x000548, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000550, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000558, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, K2Node_Event_useFovMaterial) == 0x000559, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::K2Node_Event_useFovMaterial' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x00055C, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_MakeRotator_Pitch_ImplicitCast_1) == 0x000560, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_MakeRotator_Pitch_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_MakeRotator_Pitch_ImplicitCast_2) == 0x000564, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_MakeRotator_Pitch_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16, CallFunc_MakeRotator_Pitch_ImplicitCast_3) == 0x000568, "Member 'BP_Item_Gear_Watch_16_C_ExecuteUbergraph_BP_Item_Gear_Watch_16::CallFunc_MakeRotator_Pitch_ImplicitCast_3' has a wrong offset!");

// Function BP_Item_Gear_Watch_16.BP_Item_Gear_Watch_16_C.SetCorrectiveFovMaterial
// 0x0001 (0x0001 - 0x0000)
struct BP_Item_Gear_Watch_16_C_SetCorrectiveFovMaterial final
{
public:
	bool                                          UseFovMaterial;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Gear_Watch_16_C_SetCorrectiveFovMaterial) == 0x000001, "Wrong alignment on BP_Item_Gear_Watch_16_C_SetCorrectiveFovMaterial");
static_assert(sizeof(BP_Item_Gear_Watch_16_C_SetCorrectiveFovMaterial) == 0x000001, "Wrong size on BP_Item_Gear_Watch_16_C_SetCorrectiveFovMaterial");
static_assert(offsetof(BP_Item_Gear_Watch_16_C_SetCorrectiveFovMaterial, UseFovMaterial) == 0x000000, "Member 'BP_Item_Gear_Watch_16_C_SetCorrectiveFovMaterial::UseFovMaterial' has a wrong offset!");

}

