#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Item_Gear_Watch_01

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Item_Gear_Watch_01.BP_Item_Gear_Watch_01_C.ExecuteUbergraph_BP_Item_Gear_Watch_01
// 0x0038 (0x0038 - 0x0000)
struct BP_Item_Gear_Watch_01_C_ExecuteUbergraph_BP_Item_Gear_Watch_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32FA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Gear_Watch_01_C_ExecuteUbergraph_BP_Item_Gear_Watch_01) == 0x000008, "Wrong alignment on BP_Item_Gear_Watch_01_C_ExecuteUbergraph_BP_Item_Gear_Watch_01");
static_assert(sizeof(BP_Item_Gear_Watch_01_C_ExecuteUbergraph_BP_Item_Gear_Watch_01) == 0x000038, "Wrong size on BP_Item_Gear_Watch_01_C_ExecuteUbergraph_BP_Item_Gear_Watch_01");
static_assert(offsetof(BP_Item_Gear_Watch_01_C_ExecuteUbergraph_BP_Item_Gear_Watch_01, EntryPoint) == 0x000000, "Member 'BP_Item_Gear_Watch_01_C_ExecuteUbergraph_BP_Item_Gear_Watch_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_01_C_ExecuteUbergraph_BP_Item_Gear_Watch_01, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_Item_Gear_Watch_01_C_ExecuteUbergraph_BP_Item_Gear_Watch_01::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_01_C_ExecuteUbergraph_BP_Item_Gear_Watch_01, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_Item_Gear_Watch_01_C_ExecuteUbergraph_BP_Item_Gear_Watch_01::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_01_C_ExecuteUbergraph_BP_Item_Gear_Watch_01, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_Item_Gear_Watch_01_C_ExecuteUbergraph_BP_Item_Gear_Watch_01::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_01_C_ExecuteUbergraph_BP_Item_Gear_Watch_01, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BP_Item_Gear_Watch_01_C_ExecuteUbergraph_BP_Item_Gear_Watch_01::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_01_C_ExecuteUbergraph_BP_Item_Gear_Watch_01, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000030, "Member 'BP_Item_Gear_Watch_01_C_ExecuteUbergraph_BP_Item_Gear_Watch_01::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

