#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Item_Gear_Watch_02

#include "Basic.hpp"

#include "POLYGON_structs.hpp"
#include "PlayFab_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Item_Gear_Watch_02.BP_Item_Gear_Watch_02_C.ExecuteUbergraph_BP_Item_Gear_Watch_02
// 0x0260 (0x0260 - 0x0000)
struct BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32E8[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32E9[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Base*                   K2Node_DynamicCast_AsPG_Player_State_Base;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32EA[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APG_PlayerState_Game*                   K2Node_DynamicCast_AsPG_Player_State_Game;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32EB[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue;          // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32EC[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32ED[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32EE[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32EF[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32F0[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_Game_Character*                     K2Node_DynamicCast_AsPG_Game_Character;            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32F1[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32F2[0x5];                                     // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FScoreInfoBlueprint>            K2Node_CustomEvent_ScoreInfos;                     // 0x00C0(0x0010)(ConstParm, ReferenceParm)
	struct FScoreInfoBlueprint                    CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0010)(NoDestructor)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00E0(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32F3[0x3];                                     // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_1;             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32F4[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0118(0x0018)()
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Item_Gear_Watch_02_Display_C*       K2Node_DynamicCast_AsUI_Item_Gear_Watch_02_Display; // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32F5[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<struct FScoreInfoBlueprint>& ScoreInfos)> K2Node_CreateDelegate_OutputDelegate;              // 0x0144(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32F6[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32F7[0x3];                                     // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0168(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0180(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result;                         // 0x0190(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x0200(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32F8[0x3];                                     // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32F9[0x3];                                     // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02) == 0x000008, "Wrong alignment on BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02");
static_assert(sizeof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02) == 0x000260, "Wrong size on BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, EntryPoint) == 0x000000, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_GetPlayerController_ReturnValue_1) == 0x000020, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, K2Node_DynamicCast_AsPG_Player_State_Base) == 0x000028, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::K2Node_DynamicCast_AsPG_Player_State_Base' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, K2Node_DynamicCast_AsPG_Player_State_Game) == 0x000038, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::K2Node_DynamicCast_AsPG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000048, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_GetObjectArrayField_ReturnValue) == 0x000050, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_GetObjectArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_GetStringField_ReturnValue) == 0x000078, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000088, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, Temp_int_Loop_Counter_Variable) == 0x00008C, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_Add_IntInt_ReturnValue_1) == 0x000094, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_BooleanAND_ReturnValue) == 0x000098, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000A0, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, K2Node_DynamicCast_AsPG_Game_Character) == 0x0000A8, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::K2Node_DynamicCast_AsPG_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, Temp_int_Array_Index_Variable_1) == 0x0000B4, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, Temp_bool_True_if_break_was_hit_Variable_1) == 0x0000B8, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B9, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000BA, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, K2Node_CustomEvent_ScoreInfos) == 0x0000C0, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::K2Node_CustomEvent_ScoreInfos' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_Conv_IntToText_ReturnValue) == 0x0000E0, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_Array_Length_ReturnValue_1) == 0x0000F8, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000FC, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_GetObjectField_ReturnValue) == 0x000100, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_GetNumberField_ReturnValue) == 0x000108, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_GetNumberField_ReturnValue_1) == 0x00010C, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_GetNumberField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_FTrunc_ReturnValue) == 0x000110, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000118, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_GetWidget_ReturnValue) == 0x000130, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, K2Node_DynamicCast_AsUI_Item_Gear_Watch_02_Display) == 0x000138, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::K2Node_DynamicCast_AsUI_Item_Gear_Watch_02_Display' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, K2Node_DynamicCast_bSuccess_3) == 0x000140, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, K2Node_CreateDelegate_OutputDelegate) == 0x000144, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_GetPlayerController_ReturnValue_2) == 0x000158, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, Temp_int_Variable) == 0x000160, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000164, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000168, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, K2Node_CreateDelegate_OutputDelegate_1) == 0x000180, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, K2Node_CustomEvent_result) == 0x000190, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::K2Node_CustomEvent_result' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, K2Node_CustomEvent_customData_1) == 0x0001F0, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::K2Node_CustomEvent_customData_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001F8, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, K2Node_CustomEvent_error) == 0x000200, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::K2Node_CustomEvent_error' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, K2Node_CustomEvent_customData) == 0x000238, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::K2Node_CustomEvent_customData' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, Temp_int_Loop_Counter_Variable_1) == 0x000240, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_Less_IntInt_ReturnValue_1) == 0x000244, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_Add_IntInt_ReturnValue_2) == 0x000248, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_BooleanAND_ReturnValue_1) == 0x00024C, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_FTrunc_A_ImplicitCast) == 0x000250, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000258, "Member 'BP_Item_Gear_Watch_02_C_ExecuteUbergraph_BP_Item_Gear_Watch_02::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");

// Function BP_Item_Gear_Watch_02.BP_Item_Gear_Watch_02_C.OnAddedGameScore_Event
// 0x0010 (0x0010 - 0x0000)
struct BP_Item_Gear_Watch_02_C_OnAddedGameScore_Event final
{
public:
	TArray<struct FScoreInfoBlueprint>            ScoreInfos;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Item_Gear_Watch_02_C_OnAddedGameScore_Event) == 0x000008, "Wrong alignment on BP_Item_Gear_Watch_02_C_OnAddedGameScore_Event");
static_assert(sizeof(BP_Item_Gear_Watch_02_C_OnAddedGameScore_Event) == 0x000010, "Wrong size on BP_Item_Gear_Watch_02_C_OnAddedGameScore_Event");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_OnAddedGameScore_Event, ScoreInfos) == 0x000000, "Member 'BP_Item_Gear_Watch_02_C_OnAddedGameScore_Event::ScoreInfos' has a wrong offset!");

// Function BP_Item_Gear_Watch_02.BP_Item_Gear_Watch_02_C.SaveWatchProgress_Failure
// 0x0040 (0x0040 - 0x0000)
struct BP_Item_Gear_Watch_02_C_SaveWatchProgress_Failure final
{
public:
	struct FPlayFabError                          Error;                                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                Param_CustomData;                                  // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Gear_Watch_02_C_SaveWatchProgress_Failure) == 0x000008, "Wrong alignment on BP_Item_Gear_Watch_02_C_SaveWatchProgress_Failure");
static_assert(sizeof(BP_Item_Gear_Watch_02_C_SaveWatchProgress_Failure) == 0x000040, "Wrong size on BP_Item_Gear_Watch_02_C_SaveWatchProgress_Failure");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_SaveWatchProgress_Failure, Error) == 0x000000, "Member 'BP_Item_Gear_Watch_02_C_SaveWatchProgress_Failure::Error' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_SaveWatchProgress_Failure, Param_CustomData) == 0x000038, "Member 'BP_Item_Gear_Watch_02_C_SaveWatchProgress_Failure::Param_CustomData' has a wrong offset!");

// Function BP_Item_Gear_Watch_02.BP_Item_Gear_Watch_02_C.SaveWatchProgress_Success
// 0x0068 (0x0068 - 0x0000)
struct BP_Item_Gear_Watch_02_C_SaveWatchProgress_Success final
{
public:
	struct FClientExecuteCloudScriptResult        Result;                                            // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                Param_CustomData;                                  // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Gear_Watch_02_C_SaveWatchProgress_Success) == 0x000008, "Wrong alignment on BP_Item_Gear_Watch_02_C_SaveWatchProgress_Success");
static_assert(sizeof(BP_Item_Gear_Watch_02_C_SaveWatchProgress_Success) == 0x000068, "Wrong size on BP_Item_Gear_Watch_02_C_SaveWatchProgress_Success");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_SaveWatchProgress_Success, Result) == 0x000000, "Member 'BP_Item_Gear_Watch_02_C_SaveWatchProgress_Success::Result' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_02_C_SaveWatchProgress_Success, Param_CustomData) == 0x000060, "Member 'BP_Item_Gear_Watch_02_C_SaveWatchProgress_Success::Param_CustomData' has a wrong offset!");

}

