#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Item_Accessory_Flashlight_01

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Item_Accessory_Flashlight_01.BP_Item_Accessory_Flashlight_01_C.ExecuteUbergraph_BP_Item_Accessory_Flashlight_01
// 0x0060 (0x0060 - 0x0000)
struct BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B3A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0008(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlaySound;                           // 0x0022(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue_1;               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue_2;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B3B[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_Game_Character*                     K2Node_DynamicCast_AsPG_Game_Character;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue_3;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B3C[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AItem_Gun_General*                      CallFunc_GetCurrentGun_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01) == 0x000008, "Wrong alignment on BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01");
static_assert(sizeof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01) == 0x000060, "Wrong size on BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, EntryPoint) == 0x000000, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, K2Node_InputActionEvent_Key) == 0x000008, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_Not_PreBool_ReturnValue_1) == 0x000021, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, K2Node_Event_bPlaySound) == 0x000022, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::K2Node_Event_bPlaySound' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_GetLocalRole_ReturnValue) == 0x000023, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_GetLocalRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000024, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_GetLocalRole_ReturnValue_1) == 0x000025, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_GetLocalRole_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000026, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_BooleanAND_ReturnValue) == 0x000027, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_GetLocalRole_ReturnValue_2) == 0x000028, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_GetLocalRole_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000029, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_HasAuthority_ReturnValue) == 0x00002A, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_BooleanAND_ReturnValue_1) == 0x00002B, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_Not_PreBool_ReturnValue_2) == 0x00002C, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_GetInstigator_ReturnValue) == 0x000030, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, K2Node_DynamicCast_AsPG_Game_Character) == 0x000040, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::K2Node_DynamicCast_AsPG_Game_Character' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_GetLocalRole_ReturnValue_3) == 0x000049, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_GetLocalRole_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_GetCurrentGun_ReturnValue) == 0x000050, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_GetCurrentGun_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000058, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000059, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01, CallFunc_BooleanAND_ReturnValue_2) == 0x00005A, "Member 'BP_Item_Accessory_Flashlight_01_C_ExecuteUbergraph_BP_Item_Accessory_Flashlight_01::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function BP_Item_Accessory_Flashlight_01.BP_Item_Accessory_Flashlight_01_C.InpActEvt_Flashlight_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_Item_Accessory_Flashlight_01_C_InpActEvt_Flashlight_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Accessory_Flashlight_01_C_InpActEvt_Flashlight_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on BP_Item_Accessory_Flashlight_01_C_InpActEvt_Flashlight_K2Node_InputActionEvent_0");
static_assert(sizeof(BP_Item_Accessory_Flashlight_01_C_InpActEvt_Flashlight_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on BP_Item_Accessory_Flashlight_01_C_InpActEvt_Flashlight_K2Node_InputActionEvent_0");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_InpActEvt_Flashlight_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'BP_Item_Accessory_Flashlight_01_C_InpActEvt_Flashlight_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function BP_Item_Accessory_Flashlight_01.BP_Item_Accessory_Flashlight_01_C.OnChangeEnableState
// 0x0001 (0x0001 - 0x0000)
struct BP_Item_Accessory_Flashlight_01_C_OnChangeEnableState final
{
public:
	bool                                          bPlaySound;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Accessory_Flashlight_01_C_OnChangeEnableState) == 0x000001, "Wrong alignment on BP_Item_Accessory_Flashlight_01_C_OnChangeEnableState");
static_assert(sizeof(BP_Item_Accessory_Flashlight_01_C_OnChangeEnableState) == 0x000001, "Wrong size on BP_Item_Accessory_Flashlight_01_C_OnChangeEnableState");
static_assert(offsetof(BP_Item_Accessory_Flashlight_01_C_OnChangeEnableState, bPlaySound) == 0x000000, "Member 'BP_Item_Accessory_Flashlight_01_C_OnChangeEnableState::bPlaySound' has a wrong offset!");

}

