#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Item_Gear_Watch_15

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Item_Gear_Watch_15.BP_Item_Gear_Watch_15_C.ExecuteUbergraph_BP_Item_Gear_Watch_15
// 0x0AC8 (0x0AC8 - 0x0000)
struct BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32CC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year_1;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month_1;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day_1;                      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour_1;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute_1;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond_1;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakDateTime_Year_2;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month_2;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day_2;                      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour_2;                     // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute_2;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second_2;                   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond_2;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32CD[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x01F0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue;        // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FDateTime                              CallFunc_Now_ReturnValue_1;                        // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year_3;                     // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month_3;                    // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day_3;                      // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour_3;                     // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute_3;                   // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second_3;                   // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond_3;              // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32CE[0x4];                                     // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x0318(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_5;           // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year_4;                     // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month_4;                    // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day_4;                      // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour_4;                     // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute_4;                   // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second_4;                   // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond_4;              // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32CF[0x4];                                     // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_6;           // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x0458(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_7;           // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year_5;                     // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month_5;                    // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day_5;                      // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour_5;                     // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute_5;                   // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second_5;                   // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond_5;              // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D0[0x4];                                     // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_4;                // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_5;                // 0x04C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_3;  // 0x04E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_4;  // 0x05C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_5;  // 0x06B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0798(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x07A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x07B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x07B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_useFovMaterial;                       // 0x07C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D1[0x2];                                     // 0x07C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x07C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x07C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue_1;      // 0x08B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue_2;      // 0x08C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_1;     // 0x08E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_2;     // 0x09C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x0AB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast_1;         // 0x0AB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast_2;         // 0x0AB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast_3;         // 0x0ABC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast_4;         // 0x0AC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast_5;         // 0x0AC4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15) == 0x000008, "Wrong alignment on BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15");
static_assert(sizeof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15) == 0x000AC8, "Wrong size on BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, EntryPoint) == 0x000000, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Now_ReturnValue) == 0x000008, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Year) == 0x000010, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Month) == 0x000014, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Day) == 0x000018, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Hour) == 0x00001C, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Minute) == 0x000020, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Second) == 0x000024, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Millisecond) == 0x000028, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Year_1) == 0x00002C, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Year_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Month_1) == 0x000030, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Month_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Day_1) == 0x000034, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Day_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Hour_1) == 0x000038, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Hour_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Minute_1) == 0x00003C, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Minute_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Second_1) == 0x000040, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Second_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Millisecond_1) == 0x000044, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Millisecond_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000048, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000050, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000068, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x000070, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000078, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000080, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_MakeRotator_ReturnValue) == 0x000098, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_MakeRotator_ReturnValue_1) == 0x0000B0, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Year_2) == 0x0000C8, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Year_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Month_2) == 0x0000CC, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Month_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Day_2) == 0x0000D0, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Day_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Hour_2) == 0x0000D4, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Hour_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Minute_2) == 0x0000D8, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Minute_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Second_2) == 0x0000DC, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Second_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Millisecond_2) == 0x0000E0, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Millisecond_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0000E8, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0001D0, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_MakeRotator_ReturnValue_2) == 0x0001D8, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0001F0, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Multiply_RotatorFloat_ReturnValue) == 0x0002D8, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Multiply_RotatorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Now_ReturnValue_1) == 0x0002F0, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Now_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Year_3) == 0x0002F8, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Year_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Month_3) == 0x0002FC, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Month_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Day_3) == 0x000300, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Day_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Hour_3) == 0x000304, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Hour_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Minute_3) == 0x000308, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Minute_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Second_3) == 0x00030C, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Second_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Millisecond_3) == 0x000310, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Millisecond_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_K2_SetRelativeRotation_SweepHitResult_2) == 0x000318, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_K2_SetRelativeRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Conv_IntToDouble_ReturnValue_4) == 0x000400, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Conv_IntToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Conv_IntToDouble_ReturnValue_5) == 0x000408, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Conv_IntToDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000410, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Year_4) == 0x000418, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Year_4' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Month_4) == 0x00041C, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Month_4' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Day_4) == 0x000420, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Day_4' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Hour_4) == 0x000424, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Hour_4' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Minute_4) == 0x000428, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Minute_4' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Second_4) == 0x00042C, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Second_4' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Millisecond_4) == 0x000430, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Millisecond_4' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000438, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Conv_IntToDouble_ReturnValue_6) == 0x000440, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Conv_IntToDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000448, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x000450, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_MakeRotator_ReturnValue_3) == 0x000458, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Conv_IntToDouble_ReturnValue_7) == 0x000470, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Conv_IntToDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Year_5) == 0x000478, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Year_5' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Month_5) == 0x00047C, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Month_5' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Day_5) == 0x000480, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Day_5' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Hour_5) == 0x000484, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Hour_5' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Minute_5) == 0x000488, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Minute_5' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Second_5) == 0x00048C, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Second_5' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_BreakDateTime_Millisecond_5) == 0x000490, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_BreakDateTime_Millisecond_5' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000498, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x0004A0, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0004A8, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_MakeRotator_ReturnValue_4) == 0x0004B0, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_MakeRotator_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_MakeRotator_ReturnValue_5) == 0x0004C8, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_MakeRotator_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_K2_SetRelativeRotation_SweepHitResult_3) == 0x0004E0, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_K2_SetRelativeRotation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_K2_SetRelativeRotation_SweepHitResult_4) == 0x0005C8, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_K2_SetRelativeRotation_SweepHitResult_4' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_K2_SetRelativeRotation_SweepHitResult_5) == 0x0006B0, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_K2_SetRelativeRotation_SweepHitResult_5' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_GetPlayerController_ReturnValue) == 0x000798, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, K2Node_CreateDelegate_OutputDelegate) == 0x0007A0, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_GetOwner_ReturnValue) == 0x0007B0, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0007B8, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0007C0, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, K2Node_Event_useFovMaterial) == 0x0007C1, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::K2Node_Event_useFovMaterial' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, K2Node_Event_DeltaSeconds) == 0x0007C4, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x0007C8, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Multiply_RotatorFloat_ReturnValue_1) == 0x0008B0, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Multiply_RotatorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_Multiply_RotatorFloat_ReturnValue_2) == 0x0008C8, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_Multiply_RotatorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_K2_AddLocalRotation_SweepHitResult_1) == 0x0008E0, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_K2_AddLocalRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_K2_AddLocalRotation_SweepHitResult_2) == 0x0009C8, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_K2_AddLocalRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x000AB0, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_MakeRotator_Pitch_ImplicitCast_1) == 0x000AB4, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_MakeRotator_Pitch_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_MakeRotator_Pitch_ImplicitCast_2) == 0x000AB8, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_MakeRotator_Pitch_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_MakeRotator_Pitch_ImplicitCast_3) == 0x000ABC, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_MakeRotator_Pitch_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_MakeRotator_Pitch_ImplicitCast_4) == 0x000AC0, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_MakeRotator_Pitch_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15, CallFunc_MakeRotator_Pitch_ImplicitCast_5) == 0x000AC4, "Member 'BP_Item_Gear_Watch_15_C_ExecuteUbergraph_BP_Item_Gear_Watch_15::CallFunc_MakeRotator_Pitch_ImplicitCast_5' has a wrong offset!");

// Function BP_Item_Gear_Watch_15.BP_Item_Gear_Watch_15_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Item_Gear_Watch_15_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Gear_Watch_15_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Item_Gear_Watch_15_C_ReceiveTick");
static_assert(sizeof(BP_Item_Gear_Watch_15_C_ReceiveTick) == 0x000004, "Wrong size on BP_Item_Gear_Watch_15_C_ReceiveTick");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Item_Gear_Watch_15_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Item_Gear_Watch_15.BP_Item_Gear_Watch_15_C.SetCorrectiveFovMaterial
// 0x0001 (0x0001 - 0x0000)
struct BP_Item_Gear_Watch_15_C_SetCorrectiveFovMaterial final
{
public:
	bool                                          UseFovMaterial;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Gear_Watch_15_C_SetCorrectiveFovMaterial) == 0x000001, "Wrong alignment on BP_Item_Gear_Watch_15_C_SetCorrectiveFovMaterial");
static_assert(sizeof(BP_Item_Gear_Watch_15_C_SetCorrectiveFovMaterial) == 0x000001, "Wrong size on BP_Item_Gear_Watch_15_C_SetCorrectiveFovMaterial");
static_assert(offsetof(BP_Item_Gear_Watch_15_C_SetCorrectiveFovMaterial, UseFovMaterial) == 0x000000, "Member 'BP_Item_Gear_Watch_15_C_SetCorrectiveFovMaterial::UseFovMaterial' has a wrong offset!");

}

