#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Item_Gear_Watch_08

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "POLYGON_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Item_Gear_Watch_08.BP_Item_Gear_Watch_08_C
// 0x0018 (0x0328 - 0x0310)
class ABP_Item_Gear_Watch_08_C final : public AItem_Watch_General
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Hour;                                              // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Minute;                                            // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Item_Gear_Watch_08(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetCorrectiveFovMaterial(bool UseFovMaterial);
	void Watch();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Item_Gear_Watch_08_C">();
	}
	static class ABP_Item_Gear_Watch_08_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Item_Gear_Watch_08_C>();
	}
};
static_assert(alignof(ABP_Item_Gear_Watch_08_C) == 0x000008, "Wrong alignment on ABP_Item_Gear_Watch_08_C");
static_assert(sizeof(ABP_Item_Gear_Watch_08_C) == 0x000328, "Wrong size on ABP_Item_Gear_Watch_08_C");
static_assert(offsetof(ABP_Item_Gear_Watch_08_C, UberGraphFrame) == 0x000310, "Member 'ABP_Item_Gear_Watch_08_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Item_Gear_Watch_08_C, Hour) == 0x000318, "Member 'ABP_Item_Gear_Watch_08_C::Hour' has a wrong offset!");
static_assert(offsetof(ABP_Item_Gear_Watch_08_C, Minute) == 0x000320, "Member 'ABP_Item_Gear_Watch_08_C::Minute' has a wrong offset!");

}

