#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Item_Gear_Watch_17

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "POLYGON_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Item_Gear_Watch_17.BP_Item_Gear_Watch_17_C
// 0x0030 (0x0340 - 0x0310)
class ABP_Item_Gear_Watch_17_C final : public AItem_Watch_General
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Watch_17_Tonque;                                // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Minute;                                            // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hour;                                              // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Tonque_Alpha_4D0116BF424C3E385D28DCA125E75373; // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_Tonque__Direction_4D0116BF424C3E385D28DCA125E75373; // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32B8[0x3];                                     // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_Tonque;                                   // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Item_Gear_Watch_17(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetCorrectiveFovMaterial(bool UseFovMaterial);
	void Timeline_Tonque__FinishedFunc();
	void Timeline_Tonque__UpdateFunc();
	void Watch();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Item_Gear_Watch_17_C">();
	}
	static class ABP_Item_Gear_Watch_17_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Item_Gear_Watch_17_C>();
	}
};
static_assert(alignof(ABP_Item_Gear_Watch_17_C) == 0x000008, "Wrong alignment on ABP_Item_Gear_Watch_17_C");
static_assert(sizeof(ABP_Item_Gear_Watch_17_C) == 0x000340, "Wrong size on ABP_Item_Gear_Watch_17_C");
static_assert(offsetof(ABP_Item_Gear_Watch_17_C, UberGraphFrame) == 0x000310, "Member 'ABP_Item_Gear_Watch_17_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Item_Gear_Watch_17_C, SM_Watch_17_Tonque) == 0x000318, "Member 'ABP_Item_Gear_Watch_17_C::SM_Watch_17_Tonque' has a wrong offset!");
static_assert(offsetof(ABP_Item_Gear_Watch_17_C, Minute) == 0x000320, "Member 'ABP_Item_Gear_Watch_17_C::Minute' has a wrong offset!");
static_assert(offsetof(ABP_Item_Gear_Watch_17_C, Hour) == 0x000328, "Member 'ABP_Item_Gear_Watch_17_C::Hour' has a wrong offset!");
static_assert(offsetof(ABP_Item_Gear_Watch_17_C, Timeline_Tonque_Alpha_4D0116BF424C3E385D28DCA125E75373) == 0x000330, "Member 'ABP_Item_Gear_Watch_17_C::Timeline_Tonque_Alpha_4D0116BF424C3E385D28DCA125E75373' has a wrong offset!");
static_assert(offsetof(ABP_Item_Gear_Watch_17_C, Timeline_Tonque__Direction_4D0116BF424C3E385D28DCA125E75373) == 0x000334, "Member 'ABP_Item_Gear_Watch_17_C::Timeline_Tonque__Direction_4D0116BF424C3E385D28DCA125E75373' has a wrong offset!");
static_assert(offsetof(ABP_Item_Gear_Watch_17_C, Timeline_Tonque) == 0x000338, "Member 'ABP_Item_Gear_Watch_17_C::Timeline_Tonque' has a wrong offset!");

}

