#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PG_Menu_Character

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "POLYGON_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PG_Menu_Character.BP_PG_Menu_Character_C
// 0x0100 (0x03B8 - 0x02B8)
class ABP_PG_Menu_Character_C final : public APG_Menu_Character
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Chr_Attach_Patch_Squad_03;                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Item_Crowbar_01;                                // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Item_Pencil_01;                                 // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_PouchM_03;                               // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_PouchB_01;                               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_PouchM_01;                               // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_PouchM_02;                               // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_PouchM_04;                               // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Belt;                                    // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Glowstick_03;                            // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Pouch_Mag_03;                            // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Pouch_Mag_02;                            // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Pouch_Mag_01;                            // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Pouch_Grenade_04;                        // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Pouch_Grenade_03;                        // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_TactFlashlight_01;                       // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Scissors_01;                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_PouchM_06;                               // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Radio_01;                                // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Pouch_Grenade_02;                        // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Pouch_Grenade_01;                        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_PouchM_05;                               // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Grenade_Flash_01;                        // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Grenade_Smoke_01;                        // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Pouch_Mag_04;                            // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Glowstick_01;                            // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Glowstick_02;                            // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_PouchM_07;                               // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Radio_02;                                // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Holster_mesh;                                      // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDataContainerAsset*                    NewVar_0;                                          // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PG_Menu_Character(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PG_Menu_Character_C">();
	}
	static class ABP_PG_Menu_Character_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PG_Menu_Character_C>();
	}
};
static_assert(alignof(ABP_PG_Menu_Character_C) == 0x000008, "Wrong alignment on ABP_PG_Menu_Character_C");
static_assert(sizeof(ABP_PG_Menu_Character_C) == 0x0003B8, "Wrong size on ABP_PG_Menu_Character_C");
static_assert(offsetof(ABP_PG_Menu_Character_C, UberGraphFrame) == 0x0002B8, "Member 'ABP_PG_Menu_Character_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, SM_Chr_Attach_Patch_Squad_03) == 0x0002C0, "Member 'ABP_PG_Menu_Character_C::SM_Chr_Attach_Patch_Squad_03' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, SM_Item_Crowbar_01) == 0x0002C8, "Member 'ABP_PG_Menu_Character_C::SM_Item_Crowbar_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, SM_Item_Pencil_01) == 0x0002D0, "Member 'ABP_PG_Menu_Character_C::SM_Item_Pencil_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_PouchM_03) == 0x0002D8, "Member 'ABP_PG_Menu_Character_C::Equipment_PouchM_03' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_PouchB_01) == 0x0002E0, "Member 'ABP_PG_Menu_Character_C::Equipment_PouchB_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_PouchM_01) == 0x0002E8, "Member 'ABP_PG_Menu_Character_C::Equipment_PouchM_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_PouchM_02) == 0x0002F0, "Member 'ABP_PG_Menu_Character_C::Equipment_PouchM_02' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_PouchM_04) == 0x0002F8, "Member 'ABP_PG_Menu_Character_C::Equipment_PouchM_04' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_Belt) == 0x000300, "Member 'ABP_PG_Menu_Character_C::Equipment_Belt' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_Glowstick_03) == 0x000308, "Member 'ABP_PG_Menu_Character_C::Equipment_Glowstick_03' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_Pouch_Mag_03) == 0x000310, "Member 'ABP_PG_Menu_Character_C::Equipment_Pouch_Mag_03' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_Pouch_Mag_02) == 0x000318, "Member 'ABP_PG_Menu_Character_C::Equipment_Pouch_Mag_02' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_Pouch_Mag_01) == 0x000320, "Member 'ABP_PG_Menu_Character_C::Equipment_Pouch_Mag_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_Pouch_Grenade_04) == 0x000328, "Member 'ABP_PG_Menu_Character_C::Equipment_Pouch_Grenade_04' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_Pouch_Grenade_03) == 0x000330, "Member 'ABP_PG_Menu_Character_C::Equipment_Pouch_Grenade_03' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_TactFlashlight_01) == 0x000338, "Member 'ABP_PG_Menu_Character_C::Equipment_TactFlashlight_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_Scissors_01) == 0x000340, "Member 'ABP_PG_Menu_Character_C::Equipment_Scissors_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_PouchM_06) == 0x000348, "Member 'ABP_PG_Menu_Character_C::Equipment_PouchM_06' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_Radio_01) == 0x000350, "Member 'ABP_PG_Menu_Character_C::Equipment_Radio_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_Pouch_Grenade_02) == 0x000358, "Member 'ABP_PG_Menu_Character_C::Equipment_Pouch_Grenade_02' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_Pouch_Grenade_01) == 0x000360, "Member 'ABP_PG_Menu_Character_C::Equipment_Pouch_Grenade_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_PouchM_05) == 0x000368, "Member 'ABP_PG_Menu_Character_C::Equipment_PouchM_05' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_Grenade_Flash_01) == 0x000370, "Member 'ABP_PG_Menu_Character_C::Equipment_Grenade_Flash_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_Grenade_Smoke_01) == 0x000378, "Member 'ABP_PG_Menu_Character_C::Equipment_Grenade_Smoke_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_Pouch_Mag_04) == 0x000380, "Member 'ABP_PG_Menu_Character_C::Equipment_Pouch_Mag_04' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_Glowstick_01) == 0x000388, "Member 'ABP_PG_Menu_Character_C::Equipment_Glowstick_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_Glowstick_02) == 0x000390, "Member 'ABP_PG_Menu_Character_C::Equipment_Glowstick_02' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_PouchM_07) == 0x000398, "Member 'ABP_PG_Menu_Character_C::Equipment_PouchM_07' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Equipment_Radio_02) == 0x0003A0, "Member 'ABP_PG_Menu_Character_C::Equipment_Radio_02' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, Holster_mesh) == 0x0003A8, "Member 'ABP_PG_Menu_Character_C::Holster_mesh' has a wrong offset!");
static_assert(offsetof(ABP_PG_Menu_Character_C, NewVar_0) == 0x0003B0, "Member 'ABP_PG_Menu_Character_C::NewVar_0' has a wrong offset!");

}

