#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PG_PlayerController_Menu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "POLYGON_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PG_PlayerController_Menu.BP_PG_PlayerController_Menu_C
// 0x0040 (0x08C8 - 0x0888)
class ABP_PG_PlayerController_Menu_C final : public APG_PlayerController_Menu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0888(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUI_Menu_GeneralMenuScreen_C*           UI_GeneralMenuScreen;                              // 0x0890(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_Menu_Character_C*                MenuCharacter;                                     // 0x0898(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUI_ErrorMessage_C*                     UI_ErrorMessage;                                   // 0x08A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Squad_Invite_C*                UI_Squad_Invite;                                   // 0x08A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_HardLoadingScreen_C*                UI_HardLoadingScreen;                              // 0x08B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_SoftLoadingScreen_C*                UI_SoftLoadingScreen;                              // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        BackgroundMusic;                                   // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PG_PlayerController_Menu(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetVisibleHardLoadingScreen(bool IsVisible);
	void SetVisibleSoftLoadingScreen(bool IsVisible);
	void ShowError(const class FText& ErrorMessage, const class FText& ErrorDetails);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PG_PlayerController_Menu_C">();
	}
	static class ABP_PG_PlayerController_Menu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PG_PlayerController_Menu_C>();
	}
};
static_assert(alignof(ABP_PG_PlayerController_Menu_C) == 0x000008, "Wrong alignment on ABP_PG_PlayerController_Menu_C");
static_assert(sizeof(ABP_PG_PlayerController_Menu_C) == 0x0008C8, "Wrong size on ABP_PG_PlayerController_Menu_C");
static_assert(offsetof(ABP_PG_PlayerController_Menu_C, UberGraphFrame) == 0x000888, "Member 'ABP_PG_PlayerController_Menu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PG_PlayerController_Menu_C, UI_GeneralMenuScreen) == 0x000890, "Member 'ABP_PG_PlayerController_Menu_C::UI_GeneralMenuScreen' has a wrong offset!");
static_assert(offsetof(ABP_PG_PlayerController_Menu_C, MenuCharacter) == 0x000898, "Member 'ABP_PG_PlayerController_Menu_C::MenuCharacter' has a wrong offset!");
static_assert(offsetof(ABP_PG_PlayerController_Menu_C, UI_ErrorMessage) == 0x0008A0, "Member 'ABP_PG_PlayerController_Menu_C::UI_ErrorMessage' has a wrong offset!");
static_assert(offsetof(ABP_PG_PlayerController_Menu_C, UI_Squad_Invite) == 0x0008A8, "Member 'ABP_PG_PlayerController_Menu_C::UI_Squad_Invite' has a wrong offset!");
static_assert(offsetof(ABP_PG_PlayerController_Menu_C, UI_HardLoadingScreen) == 0x0008B0, "Member 'ABP_PG_PlayerController_Menu_C::UI_HardLoadingScreen' has a wrong offset!");
static_assert(offsetof(ABP_PG_PlayerController_Menu_C, UI_SoftLoadingScreen) == 0x0008B8, "Member 'ABP_PG_PlayerController_Menu_C::UI_SoftLoadingScreen' has a wrong offset!");
static_assert(offsetof(ABP_PG_PlayerController_Menu_C, BackgroundMusic) == 0x0008C0, "Member 'ABP_PG_PlayerController_Menu_C::BackgroundMusic' has a wrong offset!");

}

