#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PG_Game_Character

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "POLYGON_structs.hpp"
#include "POLYGON_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PG_Game_Character.BP_PG_Game_Character_C
// 0x0140 (0x0880 - 0x0740)
class ABP_PG_Game_Character_C final : public APG_Game_Character
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0740(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Chr_Attach_Patch_Squad_03;                      // 0x0748(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Item_Crowbar_01;                                // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Item_Pencil_01;                                 // 0x0758(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_PouchB_01;                               // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Glowstick_03;                            // 0x0768(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_PouchM_01;                               // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_PouchM_02;                               // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_PouchM_04;                               // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Glowstick_01;                            // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Glowstick_02;                            // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_PouchM_03;                               // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Radio_02;                                // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Radio_01;                                // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Pouch_Mag_04;                            // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_PouchM_07;                               // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_TactFlashlight_01;                       // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Grenade_Flash_01;                        // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Grenade_Smoke_01;                        // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Pouch_Grenade_03;                        // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Pouch_Grenade_04;                        // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Scissors_01;                             // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_PouchM_06;                               // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_PouchM_05;                               // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Pouch_Grenade_02;                        // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Pouch_Grenade_01;                        // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Pouch_Mag_01;                            // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Pouch_Mag_02;                            // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Pouch_Mag_03;                            // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Equipment_Belt;                                    // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Holster_mesh;                                      // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NeutralizationVignetteImpact_Aplha_C3DAEC164EEEDF0B1E076F90BD0F5BC3; // 0x0840(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_NeutralizationVignetteImpact__Direction_C3DAEC164EEEDF0B1E076F90BD0F5BC3; // 0x0844(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED4[0x3];                                     // 0x0845(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_NeutralizationVignetteImpact;             // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_PostProcessScopeBlurWeight_Alpha_3680AFA946185937314F8B81F52A2B4F; // 0x0850(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_PostProcessScopeBlurWeight__Direction_3680AFA946185937314F8B81F52A2B4F; // 0x0854(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED5[0x3];                                     // 0x0855(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_PostProcessScopeBlurWeight;               // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MI_ScopeBlur;                                      // 0x0860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MI_GunBlur;                                        // 0x0868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	double                                        SaveNeutralizationFire;                            // 0x0870(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void BndEvt__BP_PG_Character_WeaponComponent_K2Node_ComponentBoundEvent_0_OnAimingDelegate__DelegateSignature(class AItem_Module_Optic* OpticItem);
	void CameraNeutralizationEffectEvent(const float Damage);
	void DeathEvent(class APG_PlayerState_Game* Killer, EPlayerDeathType DeathType);
	void EventTakeDamage(const struct FVector& Origin);
	void ExecuteUbergraph_BP_PG_Game_Character(int32 EntryPoint);
	void HitAtProtectedCharacter();
	void OnAiming(class AItem_Module_Optic* Optic);
	void OnIsAlive_Event();
	void OnJumped();
	void ReceiveBeginPlay();
	void Respawn();
	void SetCorrectiveFovMaterial(bool UseFovMaterial);
	void SetCorrectiveFovMaterialImplementation(const bool UseFovMaterial);
	void SetPlayerLooks(class APG_Game_Character* Character, const bool bIsLooks);
	void SetPlayerLooksOverride(class APG_Game_Character* Character, bool IsLooks);
	void SetVisibleMarkerByDistance();
	void Timeline_NeutralizationVignetteImpact__FinishedFunc();
	void Timeline_NeutralizationVignetteImpact__UpdateFunc();
	void Timeline_PostProcessScopeBlurWeight__FinishedFunc();
	void Timeline_PostProcessScopeBlurWeight__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PG_Game_Character_C">();
	}
	static class ABP_PG_Game_Character_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PG_Game_Character_C>();
	}
};
static_assert(alignof(ABP_PG_Game_Character_C) == 0x000010, "Wrong alignment on ABP_PG_Game_Character_C");
static_assert(sizeof(ABP_PG_Game_Character_C) == 0x000880, "Wrong size on ABP_PG_Game_Character_C");
static_assert(offsetof(ABP_PG_Game_Character_C, UberGraphFrame) == 0x000740, "Member 'ABP_PG_Game_Character_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, SM_Chr_Attach_Patch_Squad_03) == 0x000748, "Member 'ABP_PG_Game_Character_C::SM_Chr_Attach_Patch_Squad_03' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, SM_Item_Crowbar_01) == 0x000750, "Member 'ABP_PG_Game_Character_C::SM_Item_Crowbar_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, SM_Item_Pencil_01) == 0x000758, "Member 'ABP_PG_Game_Character_C::SM_Item_Pencil_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_PouchB_01) == 0x000760, "Member 'ABP_PG_Game_Character_C::Equipment_PouchB_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_Glowstick_03) == 0x000768, "Member 'ABP_PG_Game_Character_C::Equipment_Glowstick_03' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_PouchM_01) == 0x000770, "Member 'ABP_PG_Game_Character_C::Equipment_PouchM_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_PouchM_02) == 0x000778, "Member 'ABP_PG_Game_Character_C::Equipment_PouchM_02' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_PouchM_04) == 0x000780, "Member 'ABP_PG_Game_Character_C::Equipment_PouchM_04' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_Glowstick_01) == 0x000788, "Member 'ABP_PG_Game_Character_C::Equipment_Glowstick_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_Glowstick_02) == 0x000790, "Member 'ABP_PG_Game_Character_C::Equipment_Glowstick_02' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_PouchM_03) == 0x000798, "Member 'ABP_PG_Game_Character_C::Equipment_PouchM_03' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_Radio_02) == 0x0007A0, "Member 'ABP_PG_Game_Character_C::Equipment_Radio_02' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_Radio_01) == 0x0007A8, "Member 'ABP_PG_Game_Character_C::Equipment_Radio_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_Pouch_Mag_04) == 0x0007B0, "Member 'ABP_PG_Game_Character_C::Equipment_Pouch_Mag_04' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_PouchM_07) == 0x0007B8, "Member 'ABP_PG_Game_Character_C::Equipment_PouchM_07' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_TactFlashlight_01) == 0x0007C0, "Member 'ABP_PG_Game_Character_C::Equipment_TactFlashlight_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_Grenade_Flash_01) == 0x0007C8, "Member 'ABP_PG_Game_Character_C::Equipment_Grenade_Flash_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_Grenade_Smoke_01) == 0x0007D0, "Member 'ABP_PG_Game_Character_C::Equipment_Grenade_Smoke_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_Pouch_Grenade_03) == 0x0007D8, "Member 'ABP_PG_Game_Character_C::Equipment_Pouch_Grenade_03' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_Pouch_Grenade_04) == 0x0007E0, "Member 'ABP_PG_Game_Character_C::Equipment_Pouch_Grenade_04' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_Scissors_01) == 0x0007E8, "Member 'ABP_PG_Game_Character_C::Equipment_Scissors_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_PouchM_06) == 0x0007F0, "Member 'ABP_PG_Game_Character_C::Equipment_PouchM_06' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_PouchM_05) == 0x0007F8, "Member 'ABP_PG_Game_Character_C::Equipment_PouchM_05' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_Pouch_Grenade_02) == 0x000800, "Member 'ABP_PG_Game_Character_C::Equipment_Pouch_Grenade_02' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_Pouch_Grenade_01) == 0x000808, "Member 'ABP_PG_Game_Character_C::Equipment_Pouch_Grenade_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_Pouch_Mag_01) == 0x000810, "Member 'ABP_PG_Game_Character_C::Equipment_Pouch_Mag_01' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_Pouch_Mag_02) == 0x000818, "Member 'ABP_PG_Game_Character_C::Equipment_Pouch_Mag_02' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_Pouch_Mag_03) == 0x000820, "Member 'ABP_PG_Game_Character_C::Equipment_Pouch_Mag_03' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Equipment_Belt) == 0x000828, "Member 'ABP_PG_Game_Character_C::Equipment_Belt' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Holster_mesh) == 0x000830, "Member 'ABP_PG_Game_Character_C::Holster_mesh' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Arrow1) == 0x000838, "Member 'ABP_PG_Game_Character_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Timeline_NeutralizationVignetteImpact_Aplha_C3DAEC164EEEDF0B1E076F90BD0F5BC3) == 0x000840, "Member 'ABP_PG_Game_Character_C::Timeline_NeutralizationVignetteImpact_Aplha_C3DAEC164EEEDF0B1E076F90BD0F5BC3' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Timeline_NeutralizationVignetteImpact__Direction_C3DAEC164EEEDF0B1E076F90BD0F5BC3) == 0x000844, "Member 'ABP_PG_Game_Character_C::Timeline_NeutralizationVignetteImpact__Direction_C3DAEC164EEEDF0B1E076F90BD0F5BC3' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Timeline_NeutralizationVignetteImpact) == 0x000848, "Member 'ABP_PG_Game_Character_C::Timeline_NeutralizationVignetteImpact' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Timeline_PostProcessScopeBlurWeight_Alpha_3680AFA946185937314F8B81F52A2B4F) == 0x000850, "Member 'ABP_PG_Game_Character_C::Timeline_PostProcessScopeBlurWeight_Alpha_3680AFA946185937314F8B81F52A2B4F' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Timeline_PostProcessScopeBlurWeight__Direction_3680AFA946185937314F8B81F52A2B4F) == 0x000854, "Member 'ABP_PG_Game_Character_C::Timeline_PostProcessScopeBlurWeight__Direction_3680AFA946185937314F8B81F52A2B4F' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, Timeline_PostProcessScopeBlurWeight) == 0x000858, "Member 'ABP_PG_Game_Character_C::Timeline_PostProcessScopeBlurWeight' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, MI_ScopeBlur) == 0x000860, "Member 'ABP_PG_Game_Character_C::MI_ScopeBlur' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, MI_GunBlur) == 0x000868, "Member 'ABP_PG_Game_Character_C::MI_GunBlur' has a wrong offset!");
static_assert(offsetof(ABP_PG_Game_Character_C, SaveNeutralizationFire) == 0x000870, "Member 'ABP_PG_Game_Character_C::SaveNeutralizationFire' has a wrong offset!");

}

