#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PG_Game_Character

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function BP_PG_Game_Character.BP_PG_Game_Character_C.BndEvt__BP_PG_Character_WeaponComponent_K2Node_ComponentBoundEvent_0_OnAimingDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_PG_Game_Character_C_BndEvt__BP_PG_Character_WeaponComponent_K2Node_ComponentBoundEvent_0_OnAimingDelegate__DelegateSignature final
{
public:
	class AItem_Module_Optic*                     OpticItem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PG_Game_Character_C_BndEvt__BP_PG_Character_WeaponComponent_K2Node_ComponentBoundEvent_0_OnAimingDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_PG_Game_Character_C_BndEvt__BP_PG_Character_WeaponComponent_K2Node_ComponentBoundEvent_0_OnAimingDelegate__DelegateSignature");
static_assert(sizeof(BP_PG_Game_Character_C_BndEvt__BP_PG_Character_WeaponComponent_K2Node_ComponentBoundEvent_0_OnAimingDelegate__DelegateSignature) == 0x000008, "Wrong size on BP_PG_Game_Character_C_BndEvt__BP_PG_Character_WeaponComponent_K2Node_ComponentBoundEvent_0_OnAimingDelegate__DelegateSignature");
static_assert(offsetof(BP_PG_Game_Character_C_BndEvt__BP_PG_Character_WeaponComponent_K2Node_ComponentBoundEvent_0_OnAimingDelegate__DelegateSignature, OpticItem) == 0x000000, "Member 'BP_PG_Game_Character_C_BndEvt__BP_PG_Character_WeaponComponent_K2Node_ComponentBoundEvent_0_OnAimingDelegate__DelegateSignature::OpticItem' has a wrong offset!");

// Function BP_PG_Game_Character.BP_PG_Game_Character_C.CameraNeutralizationEffectEvent
// 0x0004 (0x0004 - 0x0000)
struct BP_PG_Game_Character_C_CameraNeutralizationEffectEvent final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PG_Game_Character_C_CameraNeutralizationEffectEvent) == 0x000004, "Wrong alignment on BP_PG_Game_Character_C_CameraNeutralizationEffectEvent");
static_assert(sizeof(BP_PG_Game_Character_C_CameraNeutralizationEffectEvent) == 0x000004, "Wrong size on BP_PG_Game_Character_C_CameraNeutralizationEffectEvent");
static_assert(offsetof(BP_PG_Game_Character_C_CameraNeutralizationEffectEvent, Damage) == 0x000000, "Member 'BP_PG_Game_Character_C_CameraNeutralizationEffectEvent::Damage' has a wrong offset!");

// Function BP_PG_Game_Character.BP_PG_Game_Character_C.DeathEvent
// 0x0010 (0x0010 - 0x0000)
struct BP_PG_Game_Character_C_DeathEvent final
{
public:
	class APG_PlayerState_Game*                   Killer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPlayerDeathType                              DeathType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PG_Game_Character_C_DeathEvent) == 0x000008, "Wrong alignment on BP_PG_Game_Character_C_DeathEvent");
static_assert(sizeof(BP_PG_Game_Character_C_DeathEvent) == 0x000010, "Wrong size on BP_PG_Game_Character_C_DeathEvent");
static_assert(offsetof(BP_PG_Game_Character_C_DeathEvent, Killer) == 0x000000, "Member 'BP_PG_Game_Character_C_DeathEvent::Killer' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_DeathEvent, DeathType) == 0x000008, "Member 'BP_PG_Game_Character_C_DeathEvent::DeathType' has a wrong offset!");

// Function BP_PG_Game_Character.BP_PG_Game_Character_C.EventTakeDamage
// 0x0018 (0x0018 - 0x0000)
struct BP_PG_Game_Character_C_EventTakeDamage final
{
public:
	struct FVector                                Origin;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PG_Game_Character_C_EventTakeDamage) == 0x000008, "Wrong alignment on BP_PG_Game_Character_C_EventTakeDamage");
static_assert(sizeof(BP_PG_Game_Character_C_EventTakeDamage) == 0x000018, "Wrong size on BP_PG_Game_Character_C_EventTakeDamage");
static_assert(offsetof(BP_PG_Game_Character_C_EventTakeDamage, Origin) == 0x000000, "Member 'BP_PG_Game_Character_C_EventTakeDamage::Origin' has a wrong offset!");

// Function BP_PG_Game_Character.BP_PG_Game_Character_C.ExecuteUbergraph_BP_PG_Game_Character
// 0x0330 (0x0330 - 0x0000)
struct BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_HitIndicator_C*                     CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AItem_Module_Optic*                     K2Node_ComponentBoundEvent_OpticItem;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_Game_Character*                     K2Node_Event_character;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsLooks;                             // 0x0030(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED7[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_PlayerMarker_C*                     K2Node_DynamicCast_AsUI_Player_Marker;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED8[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_1;                  // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_PlayerMarker_C*                     K2Node_DynamicCast_AsUI_Player_Marker_1;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED9[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNeutralizationVignetteImpact_ReturnValue; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNeutralizationVignetteImpact_ReturnValue_1; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNeutralizationVignetteImpact_ReturnValue_2; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNeutralizationVignetteImpact_ReturnValue_3; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EDA[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNeutralizationVignetteImpact_ReturnValue_4; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EDB[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EDC[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EDD[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x00D0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EDE[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_KillCam_C*                          CallFunc_Create_ReturnValue_1;                     // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_origin;                               // 0x00F0(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Game*                   K2Node_Event_killer;                               // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPlayerDeathType                              K2Node_Event_deathType;                            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EDF[0x5];                                     // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EE0[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_CharacterPG_FP_C*                  K2Node_DynamicCast_AsABP_Character_PG_FP;          // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_useFovMaterial;                       // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAiming_ReturnValue;                     // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EE1[0x1];                                     // 0x013F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0140(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue;                 // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x01AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x01AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_5;          // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_6;          // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EE2[0x3];                                     // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EE3[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETeam                                         CallFunc_GetTeam_ReturnValue;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EE4[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game_1;    // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x01E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EE5[0x4];                                     // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTask_Character_SetupByTeam_C*          CallFunc_CreateAction_ReturnValue;                 // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EE6[0x6];                                     // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_2;                  // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_PlayerMarker_C*                     K2Node_DynamicCast_AsUI_Player_Marker_2;           // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EE7[0x3];                                     // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0264(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EE8[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_3;                  // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_PlayerMarker_C*                     K2Node_DynamicCast_AsUI_Player_Marker_3;           // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EE9[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue_1;               // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EEA[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EEB[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game_2;    // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EEC[0x7];                                     // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game_3;    // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EED[0x6];                                     // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_SaveNeutralizationFire_ImplicitCast; // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_SceneFringeIntensity_ImplicitCast; // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EEE[0x4];                                     // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_SceneFringeIntensity_ImplicitCast_1; // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EEF[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNeutralizationVignetteImpact_newNeutralizationVignetteImpact_ImplicitCast; // 0x0318(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EF0[0x4];                                     // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNeutralizationVignetteImpact_newNeutralizationVignetteImpact_ImplicitCast_1; // 0x0328(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character) == 0x000010, "Wrong alignment on BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character");
static_assert(sizeof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character) == 0x000330, "Wrong size on BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, EntryPoint) == 0x000000, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetPlayerController_ReturnValue_1) == 0x000010, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Create_ReturnValue) == 0x000018, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_ComponentBoundEvent_OpticItem) == 0x000020, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_ComponentBoundEvent_OpticItem' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_Event_character) == 0x000028, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_Event_character' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_Event_bIsLooks) == 0x000030, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_Event_bIsLooks' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetWidget_ReturnValue) == 0x000038, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_AsUI_Player_Marker) == 0x000040, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_AsUI_Player_Marker' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetWidget_ReturnValue_1) == 0x000050, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_AsUI_Player_Marker_1) == 0x000058, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_AsUI_Player_Marker_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetNeutralizationVignetteImpact_ReturnValue) == 0x000064, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetNeutralizationVignetteImpact_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_PlayAnimationForward_ReturnValue) == 0x000068, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetNeutralizationVignetteImpact_ReturnValue_1) == 0x000070, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetNeutralizationVignetteImpact_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetNeutralizationVignetteImpact_ReturnValue_2) == 0x000074, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetNeutralizationVignetteImpact_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000078, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetNeutralizationVignetteImpact_ReturnValue_3) == 0x000080, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetNeutralizationVignetteImpact_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetNeutralizationVignetteImpact_ReturnValue_4) == 0x000090, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetNeutralizationVignetteImpact_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000098, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000A0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x0000A8, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x0000B8, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_bSuccess_3) == 0x0000C0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_IsLocallyControlled_ReturnValue) == 0x0000C1, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetPlayerController_ReturnValue_3) == 0x0000C8, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_Event_damage) == 0x0000D0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Create_ReturnValue_1) == 0x0000D8, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_MapRangeClamped_ReturnValue) == 0x0000E0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0000E8, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_Event_origin) == 0x0000F0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_Event_origin' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_FMin_ReturnValue) == 0x000108, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_Event_killer) == 0x000110, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_Event_killer' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_Event_deathType) == 0x000118, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_Event_deathType' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000119, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_BooleanAND_ReturnValue) == 0x00011A, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetAnimInstance_ReturnValue) == 0x000120, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_IsDedicatedServer_ReturnValue) == 0x000128, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_AsABP_Character_PG_FP) == 0x000130, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_AsABP_Character_PG_FP' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_bSuccess_4) == 0x000138, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Not_PreBool_ReturnValue) == 0x000139, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_Event_useFovMaterial) == 0x00013A, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_Event_useFovMaterial' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_IsValid_ReturnValue) == 0x00013B, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_IsAiming_ReturnValue) == 0x00013C, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_IsAiming_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetLocalRole_ReturnValue) == 0x00013D, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetLocalRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00013E, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_MakeTransform_ReturnValue) == 0x000140, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_AddComponent_ReturnValue) == 0x0001A0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0001A8, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001A9, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0001AA, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0001AB, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001AC, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001AD, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x0001AE, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x0001AF, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Not_PreBool_ReturnValue_3) == 0x0001B0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Not_PreBool_ReturnValue_4) == 0x0001B1, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_IsDedicatedServer_ReturnValue_5) == 0x0001B2, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_IsDedicatedServer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Not_PreBool_ReturnValue_5) == 0x0001B3, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_IsDedicatedServer_ReturnValue_6) == 0x0001B4, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_IsDedicatedServer_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0001B8, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_IsValid_ReturnValue_1) == 0x0001C0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetPlayerController_ReturnValue_4) == 0x0001C8, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetTeam_ReturnValue) == 0x0001D0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_AsBP_PG_Player_State_Game_1) == 0x0001D8, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_AsBP_PG_Player_State_Game_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_bSuccess_5) == 0x0001E0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001E1, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Not_PreBool_ReturnValue_6) == 0x0001E2, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0001E3, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x0001E8, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001F0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000208, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000220, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_VSize_ReturnValue) == 0x000238, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_CreateAction_ReturnValue) == 0x000240, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_CreateAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000248, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_BooleanAND_ReturnValue_1) == 0x000249, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetWidget_ReturnValue_2) == 0x000250, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_AsUI_Player_Marker_2) == 0x000258, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_AsUI_Player_Marker_2' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_bSuccess_6) == 0x000260, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_CreateDelegate_OutputDelegate) == 0x000264, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000278, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetWidget_ReturnValue_3) == 0x000280, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetWidget_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_AsUI_Player_Marker_3) == 0x000288, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_AsUI_Player_Marker_3' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_bSuccess_7) == 0x000290, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Lerp_ReturnValue) == 0x000298, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetLocalRole_ReturnValue_1) == 0x0002A0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetLocalRole_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0002A8, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0002B0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_AsBP_PG_Player_State_Game_2) == 0x0002B8, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_AsBP_PG_Player_State_Game_2' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_bSuccess_8) == 0x0002C0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_GetPlayerController_ReturnValue_5) == 0x0002C8, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_AsBP_PG_Player_State_Game_3) == 0x0002D0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_AsBP_PG_Player_State_Game_3' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_DynamicCast_bSuccess_9) == 0x0002D8, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0002D9, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0002E0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0002E8, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_VariableSet_SaveNeutralizationFire_ImplicitCast) == 0x0002F0, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_VariableSet_SaveNeutralizationFire_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_SetFieldsInStruct_SceneFringeIntensity_ImplicitCast) == 0x0002F8, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_SetFieldsInStruct_SceneFringeIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000300, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, K2Node_SetFieldsInStruct_SceneFringeIntensity_ImplicitCast_1) == 0x000308, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::K2Node_SetFieldsInStruct_SceneFringeIntensity_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000310, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_SetNeutralizationVignetteImpact_newNeutralizationVignetteImpact_ImplicitCast) == 0x000318, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_SetNeutralizationVignetteImpact_newNeutralizationVignetteImpact_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000320, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character, CallFunc_SetNeutralizationVignetteImpact_newNeutralizationVignetteImpact_ImplicitCast_1) == 0x000328, "Member 'BP_PG_Game_Character_C_ExecuteUbergraph_BP_PG_Game_Character::CallFunc_SetNeutralizationVignetteImpact_newNeutralizationVignetteImpact_ImplicitCast_1' has a wrong offset!");

// Function BP_PG_Game_Character.BP_PG_Game_Character_C.OnAiming
// 0x0078 (0x0078 - 0x0000)
struct BP_PG_Game_Character_C_OnAiming final
{
public:
	class AItem_Module_Optic*                     Optic;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AItem_Module_Optic*                     L_Optic;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
