#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UserEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OnlineSubsystemBlueprints_structs.hpp"


namespace SDK::Params
{

// Function BP_UserEntry.BP_UserEntry_C.ExecuteUbergraph_BP_UserEntry
// 0x0210 (0x0210 - 0x0000)
struct BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWasSuccessful_1;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3425[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_CustomEvent_ResultTexture_1;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bWasSuccessful, class UTexture* ResultTexture)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWasSuccessful;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3426[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_CustomEvent_ResultTexture;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bWasSuccessful, class UTexture* ResultTexture)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3427[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_UserId_1;                       // 0x0050(0x0030)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FUniqueNetIdRepl& UserId, const struct FOnlineUserPresenceData& Presence)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetControllerUniqueNetId_ReturnValue;     // 0x0098(0x0030)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlinePresenceSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetControllerUniqueNetId_ReturnValue_1;   // 0x00D8(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FUniqueNetIdReplFUniqueNetIdRepl_ReturnValue; // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3428[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_UserId;                         // 0x0110(0x0030)(HasGetValueTypeHash)
	struct FOnlineUserPresenceData                K2Node_CustomEvent_Presence;                       // 0x0140(0x00A8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FUniqueNetIdReplFUniqueNetIdRepl_ReturnValue_1; // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3429[0x6];                                     // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineAvatarSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FUniqueNetIdIsValid_ReturnValue;          // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342A[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineAvatarSubsystemGetAvatar*        CallFunc_GetAvatar_ReturnValue;                    // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry) == 0x000008, "Wrong alignment on BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry");
static_assert(sizeof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry) == 0x000210, "Wrong size on BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, EntryPoint) == 0x000000, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, K2Node_CustomEvent_bWasSuccessful_1) == 0x000004, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::K2Node_CustomEvent_bWasSuccessful_1' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, K2Node_CustomEvent_ResultTexture_1) == 0x000008, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::K2Node_CustomEvent_ResultTexture_1' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, K2Node_CustomEvent_bWasSuccessful) == 0x000020, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::K2Node_CustomEvent_bWasSuccessful' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, K2Node_CustomEvent_ResultTexture) == 0x000028, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::K2Node_CustomEvent_ResultTexture' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, Temp_object_Variable) == 0x000040, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, Temp_bool_Variable) == 0x000048, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, K2Node_CustomEvent_UserId_1) == 0x000050, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::K2Node_CustomEvent_UserId_1' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, CallFunc_GetPlayerController_ReturnValue) == 0x000080, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, CallFunc_GetControllerUniqueNetId_ReturnValue) == 0x000098, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::CallFunc_GetControllerUniqueNetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000C8, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000D0, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, CallFunc_GetControllerUniqueNetId_ReturnValue_1) == 0x0000D8, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::CallFunc_GetControllerUniqueNetId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, CallFunc_EqualEqual_FUniqueNetIdReplFUniqueNetIdRepl_ReturnValue) == 0x000108, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::CallFunc_EqualEqual_FUniqueNetIdReplFUniqueNetIdRepl_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, K2Node_CustomEvent_UserId) == 0x000110, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::K2Node_CustomEvent_UserId' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, K2Node_CustomEvent_Presence) == 0x000140, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::K2Node_CustomEvent_Presence' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, CallFunc_Not_PreBool_ReturnValue) == 0x0001E8, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, CallFunc_EqualEqual_FUniqueNetIdReplFUniqueNetIdRepl_ReturnValue_1) == 0x0001E9, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::CallFunc_EqualEqual_FUniqueNetIdReplFUniqueNetIdRepl_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0001F0, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, CallFunc_FUniqueNetIdIsValid_ReturnValue) == 0x0001F8, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::CallFunc_FUniqueNetIdIsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, CallFunc_GetAvatar_ReturnValue) == 0x000200, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::CallFunc_GetAvatar_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry, CallFunc_IsValid_ReturnValue) == 0x000208, "Member 'BP_UserEntry_C_ExecuteUbergraph_BP_UserEntry::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_UserEntry.BP_UserEntry_C.OnCallFailed_824A0C6B4C2DBA1D157208B3CDEF0AE0
// 0x0010 (0x0010 - 0x0000)
struct BP_UserEntry_C_OnCallFailed_824A0C6B4C2DBA1D157208B3CDEF0AE0 final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               ResultTexture;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UserEntry_C_OnCallFailed_824A0C6B4C2DBA1D157208B3CDEF0AE0) == 0x000008, "Wrong alignment on BP_UserEntry_C_OnCallFailed_824A0C6B4C2DBA1D157208B3CDEF0AE0");
static_assert(sizeof(BP_UserEntry_C_OnCallFailed_824A0C6B4C2DBA1D157208B3CDEF0AE0) == 0x000010, "Wrong size on BP_UserEntry_C_OnCallFailed_824A0C6B4C2DBA1D157208B3CDEF0AE0");
static_assert(offsetof(BP_UserEntry_C_OnCallFailed_824A0C6B4C2DBA1D157208B3CDEF0AE0, bWasSuccessful) == 0x000000, "Member 'BP_UserEntry_C_OnCallFailed_824A0C6B4C2DBA1D157208B3CDEF0AE0::bWasSuccessful' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_OnCallFailed_824A0C6B4C2DBA1D157208B3CDEF0AE0, ResultTexture) == 0x000008, "Member 'BP_UserEntry_C_OnCallFailed_824A0C6B4C2DBA1D157208B3CDEF0AE0::ResultTexture' has a wrong offset!");

// Function BP_UserEntry.BP_UserEntry_C.OnGetAvatarComplete_824A0C6B4C2DBA1D157208B3CDEF0AE0
// 0x0010 (0x0010 - 0x0000)
struct BP_UserEntry_C_OnGetAvatarComplete_824A0C6B4C2DBA1D157208B3CDEF0AE0 final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               ResultTexture;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UserEntry_C_OnGetAvatarComplete_824A0C6B4C2DBA1D157208B3CDEF0AE0) == 0x000008, "Wrong alignment on BP_UserEntry_C_OnGetAvatarComplete_824A0C6B4C2DBA1D157208B3CDEF0AE0");
static_assert(sizeof(BP_UserEntry_C_OnGetAvatarComplete_824A0C6B4C2DBA1D157208B3CDEF0AE0) == 0x000010, "Wrong size on BP_UserEntry_C_OnGetAvatarComplete_824A0C6B4C2DBA1D157208B3CDEF0AE0");
static_assert(offsetof(BP_UserEntry_C_OnGetAvatarComplete_824A0C6B4C2DBA1D157208B3CDEF0AE0, bWasSuccessful) == 0x000000, "Member 'BP_UserEntry_C_OnGetAvatarComplete_824A0C6B4C2DBA1D157208B3CDEF0AE0::bWasSuccessful' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_OnGetAvatarComplete_824A0C6B4C2DBA1D157208B3CDEF0AE0, ResultTexture) == 0x000008, "Member 'BP_UserEntry_C_OnGetAvatarComplete_824A0C6B4C2DBA1D157208B3CDEF0AE0::ResultTexture' has a wrong offset!");

// Function BP_UserEntry.BP_UserEntry_C.OnPresenceReceived_Event
// 0x00D8 (0x00D8 - 0x0000)
struct BP_UserEntry_C_OnPresenceReceived_Event final
{
public:
	struct FUniqueNetIdRepl                       Param_UserId;                                      // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FOnlineUserPresenceData                Presence;                                          // 0x0030(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_UserEntry_C_OnPresenceReceived_Event) == 0x000008, "Wrong alignment on BP_UserEntry_C_OnPresenceReceived_Event");
static_assert(sizeof(BP_UserEntry_C_OnPresenceReceived_Event) == 0x0000D8, "Wrong size on BP_UserEntry_C_OnPresenceReceived_Event");
static_assert(offsetof(BP_UserEntry_C_OnPresenceReceived_Event, Param_UserId) == 0x000000, "Member 'BP_UserEntry_C_OnPresenceReceived_Event::Param_UserId' has a wrong offset!");
static_assert(offsetof(BP_UserEntry_C_OnPresenceReceived_Event, Presence) == 0x000030, "Member 'BP_UserEntry_C_OnPresenceReceived_Event::Presence' has a wrong offset!");

// Function BP_UserEntry.BP_UserEntry_C.ParseUserInfo
// 0x0030 (0x0030 - 0x0000)
struct BP_UserEntry_C_ParseUserInfo final
{
public:
	struct FUniqueNetIdRepl                       Param_UserId;                                      // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_UserEntry_C_ParseUserInfo) == 0x000008, "Wrong alignment on BP_UserEntry_C_ParseUserInfo");
static_assert(sizeof(BP_UserEntry_C_ParseUserInfo) == 0x000030, "Wrong size on BP_UserEntry_C_ParseUserInfo");
static_assert(offsetof(BP_UserEntry_C_ParseUserInfo, Param_UserId) == 0x000000, "Member 'BP_UserEntry_C_ParseUserInfo::Param_UserId' has a wrong offset!");

}

