#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultBindCaptureButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AutoSettingsInput_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DefaultBindCaptureButton.DefaultBindCaptureButton_C
// 0x0018 (0x02C8 - 0x02B0)
class UDefaultBindCaptureButton_C final : public UBindCaptureButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_0;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Content;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_DefaultBindCaptureButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DefaultBindCaptureButton_C">();
	}
	static class UDefaultBindCaptureButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultBindCaptureButton_C>();
	}
};
static_assert(alignof(UDefaultBindCaptureButton_C) == 0x000008, "Wrong alignment on UDefaultBindCaptureButton_C");
static_assert(sizeof(UDefaultBindCaptureButton_C) == 0x0002C8, "Wrong size on UDefaultBindCaptureButton_C");
static_assert(offsetof(UDefaultBindCaptureButton_C, UberGraphFrame) == 0x0002B0, "Member 'UDefaultBindCaptureButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDefaultBindCaptureButton_C, Button_0) == 0x0002B8, "Member 'UDefaultBindCaptureButton_C::Button_0' has a wrong offset!");
static_assert(offsetof(UDefaultBindCaptureButton_C, Content) == 0x0002C0, "Member 'UDefaultBindCaptureButton_C::Content' has a wrong offset!");

}

