#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExtendedBlueprintsUtilities

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ExtendedBlueprintsUtilities.ExtendedBlueprintsUtilitiesBPLibrary.ClassDefaultObject
// 0x0010 (0x0010 - 0x0000)
struct ExtendedBlueprintsUtilitiesBPLibrary_ClassDefaultObject final
{
public:
	class UClass*                                 ObjectClass;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExtendedBlueprintsUtilitiesBPLibrary_ClassDefaultObject) == 0x000008, "Wrong alignment on ExtendedBlueprintsUtilitiesBPLibrary_ClassDefaultObject");
static_assert(sizeof(ExtendedBlueprintsUtilitiesBPLibrary_ClassDefaultObject) == 0x000010, "Wrong size on ExtendedBlueprintsUtilitiesBPLibrary_ClassDefaultObject");
static_assert(offsetof(ExtendedBlueprintsUtilitiesBPLibrary_ClassDefaultObject, ObjectClass) == 0x000000, "Member 'ExtendedBlueprintsUtilitiesBPLibrary_ClassDefaultObject::ObjectClass' has a wrong offset!");
static_assert(offsetof(ExtendedBlueprintsUtilitiesBPLibrary_ClassDefaultObject, ReturnValue) == 0x000008, "Member 'ExtendedBlueprintsUtilitiesBPLibrary_ClassDefaultObject::ReturnValue' has a wrong offset!");

// Function ExtendedBlueprintsUtilities.ExtendedBlueprintsUtilitiesBPLibrary.GetDefaultComponentsByClass
// 0x0020 (0x0020 - 0x0000)
struct ExtendedBlueprintsUtilitiesBPLibrary_GetDefaultComponentsByClass final
{
public:
	const class UClass*                           ActorClass;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ComponentClass;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UActorComponent*>                OutArray;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExtendedBlueprintsUtilitiesBPLibrary_GetDefaultComponentsByClass) == 0x000008, "Wrong alignment on ExtendedBlueprintsUtilitiesBPLibrary_GetDefaultComponentsByClass");
static_assert(sizeof(ExtendedBlueprintsUtilitiesBPLibrary_GetDefaultComponentsByClass) == 0x000020, "Wrong size on ExtendedBlueprintsUtilitiesBPLibrary_GetDefaultComponentsByClass");
static_assert(offsetof(ExtendedBlueprintsUtilitiesBPLibrary_GetDefaultComponentsByClass, ActorClass) == 0x000000, "Member 'ExtendedBlueprintsUtilitiesBPLibrary_GetDefaultComponentsByClass::ActorClass' has a wrong offset!");
static_assert(offsetof(ExtendedBlueprintsUtilitiesBPLibrary_GetDefaultComponentsByClass, ComponentClass) == 0x000008, "Member 'ExtendedBlueprintsUtilitiesBPLibrary_GetDefaultComponentsByClass::ComponentClass' has a wrong offset!");
static_assert(offsetof(ExtendedBlueprintsUtilitiesBPLibrary_GetDefaultComponentsByClass, OutArray) == 0x000010, "Member 'ExtendedBlueprintsUtilitiesBPLibrary_GetDefaultComponentsByClass::OutArray' has a wrong offset!");

// Function ExtendedBlueprintsUtilities.ExtendedBlueprintsUtilitiesBPLibrary.SetAllowAnyoneToDestroyMe
// 0x0008 (0x0008 - 0x0000)
struct ExtendedBlueprintsUtilitiesBPLibrary_SetAllowAnyoneToDestroyMe final
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExtendedBlueprintsUtilitiesBPLibrary_SetAllowAnyoneToDestroyMe) == 0x000008, "Wrong alignment on ExtendedBlueprintsUtilitiesBPLibrary_SetAllowAnyoneToDestroyMe");
static_assert(sizeof(ExtendedBlueprintsUtilitiesBPLibrary_SetAllowAnyoneToDestroyMe) == 0x000008, "Wrong size on ExtendedBlueprintsUtilitiesBPLibrary_SetAllowAnyoneToDestroyMe");
static_assert(offsetof(ExtendedBlueprintsUtilitiesBPLibrary_SetAllowAnyoneToDestroyMe, Component) == 0x000000, "Member 'ExtendedBlueprintsUtilitiesBPLibrary_SetAllowAnyoneToDestroyMe::Component' has a wrong offset!");

// Function ExtendedBlueprintsUtilities.ExtendedBlueprintsUtilitiesBPLibrary.SpawnActorFromTemplate
// 0x0080 (0x0080 - 0x0000)
struct ExtendedBlueprintsUtilitiesBPLibrary_SpawnActorFromTemplate final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TemplateActor;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             SpawnTransform;                                    // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Owner;                                             // 0x0070(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExtendedBlueprintsUtilitiesBPLibrary_SpawnActorFromTemplate) == 0x000010, "Wrong alignment on ExtendedBlueprintsUtilitiesBPLibrary_SpawnActorFromTemplate");
static_assert(sizeof(ExtendedBlueprintsUtilitiesBPLibrary_SpawnActorFromTemplate) == 0x000080, "Wrong size on ExtendedBlueprintsUtilitiesBPLibrary_SpawnActorFromTemplate");
static_assert(offsetof(ExtendedBlueprintsUtilitiesBPLibrary_SpawnActorFromTemplate, WorldContextObject) == 0x000000, "Member 'ExtendedBlueprintsUtilitiesBPLibrary_SpawnActorFromTemplate::WorldContextObject' has a wrong offset!");
static_assert(offsetof(ExtendedBlueprintsUtilitiesBPLibrary_SpawnActorFromTemplate, TemplateActor) == 0x000008, "Member 'ExtendedBlueprintsUtilitiesBPLibrary_SpawnActorFromTemplate::TemplateActor' has a wrong offset!");
static_assert(offsetof(ExtendedBlueprintsUtilitiesBPLibrary_SpawnActorFromTemplate, SpawnTransform) == 0x000010, "Member 'ExtendedBlueprintsUtilitiesBPLibrary_SpawnActorFromTemplate::SpawnTransform' has a wrong offset!");
static_assert(offsetof(ExtendedBlueprintsUtilitiesBPLibrary_SpawnActorFromTemplate, Owner) == 0x000070, "Member 'ExtendedBlueprintsUtilitiesBPLibrary_SpawnActorFromTemplate::Owner' has a wrong offset!");
static_assert(offsetof(ExtendedBlueprintsUtilitiesBPLibrary_SpawnActorFromTemplate, ReturnValue) == 0x000078, "Member 'ExtendedBlueprintsUtilitiesBPLibrary_SpawnActorFromTemplate::ReturnValue' has a wrong offset!");

}

