#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpenCVHelper

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "OpenCVHelper_structs.hpp"


namespace SDK::Params
{

// Function OpenCVHelper.OpenCVBlueprintFunctionLibrary.OpenCVArucoDetectMarkers
// 0x0078 (0x0078 - 0x0000)
struct OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers final
{
public:
	const class UTextureRenderTarget2D*           InRenderTarget;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOpenCVArucoDictionary                        InDictionary;                                      // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOpenCVArucoDictionarySize                    InDictionarySize;                                  // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugDrawMarkers;                                 // 0x000A(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEstimatePose;                                     // 0x000B(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InMarkerLengthInMeters;                            // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOpenCVLensDistortionParametersBase    InLensDistortionParameters;                        // 0x0010(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UTexture2D*                             OutDebugTexture;                                   // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOpenCVArucoDetectedMarker>     OutDetectedMarkers;                                // 0x0060(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0070(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F5A[0x4];                                     // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers) == 0x000008, "Wrong alignment on OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers");
static_assert(sizeof(OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers) == 0x000078, "Wrong size on OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers");
static_assert(offsetof(OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers, InRenderTarget) == 0x000000, "Member 'OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers::InRenderTarget' has a wrong offset!");
static_assert(offsetof(OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers, InDictionary) == 0x000008, "Member 'OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers::InDictionary' has a wrong offset!");
static_assert(offsetof(OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers, InDictionarySize) == 0x000009, "Member 'OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers::InDictionarySize' has a wrong offset!");
static_assert(offsetof(OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers, bDebugDrawMarkers) == 0x00000A, "Member 'OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers::bDebugDrawMarkers' has a wrong offset!");
static_assert(offsetof(OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers, bEstimatePose) == 0x00000B, "Member 'OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers::bEstimatePose' has a wrong offset!");
static_assert(offsetof(OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers, InMarkerLengthInMeters) == 0x00000C, "Member 'OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers::InMarkerLengthInMeters' has a wrong offset!");
static_assert(offsetof(OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers, InLensDistortionParameters) == 0x000010, "Member 'OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers::InLensDistortionParameters' has a wrong offset!");
static_assert(offsetof(OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers, OutDebugTexture) == 0x000058, "Member 'OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers::OutDebugTexture' has a wrong offset!");
static_assert(offsetof(OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers, OutDetectedMarkers) == 0x000060, "Member 'OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers::OutDetectedMarkers' has a wrong offset!");
static_assert(offsetof(OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers, ReturnValue) == 0x000070, "Member 'OpenCVBlueprintFunctionLibrary_OpenCVArucoDetectMarkers::ReturnValue' has a wrong offset!");

// Function OpenCVHelper.OpenCVBlueprintFunctionLibrary.OpenCVChessboardDetectCorners
// 0x0038 (0x0038 - 0x0000)
struct OpenCVBlueprintFunctionLibrary_OpenCVChessboardDetectCorners final
{
public:
	const class UTextureRenderTarget2D*           InRenderTarget;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              InPatternSize;                                     // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugDrawCorners;                                 // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F5B[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             OutDebugTexture;                                   // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      OutDetectedCorners;                                // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F5C[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OpenCVBlueprintFunctionLibrary_OpenCVChessboardDetectCorners) == 0x000008, "Wrong alignment on OpenCVBlueprintFunctionLibrary_OpenCVChessboardDetectCorners");
static_assert(sizeof(OpenCVBlueprintFunctionLibrary_OpenCVChessboardDetectCorners) == 0x000038, "Wrong size on OpenCVBlueprintFunctionLibrary_OpenCVChessboardDetectCorners");
static_assert(offsetof(OpenCVBlueprintFunctionLibrary_OpenCVChessboardDetectCorners, InRenderTarget) == 0x000000, "Member 'OpenCVBlueprintFunctionLibrary_OpenCVChessboardDetectCorners::InRenderTarget' has a wrong offset!");
static_assert(offsetof(OpenCVBlueprintFunctionLibrary_OpenCVChessboardDetectCorners, InPatternSize) == 0x000008, "Member 'OpenCVBlueprintFunctionLibrary_OpenCVChessboardDetectCorners::InPatternSize' has a wrong offset!");
static_assert(offsetof(OpenCVBlueprintFunctionLibrary_OpenCVChessboardDetectCorners, bDebugDrawCorners) == 0x000010, "Member 'OpenCVBlueprintFunctionLibrary_OpenCVChessboardDetectCorners::bDebugDrawCorners' has a wrong offset!");
static_assert(offsetof(OpenCVBlueprintFunctionLibrary_OpenCVChessboardDetectCorners, OutDebugTexture) == 0x000018, "Member 'OpenCVBlueprintFunctionLibrary_OpenCVChessboardDetectCorners::OutDebugTexture' has a wrong offset!");
static_assert(offsetof(OpenCVBlueprintFunctionLibrary_OpenCVChessboardDetectCorners, OutDetectedCorners) == 0x000020, "Member 'OpenCVBlueprintFunctionLibrary_OpenCVChessboardDetectCorners::OutDetectedCorners' has a wrong offset!");
static_assert(offsetof(OpenCVBlueprintFunctionLibrary_OpenCVChessboardDetectCorners, ReturnValue) == 0x000030, "Member 'OpenCVBlueprintFunctionLibrary_OpenCVChessboardDetectCorners::ReturnValue' has a wrong offset!");

}

