#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PingQoS

#include "Basic.hpp"

#include "PingQoS_structs.hpp"


namespace SDK::Params
{

// Function PingQoS.PingQoSSubsystem.Init
// 0x0010 (0x0010 - 0x0000)
struct PingQoSSubsystem_Init final
{
public:
	TArray<struct FPingQoSInfo>                   SetInfo;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(PingQoSSubsystem_Init) == 0x000008, "Wrong alignment on PingQoSSubsystem_Init");
static_assert(sizeof(PingQoSSubsystem_Init) == 0x000010, "Wrong size on PingQoSSubsystem_Init");
static_assert(offsetof(PingQoSSubsystem_Init, SetInfo) == 0x000000, "Member 'PingQoSSubsystem_Init::SetInfo' has a wrong offset!");

// Function PingQoS.PingQoSSubsystem.Recv
// 0x0010 (0x0010 - 0x0000)
struct PingQoSSubsystem_Recv final
{
public:
	TArray<struct FPingQoSInfo>                   ResultInfos;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(PingQoSSubsystem_Recv) == 0x000008, "Wrong alignment on PingQoSSubsystem_Recv");
static_assert(sizeof(PingQoSSubsystem_Recv) == 0x000010, "Wrong size on PingQoSSubsystem_Recv");
static_assert(offsetof(PingQoSSubsystem_Recv, ResultInfos) == 0x000000, "Member 'PingQoSSubsystem_Recv::ResultInfos' has a wrong offset!");

// Function PingQoS.PingQoSSubsystem.Update
// 0x0001 (0x0001 - 0x0000)
struct PingQoSSubsystem_Update final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PingQoSSubsystem_Update) == 0x000001, "Wrong alignment on PingQoSSubsystem_Update");
static_assert(sizeof(PingQoSSubsystem_Update) == 0x000001, "Wrong size on PingQoSSubsystem_Update");
static_assert(offsetof(PingQoSSubsystem_Update, ReturnValue) == 0x000000, "Member 'PingQoSSubsystem_Update::ReturnValue' has a wrong offset!");

}

