#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: POLYGON

#include "Basic.hpp"

#include "NetCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "POLYGON_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PlayFab_structs.hpp"
#include "DataContainer_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "OnlineSubsystemUtils_classes.hpp"


namespace SDK
{

// Class POLYGON.AnimNotify_PlaySoundLocal
// 0x0018 (0x0050 - 0x0038)
class UAnimNotify_PlaySoundLocal final : public UAnimNotify
{
public:
	class USoundBase*                             Sound;                                             // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeMultiplier;                                  // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachName;                                        // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_PlaySoundLocal">();
	}
	static class UAnimNotify_PlaySoundLocal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_PlaySoundLocal>();
	}
};
static_assert(alignof(UAnimNotify_PlaySoundLocal) == 0x000008, "Wrong alignment on UAnimNotify_PlaySoundLocal");
static_assert(sizeof(UAnimNotify_PlaySoundLocal) == 0x000050, "Wrong size on UAnimNotify_PlaySoundLocal");
static_assert(offsetof(UAnimNotify_PlaySoundLocal, Sound) == 0x000038, "Member 'UAnimNotify_PlaySoundLocal::Sound' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlaySoundLocal, VolumeMultiplier) == 0x000040, "Member 'UAnimNotify_PlaySoundLocal::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlaySoundLocal, PitchMultiplier) == 0x000044, "Member 'UAnimNotify_PlaySoundLocal::PitchMultiplier' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlaySoundLocal, AttachName) == 0x000048, "Member 'UAnimNotify_PlaySoundLocal::AttachName' has a wrong offset!");

// Class POLYGON.PG_PlayerState_Base
// 0x0018 (0x03C0 - 0x03A8)
class APG_PlayerState_Base : public APlayerState
{
public:
	FMulticastInlineDelegateProperty_             OnPlayerNameChanged;                               // 0x03A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UClientBackendComponent*                ClientBackendComponent;                            // 0x03B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetPlayerName(const class FString& PlayerName);
	void UpdatePlayerCombinedInfo(const TArray<EModifiedData>& ModifiedData, const class FString& CustomDelegateString);

	const struct FUniqueNetIdRepl GetUniqueNetId() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PG_PlayerState_Base">();
	}
	static class APG_PlayerState_Base* GetDefaultObj()
	{
		return GetDefaultObjImpl<APG_PlayerState_Base>();
	}
};
static_assert(alignof(APG_PlayerState_Base) == 0x000008, "Wrong alignment on APG_PlayerState_Base");
static_assert(sizeof(APG_PlayerState_Base) == 0x0003C0, "Wrong size on APG_PlayerState_Base");
static_assert(offsetof(APG_PlayerState_Base, OnPlayerNameChanged) == 0x0003A8, "Member 'APG_PlayerState_Base::OnPlayerNameChanged' has a wrong offset!");
static_assert(offsetof(APG_PlayerState_Base, ClientBackendComponent) == 0x0003B8, "Member 'APG_PlayerState_Base::ClientBackendComponent' has a wrong offset!");

// Class POLYGON.BallisticMaterialResponseMap
// 0x0050 (0x0080 - 0x0030)
class UBallisticMaterialResponseMap final : public UDataAsset
{
public:
	TMap<class UPhysicalMaterial*, struct FBallisticMaterialResponseMapEntry> List;                                              // 0x0030(0x0050)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BallisticMaterialResponseMap">();
	}
	static class UBallisticMaterialResponseMap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBallisticMaterialResponseMap>();
	}
};
static_assert(alignof(UBallisticMaterialResponseMap) == 0x000008, "Wrong alignment on UBallisticMaterialResponseMap");
static_assert(sizeof(UBallisticMaterialResponseMap) == 0x000080, "Wrong size on UBallisticMaterialResponseMap");
static_assert(offsetof(UBallisticMaterialResponseMap, List) == 0x000030, "Member 'UBallisticMaterialResponseMap::List' has a wrong offset!");

// Class POLYGON.PG_PlayerState_Game
// 0x0088 (0x0448 - 0x03C0)
class APG_PlayerState_Game : public APG_PlayerState_Base
{
public:
	FMulticastInlineDelegateProperty_             OnSetTeam;                                         // 0x03C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnChangeNumberKills;                               // 0x03D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnChangeNumberDeaths;                              // 0x03E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnVoteKick;                                        // 0x03F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C03[0x8];                                     // 0x0400(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APG_PlayerState_Game*>           VoteKickPlayers;                                   // 0x0408(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	ETeam                                         Team;                                              // 0x0418(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         NumberKills;                                       // 0x0419(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         NumberDeaths;                                      // 0x041A(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         NumberKillsByMe;                                   // 0x041B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         NumberKillsOfMe;                                   // 0x041C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C04[0x7];                                     // 0x041D(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsAdmin;                                          // 0x0424(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsPatron;                                         // 0x0425(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C05[0x2];                                     // 0x0426(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerCoreComponent*                   PlayerCoreComponent;                               // 0x0428(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInventoryComponent_Game*               InventoryComponent;                                // 0x0430(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USquadComponent*                        SquadComponent;                                    // 0x0438(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChatSystemComponent*                   ChatSystemComponent;                               // 0x0440(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnRep_NumberDeaths();
	void OnRep_NumberKills();
	void OnRep_Team();
	void OnRep_VoteKickPlayers();
	void SetTeam(const ETeam NewTeam);

	bool CustomIsInactive() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PG_PlayerState_Game">();
	}
	static class APG_PlayerState_Game* GetDefaultObj()
	{
		return GetDefaultObjImpl<APG_PlayerState_Game>();
	}
};
static_assert(alignof(APG_PlayerState_Game) == 0x000008, "Wrong alignment on APG_PlayerState_Game");
static_assert(sizeof(APG_PlayerState_Game) == 0x000448, "Wrong size on APG_PlayerState_Game");
static_assert(offsetof(APG_PlayerState_Game, OnSetTeam) == 0x0003C0, "Member 'APG_PlayerState_Game::OnSetTeam' has a wrong offset!");
static_assert(offsetof(APG_PlayerState_Game, OnChangeNumberKills) == 0x0003D0, "Member 'APG_PlayerState_Game::OnChangeNumberKills' has a wrong offset!");
static_assert(offsetof(APG_PlayerState_Game, OnChangeNumberDeaths) == 0x0003E0, "Member 'APG_PlayerState_Game::OnChangeNumberDeaths' has a wrong offset!");
static_assert(offsetof(APG_PlayerState_Game, OnVoteKick) == 0x0003F0, "Member 'APG_PlayerState_Game::OnVoteKick' has a wrong offset!");
static_assert(offsetof(APG_PlayerState_Game, VoteKickPlayers) == 0x000408, "Member 'APG_PlayerState_Game::VoteKickPlayers' has a wrong offset!");
static_assert(offsetof(APG_PlayerState_Game, Team) == 0x000418, "Member 'APG_PlayerState_Game::Team' has a wrong offset!");
static_assert(offsetof(APG_PlayerState_Game, NumberKills) == 0x000419, "Member 'APG_PlayerState_Game::NumberKills' has a wrong offset!");
static_assert(offsetof(APG_PlayerState_Game, NumberDeaths) == 0x00041A, "Member 'APG_PlayerState_Game::NumberDeaths' has a wrong offset!");
static_assert(offsetof(APG_PlayerState_Game, NumberKillsByMe) == 0x00041B, "Member 'APG_PlayerState_Game::NumberKillsByMe' has a wrong offset!");
static_assert(offsetof(APG_PlayerState_Game, NumberKillsOfMe) == 0x00041C, "Member 'APG_PlayerState_Game::NumberKillsOfMe' has a wrong offset!");
static_assert(offsetof(APG_PlayerState_Game, bIsAdmin) == 0x000424, "Member 'APG_PlayerState_Game::bIsAdmin' has a wrong offset!");
static_assert(offsetof(APG_PlayerState_Game, bIsPatron) == 0x000425, "Member 'APG_PlayerState_Game::bIsPatron' has a wrong offset!");
static_assert(offsetof(APG_PlayerState_Game, PlayerCoreComponent) == 0x000428, "Member 'APG_PlayerState_Game::PlayerCoreComponent' has a wrong offset!");
static_assert(offsetof(APG_PlayerState_Game, InventoryComponent) == 0x000430, "Member 'APG_PlayerState_Game::InventoryComponent' has a wrong offset!");
static_assert(offsetof(APG_PlayerState_Game, SquadComponent) == 0x000438, "Member 'APG_PlayerState_Game::SquadComponent' has a wrong offset!");
static_assert(offsetof(APG_PlayerState_Game, ChatSystemComponent) == 0x000440, "Member 'APG_PlayerState_Game::ChatSystemComponent' has a wrong offset!");

// Class POLYGON.TraceProjectile
// 0x0210 (0x04A0 - 0x0290)
class ATraceProjectile final : public AActor
{
public:
	struct FVector                                Velocity;                                          // 0x0290(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRandomStream                          RandomStream;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          OwnerSafe;                                         // 0x02B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C06[0x67];                                    // 0x02B1(0x0067)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               ActiveTraceComponent;                              // 0x0318(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          DebugEnabled;                                      // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C07[0x3];                                     // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DebugTrailTime;                                    // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DebugTrailWidth;                                   // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           DebugTrailColorFast;                               // 0x032C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           DebugTrailColorSlow;                               // 0x033C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          DebugPooling;                                      // 0x034C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C08[0x3];                                     // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Wind;                                              // 0x0350(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EAtmosphereType                               AtmosphereType;                                    // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C09[0x3];                                     // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SeaLevelAirDensity;                                // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SeaLevelSpeedOfSound;                              // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C0A[0x4];                                     // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            AirDensityCurve;                                   // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          SpeedOfSoundVariesWithAltitude;                    // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C0B[0x7];                                     // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            SpeedOfSoundCurve;                                 // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C0C[0x4];                                     // 0x0390(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SeaLevelAirPressure;                               // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SeaLevelAirTemperature;                            // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TemperatureLapseRate;                              // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TropopauseAltitude;                                // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SpecificGasConstant;                               // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                WorldCenterLocation;                               // 0x03A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          SphericalAltitude;                                 // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C0D[0x3];                                     // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SeaLevelRadius;                                    // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          OverrideGravity;                                   // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C0E[0x7];                                     // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Gravity;                                           // 0x03D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          SafeLaunch;                                        // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          SafeLaunchIgnoreAttachParent;                      // 0x03E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          SafeLaunchIgnoreAllAttached;                       // 0x03EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C0F[0x1];                                     // 0x03EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SafeDelay;                                         // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         SafeLaunchIgnoredActors;                           // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPrivate)
	float                                         MuzzleVelocityMin;                                 // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MuzzleVelocityMax;                                 // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Spread;                                            // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Mass;                                              // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Diameter;                                          // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         FormFactor;                                        // 0x0414(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            MachDragCurve;                                     // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         GrazingAngleExponent;                              // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinPenetration;                                    // 0x0424(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxPenetration;                                    // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         PenetrationNormalization;                          // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         PenetrationNormalizationGrazing;                   // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         PenetrationEntryAngleSpread;                       // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         PenetrationExitAngleSpread;                        // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RicochetProbability;                               // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RicochetProbabilityGrazing;                        // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RicochetRestitution;                               // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RicochetFriction;                                  // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RicochetSpread;                                    // 0x044C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          SpeedControlsRicochetProbability;                  // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          AddImpulse;                                        // 0x0451(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C10[0x2];                                     // 0x0452(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ImpulseMultiplier;                                 // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EPenetrationTraceType                         DefaultPenTraceType;                               // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C11[0x7];                                     // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBallisticMaterialResponseMap*          MaterialResponseMap;                               // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          MaterialDensityControlsPenetrationDepth;           // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          MaterialRestitutionControlsRicochet;               // 0x0469(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          AllowComponentCollisions;                          // 0x046A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECollisionChannel                             TraceChannel;                                      // 0x046B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          TraceComplex;                                      // 0x046C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C12[0x3];                                     // 0x046D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CollisionMargin;                                   // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DespawnVelocity;                                   // 0x0474(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         IgnoredActors;                                     // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          DoFirstStepImmediately;                            // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          RandomFirstStepDelta;                              // 0x0489(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C13[0x2];                                     // 0x048A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxTracesPerStep;                                  // 0x048C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          Retrace;                                           // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          RetraceOnAnotherChannel;                           // 0x0491(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECollisionChannel                             RetraceChannel;                                    // 0x0492(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          RotateActor;                                       // 0x0493(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          RotateRandomRoll;                                  // 0x0494(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          EnablePooling;                                     // 0x0495(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C14[0x2];                                     // 0x0496(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        TraceFX;                                           // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static void Spawn(TSubclassOf<class ATraceProjectile> bulletClass, class AItem_Gun_General* Gun, const struct FVector& SpawnLocation, const struct FVector& StartVelocity, const uint8 RandomSeed);
	static void SpawnWithExactVelocity(TSubclassOf<class ATraceProjectile> bulletClass, class AItem_Gun_General* Gun, const struct FVector& SpawnLocation, const struct FVector& StartVelocity, const uint8 RandomSeed);

	void Deactivate();
	void OnDeactivated();
	void OnImpact(bool Ricochet, bool PassedThrough, const struct FVector& ExitVelocity, const struct FVector& Impulse, float PenetrationDepth, const struct FHitResult& HitResult);
	void OnTrace(const struct FVector& StartLocation, const struct FVector& EndLocation);
	void OnTrajectoryUpdateReceived(const struct FVector& Location, const struct FVector& OldVelocity, const struct FVector& NewVelocity);

	bool CollisionFilter(const struct FHitResult& HitResult) const;
	struct FVector UpdateVelocity(const struct FVector& Location, const struct FVector& PreviousVelocity, const float DeltaTime) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TraceProjectile">();
	}
	static class ATraceProjectile* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATraceProjectile>();
	}
};
static_assert(alignof(ATraceProjectile) == 0x000008, "Wrong alignment on ATraceProjectile");
static_assert(sizeof(ATraceProjectile) == 0x0004A0, "Wrong size on ATraceProjectile");
static_assert(offsetof(ATraceProjectile, Velocity) == 0x000290, "Member 'ATraceProjectile::Velocity' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, RandomStream) == 0x0002A8, "Member 'ATraceProjectile::RandomStream' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, OwnerSafe) == 0x0002B0, "Member 'ATraceProjectile::OwnerSafe' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, ActiveTraceComponent) == 0x000318, "Member 'ATraceProjectile::ActiveTraceComponent' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, DebugEnabled) == 0x000320, "Member 'ATraceProjectile::DebugEnabled' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, DebugTrailTime) == 0x000324, "Member 'ATraceProjectile::DebugTrailTime' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, DebugTrailWidth) == 0x000328, "Member 'ATraceProjectile::DebugTrailWidth' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, DebugTrailColorFast) == 0x00032C, "Member 'ATraceProjectile::DebugTrailColorFast' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, DebugTrailColorSlow) == 0x00033C, "Member 'ATraceProjectile::DebugTrailColorSlow' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, DebugPooling) == 0x00034C, "Member 'ATraceProjectile::DebugPooling' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, Wind) == 0x000350, "Member 'ATraceProjectile::Wind' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, AtmosphereType) == 0x000368, "Member 'ATraceProjectile::AtmosphereType' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, SeaLevelAirDensity) == 0x00036C, "Member 'ATraceProjectile::SeaLevelAirDensity' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, SeaLevelSpeedOfSound) == 0x000370, "Member 'ATraceProjectile::SeaLevelSpeedOfSound' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, AirDensityCurve) == 0x000378, "Member 'ATraceProjectile::AirDensityCurve' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, SpeedOfSoundVariesWithAltitude) == 0x000380, "Member 'ATraceProjectile::SpeedOfSoundVariesWithAltitude' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, SpeedOfSoundCurve) == 0x000388, "Member 'ATraceProjectile::SpeedOfSoundCurve' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, SeaLevelAirPressure) == 0x000394, "Member 'ATraceProjectile::SeaLevelAirPressure' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, SeaLevelAirTemperature) == 0x000398, "Member 'ATraceProjectile::SeaLevelAirTemperature' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, TemperatureLapseRate) == 0x00039C, "Member 'ATraceProjectile::TemperatureLapseRate' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, TropopauseAltitude) == 0x0003A0, "Member 'ATraceProjectile::TropopauseAltitude' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, SpecificGasConstant) == 0x0003A4, "Member 'ATraceProjectile::SpecificGasConstant' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, WorldCenterLocation) == 0x0003A8, "Member 'ATraceProjectile::WorldCenterLocation' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, SphericalAltitude) == 0x0003C0, "Member 'ATraceProjectile::SphericalAltitude' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, SeaLevelRadius) == 0x0003C4, "Member 'ATraceProjectile::SeaLevelRadius' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, OverrideGravity) == 0x0003C8, "Member 'ATraceProjectile::OverrideGravity' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, Gravity) == 0x0003D0, "Member 'ATraceProjectile::Gravity' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, SafeLaunch) == 0x0003E8, "Member 'ATraceProjectile::SafeLaunch' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, SafeLaunchIgnoreAttachParent) == 0x0003E9, "Member 'ATraceProjectile::SafeLaunchIgnoreAttachParent' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, SafeLaunchIgnoreAllAttached) == 0x0003EA, "Member 'ATraceProjectile::SafeLaunchIgnoreAllAttached' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, SafeDelay) == 0x0003EC, "Member 'ATraceProjectile::SafeDelay' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, SafeLaunchIgnoredActors) == 0x0003F0, "Member 'ATraceProjectile::SafeLaunchIgnoredActors' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, MuzzleVelocityMin) == 0x000400, "Member 'ATraceProjectile::MuzzleVelocityMin' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, MuzzleVelocityMax) == 0x000404, "Member 'ATraceProjectile::MuzzleVelocityMax' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, Spread) == 0x000408, "Member 'ATraceProjectile::Spread' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, Mass) == 0x00040C, "Member 'ATraceProjectile::Mass' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, Diameter) == 0x000410, "Member 'ATraceProjectile::Diameter' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, FormFactor) == 0x000414, "Member 'ATraceProjectile::FormFactor' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, MachDragCurve) == 0x000418, "Member 'ATraceProjectile::MachDragCurve' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, GrazingAngleExponent) == 0x000420, "Member 'ATraceProjectile::GrazingAngleExponent' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, MinPenetration) == 0x000424, "Member 'ATraceProjectile::MinPenetration' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, MaxPenetration) == 0x000428, "Member 'ATraceProjectile::MaxPenetration' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, PenetrationNormalization) == 0x00042C, "Member 'ATraceProjectile::PenetrationNormalization' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, PenetrationNormalizationGrazing) == 0x000430, "Member 'ATraceProjectile::PenetrationNormalizationGrazing' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, PenetrationEntryAngleSpread) == 0x000434, "Member 'ATraceProjectile::PenetrationEntryAngleSpread' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, PenetrationExitAngleSpread) == 0x000438, "Member 'ATraceProjectile::PenetrationExitAngleSpread' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, RicochetProbability) == 0x00043C, "Member 'ATraceProjectile::RicochetProbability' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, RicochetProbabilityGrazing) == 0x000440, "Member 'ATraceProjectile::RicochetProbabilityGrazing' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, RicochetRestitution) == 0x000444, "Member 'ATraceProjectile::RicochetRestitution' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, RicochetFriction) == 0x000448, "Member 'ATraceProjectile::RicochetFriction' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, RicochetSpread) == 0x00044C, "Member 'ATraceProjectile::RicochetSpread' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, SpeedControlsRicochetProbability) == 0x000450, "Member 'ATraceProjectile::SpeedControlsRicochetProbability' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, AddImpulse) == 0x000451, "Member 'ATraceProjectile::AddImpulse' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, ImpulseMultiplier) == 0x000454, "Member 'ATraceProjectile::ImpulseMultiplier' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, DefaultPenTraceType) == 0x000458, "Member 'ATraceProjectile::DefaultPenTraceType' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, MaterialResponseMap) == 0x000460, "Member 'ATraceProjectile::MaterialResponseMap' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, MaterialDensityControlsPenetrationDepth) == 0x000468, "Member 'ATraceProjectile::MaterialDensityControlsPenetrationDepth' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, MaterialRestitutionControlsRicochet) == 0x000469, "Member 'ATraceProjectile::MaterialRestitutionControlsRicochet' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, AllowComponentCollisions) == 0x00046A, "Member 'ATraceProjectile::AllowComponentCollisions' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, TraceChannel) == 0x00046B, "Member 'ATraceProjectile::TraceChannel' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, TraceComplex) == 0x00046C, "Member 'ATraceProjectile::TraceComplex' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, CollisionMargin) == 0x000470, "Member 'ATraceProjectile::CollisionMargin' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, DespawnVelocity) == 0x000474, "Member 'ATraceProjectile::DespawnVelocity' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, IgnoredActors) == 0x000478, "Member 'ATraceProjectile::IgnoredActors' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, DoFirstStepImmediately) == 0x000488, "Member 'ATraceProjectile::DoFirstStepImmediately' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, RandomFirstStepDelta) == 0x000489, "Member 'ATraceProjectile::RandomFirstStepDelta' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, MaxTracesPerStep) == 0x00048C, "Member 'ATraceProjectile::MaxTracesPerStep' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, Retrace) == 0x000490, "Member 'ATraceProjectile::Retrace' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, RetraceOnAnotherChannel) == 0x000491, "Member 'ATraceProjectile::RetraceOnAnotherChannel' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, RetraceChannel) == 0x000492, "Member 'ATraceProjectile::RetraceChannel' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, RotateActor) == 0x000493, "Member 'ATraceProjectile::RotateActor' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, RotateRandomRoll) == 0x000494, "Member 'ATraceProjectile::RotateRandomRoll' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, EnablePooling) == 0x000495, "Member 'ATraceProjectile::EnablePooling' has a wrong offset!");
static_assert(offsetof(ATraceProjectile, TraceFX) == 0x000498, "Member 'ATraceProjectile::TraceFX' has a wrong offset!");

// Class POLYGON.PG_PlayerState_Menu
// 0x0008 (0x03C8 - 0x03C0)
class APG_PlayerState_Menu : public APG_PlayerState_Base
{
public:
	class UInventoryComponent_Menu*               InventoryComponent;                                // 0x03C0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PG_PlayerState_Menu">();
	}
	static class APG_PlayerState_Menu* GetDefaultObj()
	{
		return GetDefaultObjImpl<APG_PlayerState_Menu>();
	}
};
static_assert(alignof(APG_PlayerState_Menu) == 0x000008, "Wrong alignment on APG_PlayerState_Menu");
static_assert(sizeof(APG_PlayerState_Menu) == 0x0003C8, "Wrong size on APG_PlayerState_Menu");
static_assert(offsetof(APG_PlayerState_Menu, InventoryComponent) == 0x0003C0, "Member 'APG_PlayerState_Menu::InventoryComponent' has a wrong offset!");

// Class POLYGON.Bullet_Casing_General
// 0x0018 (0x02A8 - 0x0290)
class ABullet_Casing_General final : public AActor
{
public:
	class USoundBase*                             SoundDrop;                                         // 0x0290(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UProjectileMovementComponent*           ProjectileMovementComponent;                       // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Bullet_Casing_General">();
	}
	static class ABullet_Casing_General* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABullet_Casing_General>();
	}
};
static_assert(alignof(ABullet_Casing_General) == 0x000008, "Wrong alignment on ABullet_Casing_General");
static_assert(sizeof(ABullet_Casing_General) == 0x0002A8, "Wrong size on ABullet_Casing_General");
static_assert(offsetof(ABullet_Casing_General, SoundDrop) == 0x000290, "Member 'ABullet_Casing_General::SoundDrop' has a wrong offset!");
static_assert(offsetof(ABullet_Casing_General, Mesh) == 0x000298, "Member 'ABullet_Casing_General::Mesh' has a wrong offset!");
static_assert(offsetof(ABullet_Casing_General, ProjectileMovementComponent) == 0x0002A0, "Member 'ABullet_Casing_General::ProjectileMovementComponent' has a wrong offset!");

// Class POLYGON.PlayerCoreComponent
// 0x00F8 (0x0198 - 0x00A0)
class UPlayerCoreComponent final : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_             OnTotalProgress;                                   // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnNewLevelReceived;                                // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnAddedGameScore;                                  // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnNotifyPossibilityUnlockModule;                   // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C1B[0x8];                                     // 0x00E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InitialTotalProgress;                              // 0x00E8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         TotalProgress;                                     // 0x00EC(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasVipStatus;                                     // 0x00F0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C1C[0xA7];                                    // 0x00F1(0x00A7)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static struct FLevelInfo GetLevelByProgress(const int32 Progress);
	static struct FLevelInfo GetNextLevelByLevelID(const class FName LevelID);

	void AddCredits(int32 Param_AddCredits);
	void NotifyAddedGameScore_client(const TArray<struct FScoreInfo>& ScoreInfos);
	void OnRep_TotalProgress();
	void Reset();
	void UpdatePlayerCombinedInfo(const TArray<EModifiedData>& ModifiedData, const class FString& CustomDelegateString);

	struct FLevelInfo GetCurrentLevelInfo() const;
	struct FLevelInfo GetNextLevelInfo() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerCoreComponent">();
	}
	static class UPlayerCoreComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerCoreComponent>();
	}
};
static_assert(alignof(UPlayerCoreComponent) == 0x000008, "Wrong alignment on UPlayerCoreComponent");
static_assert(sizeof(UPlayerCoreComponent) == 0x000198, "Wrong size on UPlayerCoreComponent");
static_assert(offsetof(UPlayerCoreComponent, OnTotalProgress) == 0x0000A0, "Member 'UPlayerCoreComponent::OnTotalProgress' has a wrong offset!");
static_assert(offsetof(UPlayerCoreComponent, OnNewLevelReceived) == 0x0000B0, "Member 'UPlayerCoreComponent::OnNewLevelReceived' has a wrong offset!");
static_assert(offsetof(UPlayerCoreComponent, OnAddedGameScore) == 0x0000C0, "Member 'UPlayerCoreComponent::OnAddedGameScore' has a wrong offset!");
static_assert(offsetof(UPlayerCoreComponent, OnNotifyPossibilityUnlockModule) == 0x0000D0, "Member 'UPlayerCoreComponent::OnNotifyPossibilityUnlockModule' has a wrong offset!");
static_assert(offsetof(UPlayerCoreComponent, InitialTotalProgress) == 0x0000E8, "Member 'UPlayerCoreComponent::InitialTotalProgress' has a wrong offset!");
static_assert(offsetof(UPlayerCoreComponent, TotalProgress) == 0x0000EC, "Member 'UPlayerCoreComponent::TotalProgress' has a wrong offset!");
static_assert(offsetof(UPlayerCoreComponent, bHasVipStatus) == 0x0000F0, "Member 'UPlayerCoreComponent::bHasVipStatus' has a wrong offset!");

// Class POLYGON.ChatSystemComponent
// 0x0010 (0x00B0 - 0x00A0)
class UChatSystemComponent final : public UActorComponent
{
public:
	TArray<struct FGameChatMessage>               ChatHistory;                                       // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void SendMessage_Server(const struct FGameChatMessage& Message);
	void SentMessage_Multicast(const struct FGameChatMessage& Message);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatSystemComponent">();
	}
	static class UChatSystemComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatSystemComponent>();
	}
};
static_assert(alignof(UChatSystemComponent) == 0x000008, "Wrong alignment on UChatSystemComponent");
static_assert(sizeof(UChatSystemComponent) == 0x0000B0, "Wrong size on UChatSystemComponent");
static_assert(offsetof(UChatSystemComponent, ChatHistory) == 0x0000A0, "Member 'UChatSystemComponent::ChatHistory' has a wrong offset!");

// Class POLYGON.ReservedSlot
// 0x0050 (0x0078 - 0x0028)
class UReservedSlot final : public UObject
{
public:
	uint8                                         Pad_2C1E[0x50];                                    // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReservedSlot">();
	}
	static class UReservedSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReservedSlot>();
	}
};
static_assert(alignof(UReservedSlot) == 0x000008, "Wrong alignment on UReservedSlot");
static_assert(sizeof(UReservedSlot) == 0x000078, "Wrong size on UReservedSlot");

// Class POLYGON.GeneralBackendComponent
// 0x0040 (0x00E0 - 0x00A0)
class UGeneralBackendComponent : public UActorComponent
{
public:
	uint8                                         Pad_2C1F[0x40];                                    // 0x00A0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GeneralBackendComponent">();
	}
	static class UGeneralBackendComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeneralBackendComponent>();
	}
};
static_assert(alignof(UGeneralBackendComponent) == 0x000008, "Wrong alignment on UGeneralBackendComponent");
static_assert(sizeof(UGeneralBackendComponent) == 0x0000E0, "Wrong size on UGeneralBackendComponent");

// Class POLYGON.ServerBackendComponent
// 0x0000 (0x00E0 - 0x00E0)
class UServerBackendComponent final : public UGeneralBackendComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ServerBackendComponent">();
	}
	static class UServerBackendComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UServerBackendComponent>();
	}
};
static_assert(alignof(UServerBackendComponent) == 0x000008, "Wrong alignment on UServerBackendComponent");
static_assert(sizeof(UServerBackendComponent) == 0x0000E0, "Wrong size on UServerBackendComponent");

// Class POLYGON.ClientBackendComponent
// 0x0040 (0x0120 - 0x00E0)
class UClientBackendComponent final : public UGeneralBackendComponent
{
public:
	FMulticastInlineDelegateProperty_             OnSetPlayerId;                                     // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnUpdatePlayerCombinedInfo;                        // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class FString                                 PlayerMasterId;                                    // 0x0100(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayFabJsonObject*                     PlayerCombinedInfo;                                // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayFabJsonObject*                     PlayerExperiments;                                 // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static bool IsClientLoggedIn();

	void GiveVipLocal(const class FString& ID);
	void SerPlayerExperiments(class UPlayFabJsonObject* Experiments);
	void SetPlayerCombinedInfo(class UPlayFabJsonObject* NewPlayerCombinedInfo, const TArray<EModifiedData>& ModifiedData, const class FString& CustomDelegateString);
	void SetPlayerId(const class FString& NewPlayerMasterId);

	class UPlayFabJsonObject* GetPlayerCombinedInfo() const;
	class UPlayFabJsonObject* GetPlayerExperiments() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClientBackendComponent">();
	}
	static class UClientBackendComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClientBackendComponent>();
	}
};
static_assert(alignof(UClientBackendComponent) == 0x000008, "Wrong alignment on UClientBackendComponent");
static_assert(sizeof(UClientBackendComponent) == 0x000120, "Wrong size on UClientBackendComponent");
static_assert(offsetof(UClientBackendComponent, OnSetPlayerId) == 0x0000E0, "Member 'UClientBackendComponent::OnSetPlayerId' has a wrong offset!");
static_assert(offsetof(UClientBackendComponent, OnUpdatePlayerCombinedInfo) == 0x0000F0, "Member 'UClientBackendComponent::OnUpdatePlayerCombinedInfo' has a wrong offset!");
static_assert(offsetof(UClientBackendComponent, PlayerMasterId) == 0x000100, "Member 'UClientBackendComponent::PlayerMasterId' has a wrong offset!");
static_assert(offsetof(UClientBackendComponent, PlayerCombinedInfo) == 0x000110, "Member 'UClientBackendComponent::PlayerCombinedInfo' has a wrong offset!");
static_assert(offsetof(UClientBackendComponent, PlayerExperiments) == 0x000118, "Member 'UClientBackendComponent::PlayerExperiments' has a wrong offset!");

// Class POLYGON.ServerGameInstance
// 0x0010 (0x0038 - 0x0028)
class UServerGameInstance final : public UObject
{
public:
	uint8                                         Pad_2C20[0x10];                                    // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool OnGSDKHealthCheck();
	void OnGSDKReadyForPlayers();
	void OnGSDKServerActive();
	void OnGSDKShutdown();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ServerGameInstance">();
	}
	static class UServerGameInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UServerGameInstance>();
	}
};
static_assert(alignof(UServerGameInstance) == 0x000008, "Wrong alignment on UServerGameInstance");
static_assert(sizeof(UServerGameInstance) == 0x000038, "Wrong size on UServerGameInstance");

// Class POLYGON.ClientGameInstance
// 0x0060 (0x0088 - 0x0028)
class UClientGameInstance final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnSetMasterId;                                     // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FText                                   KickReason;                                        // 0x0038(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C21[0x10];                                    // 0x0050(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     PlayerCombinedInfo;                                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UUserEntry*>                     UsersCache;                                        // 0x0068(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C22[0x10];                                    // 0x0078(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleNetworkFailure(class UWorld* World, class UNetDriver* NetDriver, ENetworkFailure FailureType, const class FString& ErrorString);
	void SetPlayerCombinedInfo(class UPlayFabJsonObject* NewPlayerCombinedInfo);
	void SetPlayerId(const class FString& NewPlayerMasterId);
	void SetServerTime(const struct FDateTime& ServerTime);

	class UPlayFabJsonObject* GetPlayerCombinedInfo() const;
