#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: POLYGON

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "NetCore_structs.hpp"
#include "Engine_structs.hpp"
#include "POLYGON_structs.hpp"
#include "PlayFab_structs.hpp"


namespace SDK::Params
{

// Function POLYGON.PG_PlayerState_Base.SetPlayerName
// 0x0010 (0x0010 - 0x0000)
struct PG_PlayerState_Base_SetPlayerName final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PG_PlayerState_Base_SetPlayerName) == 0x000008, "Wrong alignment on PG_PlayerState_Base_SetPlayerName");
static_assert(sizeof(PG_PlayerState_Base_SetPlayerName) == 0x000010, "Wrong size on PG_PlayerState_Base_SetPlayerName");
static_assert(offsetof(PG_PlayerState_Base_SetPlayerName, PlayerName) == 0x000000, "Member 'PG_PlayerState_Base_SetPlayerName::PlayerName' has a wrong offset!");

// Function POLYGON.PG_PlayerState_Base.UpdatePlayerCombinedInfo
// 0x0020 (0x0020 - 0x0000)
struct PG_PlayerState_Base_UpdatePlayerCombinedInfo final
{
public:
	TArray<EModifiedData>                         ModifiedData;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 CustomDelegateString;                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PG_PlayerState_Base_UpdatePlayerCombinedInfo) == 0x000008, "Wrong alignment on PG_PlayerState_Base_UpdatePlayerCombinedInfo");
static_assert(sizeof(PG_PlayerState_Base_UpdatePlayerCombinedInfo) == 0x000020, "Wrong size on PG_PlayerState_Base_UpdatePlayerCombinedInfo");
static_assert(offsetof(PG_PlayerState_Base_UpdatePlayerCombinedInfo, ModifiedData) == 0x000000, "Member 'PG_PlayerState_Base_UpdatePlayerCombinedInfo::ModifiedData' has a wrong offset!");
static_assert(offsetof(PG_PlayerState_Base_UpdatePlayerCombinedInfo, CustomDelegateString) == 0x000010, "Member 'PG_PlayerState_Base_UpdatePlayerCombinedInfo::CustomDelegateString' has a wrong offset!");

// Function POLYGON.PG_PlayerState_Base.GetUniqueNetId
// 0x0030 (0x0030 - 0x0000)
struct PG_PlayerState_Base_GetUniqueNetId final
{
public:
	struct FUniqueNetIdRepl                       ReturnValue;                                       // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PG_PlayerState_Base_GetUniqueNetId) == 0x000008, "Wrong alignment on PG_PlayerState_Base_GetUniqueNetId");
static_assert(sizeof(PG_PlayerState_Base_GetUniqueNetId) == 0x000030, "Wrong size on PG_PlayerState_Base_GetUniqueNetId");
static_assert(offsetof(PG_PlayerState_Base_GetUniqueNetId, ReturnValue) == 0x000000, "Member 'PG_PlayerState_Base_GetUniqueNetId::ReturnValue' has a wrong offset!");

// Function POLYGON.PG_PlayerState_Game.SetTeam
// 0x0001 (0x0001 - 0x0000)
struct PG_PlayerState_Game_SetTeam final
{
public:
	ETeam                                         NewTeam;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PG_PlayerState_Game_SetTeam) == 0x000001, "Wrong alignment on PG_PlayerState_Game_SetTeam");
static_assert(sizeof(PG_PlayerState_Game_SetTeam) == 0x000001, "Wrong size on PG_PlayerState_Game_SetTeam");
static_assert(offsetof(PG_PlayerState_Game_SetTeam, NewTeam) == 0x000000, "Member 'PG_PlayerState_Game_SetTeam::NewTeam' has a wrong offset!");

// Function POLYGON.PG_PlayerState_Game.CustomIsInactive
// 0x0001 (0x0001 - 0x0000)
struct PG_PlayerState_Game_CustomIsInactive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PG_PlayerState_Game_CustomIsInactive) == 0x000001, "Wrong alignment on PG_PlayerState_Game_CustomIsInactive");
static_assert(sizeof(PG_PlayerState_Game_CustomIsInactive) == 0x000001, "Wrong size on PG_PlayerState_Game_CustomIsInactive");
static_assert(offsetof(PG_PlayerState_Game_CustomIsInactive, ReturnValue) == 0x000000, "Member 'PG_PlayerState_Game_CustomIsInactive::ReturnValue' has a wrong offset!");

// Function POLYGON.TraceProjectile.Spawn
// 0x0048 (0x0048 - 0x0000)
struct TraceProjectile_Spawn final
{
public:
	TSubclassOf<class ATraceProjectile>           bulletClass;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AItem_Gun_General*                      Gun;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SpawnLocation;                                     // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StartVelocity;                                     // 0x0028(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         RandomSeed;                                        // 0x0040(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C15[0x7];                                     // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TraceProjectile_Spawn) == 0x000008, "Wrong alignment on TraceProjectile_Spawn");
static_assert(sizeof(TraceProjectile_Spawn) == 0x000048, "Wrong size on TraceProjectile_Spawn");
static_assert(offsetof(TraceProjectile_Spawn, bulletClass) == 0x000000, "Member 'TraceProjectile_Spawn::bulletClass' has a wrong offset!");
static_assert(offsetof(TraceProjectile_Spawn, Gun) == 0x000008, "Member 'TraceProjectile_Spawn::Gun' has a wrong offset!");
static_assert(offsetof(TraceProjectile_Spawn, SpawnLocation) == 0x000010, "Member 'TraceProjectile_Spawn::SpawnLocation' has a wrong offset!");
static_assert(offsetof(TraceProjectile_Spawn, StartVelocity) == 0x000028, "Member 'TraceProjectile_Spawn::StartVelocity' has a wrong offset!");
static_assert(offsetof(TraceProjectile_Spawn, RandomSeed) == 0x000040, "Member 'TraceProjectile_Spawn::RandomSeed' has a wrong offset!");

// Function POLYGON.TraceProjectile.SpawnWithExactVelocity
// 0x0048 (0x0048 - 0x0000)
struct TraceProjectile_SpawnWithExactVelocity final
{
public:
	TSubclassOf<class ATraceProjectile>           bulletClass;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AItem_Gun_General*                      Gun;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SpawnLocation;                                     // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StartVelocity;                                     // 0x0028(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         RandomSeed;                                        // 0x0040(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C16[0x7];                                     // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TraceProjectile_SpawnWithExactVelocity) == 0x000008, "Wrong alignment on TraceProjectile_SpawnWithExactVelocity");
static_assert(sizeof(TraceProjectile_SpawnWithExactVelocity) == 0x000048, "Wrong size on TraceProjectile_SpawnWithExactVelocity");
static_assert(offsetof(TraceProjectile_SpawnWithExactVelocity, bulletClass) == 0x000000, "Member 'TraceProjectile_SpawnWithExactVelocity::bulletClass' has a wrong offset!");
static_assert(offsetof(TraceProjectile_SpawnWithExactVelocity, Gun) == 0x000008, "Member 'TraceProjectile_SpawnWithExactVelocity::Gun' has a wrong offset!");
static_assert(offsetof(TraceProjectile_SpawnWithExactVelocity, SpawnLocation) == 0x000010, "Member 'TraceProjectile_SpawnWithExactVelocity::SpawnLocation' has a wrong offset!");
static_assert(offsetof(TraceProjectile_SpawnWithExactVelocity, StartVelocity) == 0x000028, "Member 'TraceProjectile_SpawnWithExactVelocity::StartVelocity' has a wrong offset!");
static_assert(offsetof(TraceProjectile_SpawnWithExactVelocity, RandomSeed) == 0x000040, "Member 'TraceProjectile_SpawnWithExactVelocity::RandomSeed' has a wrong offset!");

// Function POLYGON.TraceProjectile.OnImpact
// 0x0128 (0x0128 - 0x0000)
struct TraceProjectile_OnImpact final
{
public:
	bool                                          Ricochet;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PassedThrough;                                     // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C17[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ExitVelocity;                                      // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Impulse;                                           // 0x0020(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PenetrationDepth;                                  // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C18[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             HitResult;                                         // 0x0040(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(TraceProjectile_OnImpact) == 0x000008, "Wrong alignment on TraceProjectile_OnImpact");
static_assert(sizeof(TraceProjectile_OnImpact) == 0x000128, "Wrong size on TraceProjectile_OnImpact");
static_assert(offsetof(TraceProjectile_OnImpact, Ricochet) == 0x000000, "Member 'TraceProjectile_OnImpact::Ricochet' has a wrong offset!");
static_assert(offsetof(TraceProjectile_OnImpact, PassedThrough) == 0x000001, "Member 'TraceProjectile_OnImpact::PassedThrough' has a wrong offset!");
static_assert(offsetof(TraceProjectile_OnImpact, ExitVelocity) == 0x000008, "Member 'TraceProjectile_OnImpact::ExitVelocity' has a wrong offset!");
static_assert(offsetof(TraceProjectile_OnImpact, Impulse) == 0x000020, "Member 'TraceProjectile_OnImpact::Impulse' has a wrong offset!");
static_assert(offsetof(TraceProjectile_OnImpact, PenetrationDepth) == 0x000038, "Member 'TraceProjectile_OnImpact::PenetrationDepth' has a wrong offset!");
static_assert(offsetof(TraceProjectile_OnImpact, HitResult) == 0x000040, "Member 'TraceProjectile_OnImpact::HitResult' has a wrong offset!");

// Function POLYGON.TraceProjectile.OnTrace
// 0x0030 (0x0030 - 0x0000)
struct TraceProjectile_OnTrace final
{
public:
	struct FVector                                StartLocation;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndLocation;                                       // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TraceProjectile_OnTrace) == 0x000008, "Wrong alignment on TraceProjectile_OnTrace");
static_assert(sizeof(TraceProjectile_OnTrace) == 0x000030, "Wrong size on TraceProjectile_OnTrace");
static_assert(offsetof(TraceProjectile_OnTrace, StartLocation) == 0x000000, "Member 'TraceProjectile_OnTrace::StartLocation' has a wrong offset!");
static_assert(offsetof(TraceProjectile_OnTrace, EndLocation) == 0x000018, "Member 'TraceProjectile_OnTrace::EndLocation' has a wrong offset!");

// Function POLYGON.TraceProjectile.OnTrajectoryUpdateReceived
// 0x0048 (0x0048 - 0x0000)
struct TraceProjectile_OnTrajectoryUpdateReceived final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OldVelocity;                                       // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NewVelocity;                                       // 0x0030(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TraceProjectile_OnTrajectoryUpdateReceived) == 0x000008, "Wrong alignment on TraceProjectile_OnTrajectoryUpdateReceived");
static_assert(sizeof(TraceProjectile_OnTrajectoryUpdateReceived) == 0x000048, "Wrong size on TraceProjectile_OnTrajectoryUpdateReceived");
static_assert(offsetof(TraceProjectile_OnTrajectoryUpdateReceived, Location) == 0x000000, "Member 'TraceProjectile_OnTrajectoryUpdateReceived::Location' has a wrong offset!");
static_assert(offsetof(TraceProjectile_OnTrajectoryUpdateReceived, OldVelocity) == 0x000018, "Member 'TraceProjectile_OnTrajectoryUpdateReceived::OldVelocity' has a wrong offset!");
static_assert(offsetof(TraceProjectile_OnTrajectoryUpdateReceived, NewVelocity) == 0x000030, "Member 'TraceProjectile_OnTrajectoryUpdateReceived::NewVelocity' has a wrong offset!");

// Function POLYGON.TraceProjectile.CollisionFilter
// 0x00F0 (0x00F0 - 0x0000)
struct TraceProjectile_CollisionFilter final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C19[0x7];                                     // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TraceProjectile_CollisionFilter) == 0x000008, "Wrong alignment on TraceProjectile_CollisionFilter");
static_assert(sizeof(TraceProjectile_CollisionFilter) == 0x0000F0, "Wrong size on TraceProjectile_CollisionFilter");
static_assert(offsetof(TraceProjectile_CollisionFilter, HitResult) == 0x000000, "Member 'TraceProjectile_CollisionFilter::HitResult' has a wrong offset!");
static_assert(offsetof(TraceProjectile_CollisionFilter, ReturnValue) == 0x0000E8, "Member 'TraceProjectile_CollisionFilter::ReturnValue' has a wrong offset!");

// Function POLYGON.TraceProjectile.UpdateVelocity
// 0x0050 (0x0050 - 0x0000)
struct TraceProjectile_UpdateVelocity final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PreviousVelocity;                                  // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0030(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C1A[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TraceProjectile_UpdateVelocity) == 0x000008, "Wrong alignment on TraceProjectile_UpdateVelocity");
static_assert(sizeof(TraceProjectile_UpdateVelocity) == 0x000050, "Wrong size on TraceProjectile_UpdateVelocity");
static_assert(offsetof(TraceProjectile_UpdateVelocity, Location) == 0x000000, "Member 'TraceProjectile_UpdateVelocity::Location' has a wrong offset!");
static_assert(offsetof(TraceProjectile_UpdateVelocity, PreviousVelocity) == 0x000018, "Member 'TraceProjectile_UpdateVelocity::PreviousVelocity' has a wrong offset!");
static_assert(offsetof(TraceProjectile_UpdateVelocity, DeltaTime) == 0x000030, "Member 'TraceProjectile_UpdateVelocity::DeltaTime' has a wrong offset!");
static_assert(offsetof(TraceProjectile_UpdateVelocity, ReturnValue) == 0x000038, "Member 'TraceProjectile_UpdateVelocity::ReturnValue' has a wrong offset!");

// Function POLYGON.PlayerCoreComponent.GetLevelByProgress
// 0x0050 (0x0050 - 0x0000)
struct PlayerCoreComponent_GetLevelByProgress final
{
public:
	int32                                         Progress;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C1D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLevelInfo                             ReturnValue;                                       // 0x0008(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerCoreComponent_GetLevelByProgress) == 0x000008, "Wrong alignment on PlayerCoreComponent_GetLevelByProgress");
static_assert(sizeof(PlayerCoreComponent_GetLevelByProgress) == 0x000050, "Wrong size on PlayerCoreComponent_GetLevelByProgress");
static_assert(offsetof(PlayerCoreComponent_GetLevelByProgress, Progress) == 0x000000, "Member 'PlayerCoreComponent_GetLevelByProgress::Progress' has a wrong offset!");
static_assert(offsetof(PlayerCoreComponent_GetLevelByProgress, ReturnValue) == 0x000008, "Member 'PlayerCoreComponent_GetLevelByProgress::ReturnValue' has a wrong offset!");

// Function POLYGON.PlayerCoreComponent.GetNextLevelByLevelID
// 0x0050 (0x0050 - 0x0000)
struct PlayerCoreComponent_GetNextLevelByLevelID final
{
public:
	class FName                                   LevelID;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLevelInfo                             ReturnValue;                                       // 0x0008(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerCoreComponent_GetNextLevelByLevelID) == 0x000008, "Wrong alignment on PlayerCoreComponent_GetNextLevelByLevelID");
static_assert(sizeof(PlayerCoreComponent_GetNextLevelByLevelID) == 0x000050, "Wrong size on PlayerCoreComponent_GetNextLevelByLevelID");
static_assert(offsetof(PlayerCoreComponent_GetNextLevelByLevelID, LevelID) == 0x000000, "Member 'PlayerCoreComponent_GetNextLevelByLevelID::LevelID' has a wrong offset!");
static_assert(offsetof(PlayerCoreComponent_GetNextLevelByLevelID, ReturnValue) == 0x000008, "Member 'PlayerCoreComponent_GetNextLevelByLevelID::ReturnValue' has a wrong offset!");

// Function POLYGON.PlayerCoreComponent.AddCredits
// 0x0004 (0x0004 - 0x0000)
struct PlayerCoreComponent_AddCredits final
{
public:
	int32                                         Param_AddCredits;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerCoreComponent_AddCredits) == 0x000004, "Wrong alignment on PlayerCoreComponent_AddCredits");
static_assert(sizeof(PlayerCoreComponent_AddCredits) == 0x000004, "Wrong size on PlayerCoreComponent_AddCredits");
static_assert(offsetof(PlayerCoreComponent_AddCredits, Param_AddCredits) == 0x000000, "Member 'PlayerCoreComponent_AddCredits::Param_AddCredits' has a wrong offset!");

// Function POLYGON.PlayerCoreComponent.NotifyAddedGameScore_client
// 0x0010 (0x0010 - 0x0000)
struct PlayerCoreComponent_NotifyAddedGameScore_client final
{
public:
	TArray<struct FScoreInfo>                     ScoreInfos;                                        // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerCoreComponent_NotifyAddedGameScore_client) == 0x000008, "Wrong alignment on PlayerCoreComponent_NotifyAddedGameScore_client");
static_assert(sizeof(PlayerCoreComponent_NotifyAddedGameScore_client) == 0x000010, "Wrong size on PlayerCoreComponent_NotifyAddedGameScore_client");
static_assert(offsetof(PlayerCoreComponent_NotifyAddedGameScore_client, ScoreInfos) == 0x000000, "Member 'PlayerCoreComponent_NotifyAddedGameScore_client::ScoreInfos' has a wrong offset!");

// Function POLYGON.PlayerCoreComponent.UpdatePlayerCombinedInfo
// 0x0020 (0x0020 - 0x0000)
struct PlayerCoreComponent_UpdatePlayerCombinedInfo final
{
public:
	TArray<EModifiedData>                         ModifiedData;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 CustomDelegateString;                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerCoreComponent_UpdatePlayerCombinedInfo) == 0x000008, "Wrong alignment on PlayerCoreComponent_UpdatePlayerCombinedInfo");
static_assert(sizeof(PlayerCoreComponent_UpdatePlayerCombinedInfo) == 0x000020, "Wrong size on PlayerCoreComponent_UpdatePlayerCombinedInfo");
static_assert(offsetof(PlayerCoreComponent_UpdatePlayerCombinedInfo, ModifiedData) == 0x000000, "Member 'PlayerCoreComponent_UpdatePlayerCombinedInfo::ModifiedData' has a wrong offset!");
static_assert(offsetof(PlayerCoreComponent_UpdatePlayerCombinedInfo, CustomDelegateString) == 0x000010, "Member 'PlayerCoreComponent_UpdatePlayerCombinedInfo::CustomDelegateString' has a wrong offset!");

// Function POLYGON.PlayerCoreComponent.GetCurrentLevelInfo
// 0x0048 (0x0048 - 0x0000)
struct PlayerCoreComponent_GetCurrentLevelInfo final
{
public:
	struct FLevelInfo                             ReturnValue;                                       // 0x0000(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerCoreComponent_GetCurrentLevelInfo) == 0x000008, "Wrong alignment on PlayerCoreComponent_GetCurrentLevelInfo");
static_assert(sizeof(PlayerCoreComponent_GetCurrentLevelInfo) == 0x000048, "Wrong size on PlayerCoreComponent_GetCurrentLevelInfo");
static_assert(offsetof(PlayerCoreComponent_GetCurrentLevelInfo, ReturnValue) == 0x000000, "Member 'PlayerCoreComponent_GetCurrentLevelInfo::ReturnValue' has a wrong offset!");

// Function POLYGON.PlayerCoreComponent.GetNextLevelInfo
// 0x0048 (0x0048 - 0x0000)
struct PlayerCoreComponent_GetNextLevelInfo final
{
public:
	struct FLevelInfo                             ReturnValue;                                       // 0x0000(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayerCoreComponent_GetNextLevelInfo) == 0x000008, "Wrong alignment on PlayerCoreComponent_GetNextLevelInfo");
static_assert(sizeof(PlayerCoreComponent_GetNextLevelInfo) == 0x000048, "Wrong size on PlayerCoreComponent_GetNextLevelInfo");
static_assert(offsetof(PlayerCoreComponent_GetNextLevelInfo, ReturnValue) == 0x000000, "Member 'PlayerCoreComponent_GetNextLevelInfo::ReturnValue' has a wrong offset!");

// Function POLYGON.ChatSystemComponent.SendMessage_Server
// 0x0020 (0x0020 - 0x0000)
struct ChatSystemComponent_SendMessage_Server final
{
public:
	struct FGameChatMessage                       Message;                                           // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatSystemComponent_SendMessage_Server) == 0x000008, "Wrong alignment on ChatSystemComponent_SendMessage_Server");
static_assert(sizeof(ChatSystemComponent_SendMessage_Server) == 0x000020, "Wrong size on ChatSystemComponent_SendMessage_Server");
static_assert(offsetof(ChatSystemComponent_SendMessage_Server, Message) == 0x000000, "Member 'ChatSystemComponent_SendMessage_Server::Message' has a wrong offset!");

// Function POLYGON.ChatSystemComponent.SentMessage_Multicast
// 0x0020 (0x0020 - 0x0000)
struct ChatSystemComponent_SentMessage_Multicast final
{
public:
	struct FGameChatMessage                       Message;                                           // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatSystemComponent_SentMessage_Multicast) == 0x000008, "Wrong alignment on ChatSystemComponent_SentMessage_Multicast");
static_assert(sizeof(ChatSystemComponent_SentMessage_Multicast) == 0x000020, "Wrong size on ChatSystemComponent_SentMessage_Multicast");
static_assert(offsetof(ChatSystemComponent_SentMessage_Multicast, Message) == 0x000000, "Member 'ChatSystemComponent_SentMessage_Multicast::Message' has a wrong offset!");

// Function POLYGON.ClientBackendComponent.IsClientLoggedIn
// 0x0001 (0x0001 - 0x0000)
struct ClientBackendComponent_IsClientLoggedIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientBackendComponent_IsClientLoggedIn) == 0x000001, "Wrong alignment on ClientBackendComponent_IsClientLoggedIn");
static_assert(sizeof(ClientBackendComponent_IsClientLoggedIn) == 0x000001, "Wrong size on ClientBackendComponent_IsClientLoggedIn");
static_assert(offsetof(ClientBackendComponent_IsClientLoggedIn, ReturnValue) == 0x000000, "Member 'ClientBackendComponent_IsClientLoggedIn::ReturnValue' has a wrong offset!");

// Function POLYGON.ClientBackendComponent.GiveVipLocal
// 0x0010 (0x0010 - 0x0000)
struct ClientBackendComponent_GiveVipLocal final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientBackendComponent_GiveVipLocal) == 0x000008, "Wrong alignment on ClientBackendComponent_GiveVipLocal");
static_assert(sizeof(ClientBackendComponent_GiveVipLocal) == 0x000010, "Wrong size on ClientBackendComponent_GiveVipLocal");
static_assert(offsetof(ClientBackendComponent_GiveVipLocal, ID) == 0x000000, "Member 'ClientBackendComponent_GiveVipLocal::ID' has a wrong offset!");

// Function POLYGON.ClientBackendComponent.SerPlayerExperiments
// 0x0008 (0x0008 - 0x0000)
struct ClientBackendComponent_SerPlayerExperiments final
{
public:
	class UPlayFabJsonObject*                     Experiments;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientBackendComponent_SerPlayerExperiments) == 0x000008, "Wrong alignment on ClientBackendComponent_SerPlayerExperiments");
static_assert(sizeof(ClientBackendComponent_SerPlayerExperiments) == 0x000008, "Wrong size on ClientBackendComponent_SerPlayerExperiments");
static_assert(offsetof(ClientBackendComponent_SerPlayerExperiments, Experiments) == 0x000000, "Member 'ClientBackendComponent_SerPlayerExperiments::Experiments' has a wrong offset!");

// Function POLYGON.ClientBackendComponent.SetPlayerCombinedInfo
// 0x0028 (0x0028 - 0x0000)
struct ClientBackendComponent_SetPlayerCombinedInfo final
{
public:
	class UPlayFabJsonObject*                     NewPlayerCombinedInfo;                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EModifiedData>                         ModifiedData;                                      // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 CustomDelegateString;                              // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientBackendComponent_SetPlayerCombinedInfo) == 0x000008, "Wrong alignment on ClientBackendComponent_SetPlayerCombinedInfo");
static_assert(sizeof(ClientBackendComponent_SetPlayerCombinedInfo) == 0x000028, "Wrong size on ClientBackendComponent_SetPlayerCombinedInfo");
static_assert(offsetof(ClientBackendComponent_SetPlayerCombinedInfo, NewPlayerCombinedInfo) == 0x000000, "Member 'ClientBackendComponent_SetPlayerCombinedInfo::NewPlayerCombinedInfo' has a wrong offset!");
static_assert(offsetof(ClientBackendComponent_SetPlayerCombinedInfo, ModifiedData) == 0x000008, "Member 'ClientBackendComponent_SetPlayerCombinedInfo::ModifiedData' has a wrong offset!");
static_assert(offsetof(ClientBackendComponent_SetPlayerCombinedInfo, CustomDelegateString) == 0x000018, "Member 'ClientBackendComponent_SetPlayerCombinedInfo::CustomDelegateString' has a wrong offset!");

// Function POLYGON.ClientBackendComponent.SetPlayerId
// 0x0010 (0x0010 - 0x0000)
struct ClientBackendComponent_SetPlayerId final
{
public:
	class FString                                 NewPlayerMasterId;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientBackendComponent_SetPlayerId) == 0x000008, "Wrong alignment on ClientBackendComponent_SetPlayerId");
static_assert(sizeof(ClientBackendComponent_SetPlayerId) == 0x000010, "Wrong size on ClientBackendComponent_SetPlayerId");
static_assert(offsetof(ClientBackendComponent_SetPlayerId, NewPlayerMasterId) == 0x000000, "Member 'ClientBackendComponent_SetPlayerId::NewPlayerMasterId' has a wrong offset!");

// Function POLYGON.ClientBackendComponent.GetPlayerCombinedInfo
// 0x0008 (0x0008 - 0x0000)
struct ClientBackendComponent_GetPlayerCombinedInfo final
{
public:
	class UPlayFabJsonObject*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientBackendComponent_GetPlayerCombinedInfo) == 0x000008, "Wrong alignment on ClientBackendComponent_GetPlayerCombinedInfo");
static_assert(sizeof(ClientBackendComponent_GetPlayerCombinedInfo) == 0x000008, "Wrong size on ClientBackendComponent_GetPlayerCombinedInfo");
static_assert(offsetof(ClientBackendComponent_GetPlayerCombinedInfo, ReturnValue) == 0x000000, "Member 'ClientBackendComponent_GetPlayerCombinedInfo::ReturnValue' has a wrong offset!");

// Function POLYGON.ClientBackendComponent.GetPlayerExperiments
// 0x0008 (0x0008 - 0x0000)
struct ClientBackendComponent_GetPlayerExperiments final
{
public:
	class UPlayFabJsonObject*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientBackendComponent_GetPlayerExperiments) == 0x000008, "Wrong alignment on ClientBackendComponent_GetPlayerExperiments");
static_assert(sizeof(ClientBackendComponent_GetPlayerExperiments) == 0x000008, "Wrong size on ClientBackendComponent_GetPlayerExperiments");
static_assert(offsetof(ClientBackendComponent_GetPlayerExperiments, ReturnValue) == 0x000000, "Member 'ClientBackendComponent_GetPlayerExperiments::ReturnValue' has a wrong offset!");

// Function POLYGON.ServerGameInstance.OnGSDKHealthCheck
// 0x0001 (0x0001 - 0x0000)
struct ServerGameInstance_OnGSDKHealthCheck final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ServerGameInstance_OnGSDKHealthCheck) == 0x000001, "Wrong alignment on ServerGameInstance_OnGSDKHealthCheck");
static_assert(sizeof(ServerGameInstance_OnGSDKHealthCheck) == 0x000001, "Wrong size on ServerGameInstance_OnGSDKHealthCheck");
static_assert(offsetof(ServerGameInstance_OnGSDKHealthCheck, ReturnValue) == 0x000000, "Member 'ServerGameInstance_OnGSDKHealthCheck::ReturnValue' has a wrong offset!");

// Function POLYGON.ClientGameInstance.HandleNetworkFailure
// 0x0028 (0x0028 - 0x0000)
struct ClientGameInstance_HandleNetworkFailure final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNetDriver*                             NetDriver;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENetworkFailure                               FailureType;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C23[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorString;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientGameInstance_HandleNetworkFailure) == 0x000008, "Wrong alignment on ClientGameInstance_HandleNetworkFailure");
static_assert(sizeof(ClientGameInstance_HandleNetworkFailure) == 0x000028, "Wrong size on ClientGameInstance_HandleNetworkFailure");
static_assert(offsetof(ClientGameInstance_HandleNetworkFailure, World) == 0x000000, "Member 'ClientGameInstance_HandleNetworkFailure::World' has a wrong offset!");
static_assert(offsetof(ClientGameInstance_HandleNetworkFailure, NetDriver) == 0x000008, "Member 'ClientGameInstance_HandleNetworkFailure::NetDriver' has a wrong offset!");
static_assert(offsetof(ClientGameInstance_HandleNetworkFailure, FailureType) == 0x000010, "Member 'ClientGameInstance_HandleNetworkFailure::FailureType' has a wrong offset!");
static_assert(offsetof(ClientGameInstance_HandleNetworkFailure, ErrorString) == 0x000018, "Member 'ClientGameInstance_HandleNetworkFailure::ErrorString' has a wrong offset!");

// Function POLYGON.ClientGameInstance.SetPlayerCombinedInfo
// 0x0008 (0x0008 - 0x0000)
struct ClientGameInstance_SetPlayerCombinedInfo final
{
public:
	class UPlayFabJsonObject*                     NewPlayerCombinedInfo;                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientGameInstance_SetPlayerCombinedInfo) == 0x000008, "Wrong alignment on ClientGameInstance_SetPlayerCombinedInfo");
static_assert(sizeof(ClientGameInstance_SetPlayerCombinedInfo) == 0x000008, "Wrong size on ClientGameInstance_SetPlayerCombinedInfo");
static_assert(offsetof(ClientGameInstance_SetPlayerCombinedInfo, NewPlayerCombinedInfo) == 0x000000, "Member 'ClientGameInstance_SetPlayerCombinedInfo::NewPlayerCombinedInfo' has a wrong offset!");

// Function POLYGON.ClientGameInstance.SetPlayerId
// 0x0010 (0x0010 - 0x0000)
struct ClientGameInstance_SetPlayerId final
{
public:
	class FString                                 NewPlayerMasterId;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientGameInstance_SetPlayerId) == 0x000008, "Wrong alignment on ClientGameInstance_SetPlayerId");
static_assert(sizeof(ClientGameInstance_SetPlayerId) == 0x000010, "Wrong size on ClientGameInstance_SetPlayerId");
static_assert(offsetof(ClientGameInstance_SetPlayerId, NewPlayerMasterId) == 0x000000, "Member 'ClientGameInstance_SetPlayerId::NewPlayerMasterId' has a wrong offset!");

// Function POLYGON.ClientGameInstance.SetServerTime
// 0x0008 (0x0008 - 0x0000)
struct ClientGameInstance_SetServerTime final
{
public:
	struct FDateTime                              ServerTime;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientGameInstance_SetServerTime) == 0x000008, "Wrong alignment on ClientGameInstance_SetServerTime");
static_assert(sizeof(ClientGameInstance_SetServerTime) == 0x000008, "Wrong size on ClientGameInstance_SetServerTime");
static_assert(offsetof(ClientGameInstance_SetServerTime, ServerTime) == 0x000000, "Member 'ClientGameInstance_SetServerTime::ServerTime' has a wrong offset!");

// Function POLYGON.ClientGameInstance.GetPlayerCombinedInfo
// 0x0008 (0x0008 - 0x0000)
struct ClientGameInstance_GetPlayerCombinedInfo final
{
public:
	class UPlayFabJsonObject*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientGameInstance_GetPlayerCombinedInfo) == 0x000008, "Wrong alignment on ClientGameInstance_GetPlayerCombinedInfo");
static_assert(sizeof(ClientGameInstance_GetPlayerCombinedInfo) == 0x000008, "Wrong size on ClientGameInstance_GetPlayerCombinedInfo");
static_assert(offsetof(ClientGameInstance_GetPlayerCombinedInfo, ReturnValue) == 0x000000, "Member 'ClientGameInstance_GetPlayerCombinedInfo::ReturnValue' has a wrong offset!");

// Function POLYGON.ClientGameInstance.GetPlayerMasterId
// 0x0010 (0x0010 - 0x0000)
struct ClientGameInstance_GetPlayerMasterId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientGameInstance_GetPlayerMasterId) == 0x000008, "Wrong alignment on ClientGameInstance_GetPlayerMasterId");
static_assert(sizeof(ClientGameInstance_GetPlayerMasterId) == 0x000010, "Wrong size on ClientGameInstance_GetPlayerMasterId");
static_assert(offsetof(ClientGameInstance_GetPlayerMasterId, ReturnValue) == 0x000000, "Member 'ClientGameInstance_GetPlayerMasterId::ReturnValue' has a wrong offset!");

// Function POLYGON.ClientGameInstance.GetServerTime
// 0x0008 (0x0008 - 0x0000)
struct ClientGameInstance_GetServerTime final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClientGameInstance_GetServerTime) == 0x000008, "Wrong alignment on ClientGameInstance_GetServerTime");
static_assert(sizeof(ClientGameInstance_GetServerTime) == 0x000008, "Wrong size on ClientGameInstance_GetServerTime");
static_assert(offsetof(ClientGameInstance_GetServerTime, ReturnValue) == 0x000000, "Member 'ClientGameInstance_GetServerTime::ReturnValue' has a wrong offset!");

// Function POLYGON.ControlPoint.ContainsCharacter
// 0x0010 (0x0010 - 0x0000)
struct ControlPoint_ContainsCharacter final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C29[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ControlPoint_ContainsCharacter) == 0x000008, "Wrong alignment on ControlPoint_ContainsCharacter");
static_assert(sizeof(ControlPoint_ContainsCharacter) == 0x000010, "Wrong size on ControlPoint_ContainsCharacter");
static_assert(offsetof(ControlPoint_ContainsCharacter, Character) == 0x000000, "Member 'ControlPoint_ContainsCharacter::Character' has a wrong offset!");
static_assert(offsetof(ControlPoint_ContainsCharacter, ReturnValue) == 0x000008, "Member 'ControlPoint_ContainsCharacter::ReturnValue' has a wrong offset!");

// Function POLYGON.ControlPoint.GetControlPointNameAsOneLetter
// 0x0010 (0x0010 - 0x0000)
struct ControlPoint_GetControlPointNameAsOneLetter final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ControlPoint_GetControlPointNameAsOneLetter) == 0x000008, "Wrong alignment on ControlPoint_GetControlPointNameAsOneLetter");
static_assert(sizeof(ControlPoint_GetControlPointNameAsOneLetter) == 0x000010, "Wrong size on ControlPoint_GetControlPointNameAsOneLetter");
static_assert(offsetof(ControlPoint_GetControlPointNameAsOneLetter, ReturnValue) == 0x000000, "Member 'ControlPoint_GetControlPointNameAsOneLetter::ReturnValue' has a wrong offset!");

// Function POLYGON.ControlPoint.GetControlPointNameAsString
// 0x0010 (0x0010 - 0x0000)
struct ControlPoint_GetControlPointNameAsString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ControlPoint_GetControlPointNameAsString) == 0x000008, "Wrong alignment on ControlPoint_GetControlPointNameAsString");
static_assert(sizeof(ControlPoint_GetControlPointNameAsString) == 0x000010, "Wrong size on ControlPoint_GetControlPointNameAsString");
static_assert(offsetof(ControlPoint_GetControlPointNameAsString, ReturnValue) == 0x000000, "Member 'ControlPoint_GetControlPointNameAsString::ReturnValue' has a wrong offset!");

// Function POLYGON.DataManagerLibrary.GetDataTableReferences
// 0x0008 (0x0008 - 0x0000)
struct DataManagerLibrary_GetDataTableReferences final
{
public:
	class UDataContainerAsset*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DataManagerLibrary_GetDataTableReferences) == 0x000008, "Wrong alignment on DataManagerLibrary_GetDataTableReferences");
static_assert(sizeof(DataManagerLibrary_GetDataTableReferences) == 0x000008, "Wrong size on DataManagerLibrary_GetDataTableReferences");
static_assert(offsetof(DataManagerLibrary_GetDataTableReferences, ReturnValue) == 0x000000, "Member 'DataManagerLibrary_GetDataTableReferences::ReturnValue' has a wrong offset!");

// Function POLYGON.EOSPartyId.ToString
// 0x0010 (0x0010 - 0x0000)
struct EOSPartyId_ToString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EOSPartyId_ToString) == 0x000008, "Wrong alignment on EOSPartyId_ToString");
static_assert(sizeof(EOSPartyId_ToString) == 0x000010, "Wrong size on EOSPartyId_ToString");
static_assert(offsetof(EOSPartyId_ToString, ReturnValue) == 0x000000, "Member 'EOSPartyId_ToString::ReturnValue' has a wrong offset!");

// Function POLYGON.EOSPartyMemberId.ToString
// 0x0010 (0x0010 - 0x0000)
struct EOSPartyMemberId_ToString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EOSPartyMemberId_ToString) == 0x000008, "Wrong alignment on EOSPartyMemberId_ToString");
static_assert(sizeof(EOSPartyMemberId_ToString) == 0x000010, "Wrong size on EOSPartyMemberId_ToString");
static_assert(offsetof(EOSPartyMemberId_ToString, ReturnValue) == 0x000000, "Member 'EOSPartyMemberId_ToString::ReturnValue' has a wrong offset!");

// Function POLYGON.EOSSubsystemAvanced.GetJoinedParties
// 0x0018 (0x0018 - 0x0000)
struct EOSSubsystemAvanced_GetJoinedParties final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UEOSPartyId*>                    ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EOSSubsystemAvanced_GetJoinedParties) == 0x000008, "Wrong alignment on EOSSubsystemAvanced_GetJoinedParties");
static_assert(sizeof(EOSSubsystemAvanced_GetJoinedParties) == 0x000018, "Wrong size on EOSSubsystemAvanced_GetJoinedParties");
static_assert(offsetof(EOSSubsystemAvanced_GetJoinedParties, WorldContextObject) == 0x000000, "Member 'EOSSubsystemAvanced_GetJoinedParties::WorldContextObject' has a wrong offset!");
static_assert(offsetof(EOSSubsystemAvanced_GetJoinedParties, ReturnValue) == 0x000008, "Member 'EOSSubsystemAvanced_GetJoinedParties::ReturnValue' has a wrong offset!");

// Function POLYGON.EOSSubsystemAvanced.GetPartyMembers
// 0x0020 (0x0020 - 0x0000)
struct EOSSubsystemAvanced_GetPartyMembers final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEOSPartyId*                            PartyId;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UEOSPartyMemberId*>              ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(EOSSubsystemAvanced_GetPartyMembers) == 0x000008, "Wrong alignment on EOSSubsystemAvanced_GetPartyMembers");
static_assert(sizeof(EOSSubsystemAvanced_GetPartyMembers) == 0x000020, "Wrong size on EOSSubsystemAvanced_GetPartyMembers");
static_assert(offsetof(EOSSubsystemAvanced_GetPartyMembers, WorldContextObject) == 0x000000, "Member 'EOSSubsystemAvanced_GetPartyMembers::WorldContextObject' has a wrong offset!");
static_assert(offsetof(EOSSubsystemAvanced_GetPartyMembers, PartyId) == 0x000008, "Member 'EOSSubsystemAvanced_GetPartyMembers::PartyId' has a wrong offset!");
static_assert(offsetof(EOSSubsystemAvanced_GetPartyMembers, ReturnValue) == 0x000010, "Member 'EOSSubsystemAvanced_GetPartyMembers::ReturnValue' has a wrong offset!");

// Function POLYGON.EOSSubsystemAvanced.StartCreateParty
// 0x0020 (0x0020 - 0x0000)
struct EOSSubsystemAvanced_StartCreateParty final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PartyTypeId;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool WasSuccessful)>           OnDone;                                            // 0x000C(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C2D[0x4];                                     // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EOSSubsystemAvanced_StartCreateParty) == 0x000008, "Wrong alignment on EOSSubsystemAvanced_StartCreateParty");
static_assert(sizeof(EOSSubsystemAvanced_StartCreateParty) == 0x000020, "Wrong size on EOSSubsystemAvanced_StartCreateParty");
static_assert(offsetof(EOSSubsystemAvanced_StartCreateParty, WorldContextObject) == 0x000000, "Member 'EOSSubsystemAvanced_StartCreateParty::WorldContextObject' has a wrong offset!");
static_assert(offsetof(EOSSubsystemAvanced_StartCreateParty, PartyTypeId) == 0x000008, "Member 'EOSSubsystemAvanced_StartCreateParty::PartyTypeId' has a wrong offset!");
static_assert(offsetof(EOSSubsystemAvanced_StartCreateParty, OnDone) == 0x00000C, "Member 'EOSSubsystemAvanced_StartCreateParty::OnDone' has a wrong offset!");

// Function POLYGON.EOSSubsystemAvanced.StartLogin
// 0x0010 (0x0010 - 0x0000)
struct EOSSubsystemAvanced_StartLogin final
{
public:
	TDelegate<void(bool IsSuccessful, const class FString& ErrorMessage)> OnLoginComplete;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EOSSubsystemAvanced_StartLogin) == 0x000004, "Wrong alignment on EOSSubsystemAvanced_StartLogin");
static_assert(sizeof(EOSSubsystemAvanced_StartLogin) == 0x000010, "Wrong size on EOSSubsystemAvanced_StartLogin");
static_assert(offsetof(EOSSubsystemAvanced_StartLogin, OnLoginComplete) == 0x000000, "Member 'EOSSubsystemAvanced_StartLogin::OnLoginComplete' has a wrong offset!");

// Function POLYGON.FOVManagerComponent.SetCameraFOV
// 0x0004 (0x0004 - 0x0000)
struct FOVManagerComponent_SetCameraFOV final
{
public:
	float                                         NewCameraFOV;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOVManagerComponent_SetCameraFOV) == 0x000004, "Wrong alignment on FOVManagerComponent_SetCameraFOV");
static_assert(sizeof(FOVManagerComponent_SetCameraFOV) == 0x000004, "Wrong size on FOVManagerComponent_SetCameraFOV");
static_assert(offsetof(FOVManagerComponent_SetCameraFOV, NewCameraFOV) == 0x000000, "Member 'FOVManagerComponent_SetCameraFOV::NewCameraFOV' has a wrong offset!");

// Function POLYGON.FOVManagerComponent.SetDefaultCameraFOV
// 0x0004 (0x0004 - 0x0000)
struct FOVManagerComponent_SetDefaultCameraFOV final
{
public:
	float                                         NewDefaultCameraFOV;                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOVManagerComponent_SetDefaultCameraFOV) == 0x000004, "Wrong alignment on FOVManagerComponent_SetDefaultCameraFOV");
static_assert(sizeof(FOVManagerComponent_SetDefaultCameraFOV) == 0x000004, "Wrong size on FOVManagerComponent_SetDefaultCameraFOV");
static_assert(offsetof(FOVManagerComponent_SetDefaultCameraFOV, NewDefaultCameraFOV) == 0x000000, "Member 'FOVManagerComponent_SetDefaultCameraFOV::NewDefaultCameraFOV' has a wrong offset!");

// Function POLYGON.FOVManagerComponent.SetMeshFOV
// 0x0004 (0x0004 - 0x0000)
struct FOVManagerComponent_SetMeshFOV final
{
public:
	float                                         NewMeshFOV;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOVManagerComponent_SetMeshFOV) == 0x000004, "Wrong alignment on FOVManagerComponent_SetMeshFOV");
static_assert(sizeof(FOVManagerComponent_SetMeshFOV) == 0x000004, "Wrong size on FOVManagerComponent_SetMeshFOV");
static_assert(offsetof(FOVManagerComponent_SetMeshFOV, NewMeshFOV) == 0x000000, "Member 'FOVManagerComponent_SetMeshFOV::NewMeshFOV' has a wrong offset!");

// Function POLYGON.FOVManagerInterface.SetCorrectiveFovMaterial
// 0x0001 (0x0001 - 0x0000)
struct FOVManagerInterface_SetCorrectiveFovMaterial final
{
public:
	bool                                          UseFovMaterial;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOVManagerInterface_SetCorrectiveFovMaterial) == 0x000001, "Wrong alignment on FOVManagerInterface_SetCorrectiveFovMaterial");
static_assert(sizeof(FOVManagerInterface_SetCorrectiveFovMaterial) == 0x000001, "Wrong size on FOVManagerInterface_SetCorrectiveFovMaterial");
static_assert(offsetof(FOVManagerInterface_SetCorrectiveFovMaterial, UseFovMaterial) == 0x000000, "Member 'FOVManagerInterface_SetCorrectiveFovMaterial::UseFovMaterial' has a wrong offset!");

// Function POLYGON.GunModulesInfo.FindModule
// 0x0058 (0x0058 - 0x0000)
struct GunModulesInfo_FindModule final
{
public:
	TArray<struct FGunModuleInfo>                 Array;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TSubclassOf<class AItem_Module_General>       ModuleClass;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGunModuleInfo                         ReturnValue;                                       // 0x0018(0x0040)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(GunModulesInfo_FindModule) == 0x000008, "Wrong alignment on GunModulesInfo_FindModule");
static_assert(sizeof(GunModulesInfo_FindModule) == 0x000058, "Wrong size on GunModulesInfo_FindModule");
static_assert(offsetof(GunModulesInfo_FindModule, Array) == 0x000000, "Member 'GunModulesInfo_FindModule::Array' has a wrong offset!");
static_assert(offsetof(GunModulesInfo_FindModule, ModuleClass) == 0x000010, "Member 'GunModulesInfo_FindModule::ModuleClass' has a wrong offset!");
static_assert(offsetof(GunModulesInfo_FindModule, ReturnValue) == 0x000018, "Member 'GunModulesInfo_FindModule::ReturnValue' has a wrong offset!");

// Function POLYGON.HealthStatsComponent.OnRep_Health
// 0x0001 (0x0001 - 0x0000)
struct HealthStatsComponent_OnRep_Health final
{
public:
	uint8                                         PreviousHealth;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HealthStatsComponent_OnRep_Health) == 0x000001, "Wrong alignment on HealthStatsComponent_OnRep_Health");
static_assert(sizeof(HealthStatsComponent_OnRep_Health) == 0x000001, "Wrong size on HealthStatsComponent_OnRep_Health");
static_assert(offsetof(HealthStatsComponent_OnRep_Health, PreviousHealth) == 0x000000, "Member 'HealthStatsComponent_OnRep_Health::PreviousHealth' has a wrong offset!");

// Function POLYGON.HealthStatsComponent.GetHealth
// 0x0004 (0x0004 - 0x0000)
struct HealthStatsComponent_GetHealth final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HealthStatsComponent_GetHealth) == 0x000004, "Wrong alignment on HealthStatsComponent_GetHealth");
static_assert(sizeof(HealthStatsComponent_GetHealth) == 0x000004, "Wrong size on HealthStatsComponent_GetHealth");
static_assert(offsetof(HealthStatsComponent_GetHealth, ReturnValue) == 0x000000, "Member 'HealthStatsComponent_GetHealth::ReturnValue' has a wrong offset!");

// Function POLYGON.HealthStatsComponent.GetHealthProtection
// 0x0001 (0x0001 - 0x0000)
struct HealthStatsComponent_GetHealthProtection final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HealthStatsComponent_GetHealthProtection) == 0x000001, "Wrong alignment on HealthStatsComponent_GetHealthProtection");
static_assert(sizeof(HealthStatsComponent_GetHealthProtection) == 0x000001, "Wrong size on HealthStatsComponent_GetHealthProtection");
static_assert(offsetof(HealthStatsComponent_GetHealthProtection, ReturnValue) == 0x000000, "Member 'HealthStatsComponent_GetHealthProtection::ReturnValue' has a wrong offset!");

// Function POLYGON.HealthStatsComponent.GetStamina
// 0x0004 (0x0004 - 0x0000)
struct HealthStatsComponent_GetStamina final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HealthStatsComponent_GetStamina) == 0x000004, "Wrong alignment on HealthStatsComponent_GetStamina");
static_assert(sizeof(HealthStatsComponent_GetStamina) == 0x000004, "Wrong size on HealthStatsComponent_GetStamina");
static_assert(offsetof(HealthStatsComponent_GetStamina, ReturnValue) == 0x000000, "Member 'HealthStatsComponent_GetStamina::ReturnValue' has a wrong offset!");

// Function POLYGON.InspectManagerComponent.SetPivotOffset
// 0x0010 (0x0010 - 0x0000)
struct InspectManagerComponent_SetPivotOffset final
{
public:
