#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_General_CameraTransition

#include "Basic.hpp"


namespace SDK::Params
{

// Function Task_General_CameraTransition.Task_General_CameraTransition_C.ExecuteUbergraph_Task_General_CameraTransition
// 0x0048 (0x0048 - 0x0000)
struct Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CF4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACameraActor*>                   CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0008(0x0010)(ReferenceParm)
	class ACameraActor*                           CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CF5[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CF6[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CF7[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetViewTargetWithBlend_BlendTime_ImplicitCast; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition) == 0x000008, "Wrong alignment on Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition");
static_assert(sizeof(Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition) == 0x000048, "Wrong size on Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition");
static_assert(offsetof(Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition, EntryPoint) == 0x000000, "Member 'Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition::EntryPoint' has a wrong offset!");
static_assert(offsetof(Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000008, "Member 'Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition, CallFunc_Array_Get_Item) == 0x000018, "Member 'Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition, CallFunc_NotEqual_NameName_ReturnValue) == 0x000020, "Member 'Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition, CallFunc_SetViewTargetWithBlend_BlendTime_ImplicitCast) == 0x000044, "Member 'Task_General_CameraTransition_C_ExecuteUbergraph_Task_General_CameraTransition::CallFunc_SetViewTargetWithBlend_BlendTime_ImplicitCast' has a wrong offset!");

}

