#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_Multiplayer_Matchmake

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Actions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Task_Multiplayer_Matchmake.Task_Multiplayer_Matchmake_C
// 0x0028 (0x00D0 - 0x00A8)
class UTask_Multiplayer_Matchmake_C final : public UAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_PG_PlayerController_Menu_C*         PlayerController;                                  // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UUI_ServerInfo_C*>               RejectedServers;                                   // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UUI_ServerInfo_C*                       SelectedBestServer;                                // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ConnectToBestServer();
	void ExecuteUbergraph_Task_Multiplayer_Matchmake(int32 EntryPoint);
	void OnConnectionFinished_Event(bool IsSuccessful);
	void OnServerListUpdated_Event();
	void ReceiveActivate();
	void SelectBestServer(class UUI_ServerInfo_C** BestServer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Task_Multiplayer_Matchmake_C">();
	}
	static class UTask_Multiplayer_Matchmake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTask_Multiplayer_Matchmake_C>();
	}
};
static_assert(alignof(UTask_Multiplayer_Matchmake_C) == 0x000008, "Wrong alignment on UTask_Multiplayer_Matchmake_C");
static_assert(sizeof(UTask_Multiplayer_Matchmake_C) == 0x0000D0, "Wrong size on UTask_Multiplayer_Matchmake_C");
static_assert(offsetof(UTask_Multiplayer_Matchmake_C, UberGraphFrame) == 0x0000A8, "Member 'UTask_Multiplayer_Matchmake_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTask_Multiplayer_Matchmake_C, PlayerController) == 0x0000B0, "Member 'UTask_Multiplayer_Matchmake_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UTask_Multiplayer_Matchmake_C, RejectedServers) == 0x0000B8, "Member 'UTask_Multiplayer_Matchmake_C::RejectedServers' has a wrong offset!");
static_assert(offsetof(UTask_Multiplayer_Matchmake_C, SelectedBestServer) == 0x0000C8, "Member 'UTask_Multiplayer_Matchmake_C::SelectedBestServer' has a wrong offset!");

}

