#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle

#include "Basic.hpp"

#include "Actions_structs.hpp"
#include "PlayFab_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle.Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C.ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle
// 0x04B0 (0x04B0 - 0x0000)
struct Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33DD[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x0020(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_4;                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33DE[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x0078(0x0040)()
	TDelegate<void(const struct FClientUpdateUserDataResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33DF[0x2];                                     // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33E0[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33E1[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33E2[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabError                          K2Node_CustomEvent_error_1;                        // 0x0118(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_3;                   // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientGetTimeResult                   K2Node_CustomEvent_result_1;                       // 0x0158(0x0018)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_DateTimeFromIsoString_Result;             // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DateTimeFromIsoString_ReturnValue;        // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33E3[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_DateTimeFromIsoString_Result_1;           // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DateTimeFromIsoString_ReturnValue_1;      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33E4[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetDuration_ReturnValue;                  // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33E5[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_1;      // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_2;        // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33E6[0x2];                                     // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_2;      // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33E7[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue;          // 0x0210(0x0010)(ReferenceParm)
	class UPlayFabJsonObject*                     CallFunc_Array_Get_Item;                           // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33E8[0x5];                                     // 0x0233(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_2;             // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33E9[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_3;      // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FClientGetTimeResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0258(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_2;             // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                      CallFunc_GetTime_ReturnValue;                      // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_1;                   // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33EA[0x6];                                     // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      Temp_struct_Variable_1;                            // 0x0280(0x0040)()
	struct FClientUpdateUserDataResult            K2Node_CustomEvent_result;                         // 0x02C0(0x0010)(NoDestructor)
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x02D8(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33EB[0x7];                                     // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientUpdateUserDataRequest           K2Node_MakeStruct_ClientUpdateUserDataRequest;     // 0x0338(0x0030)()
	class UPlayFabClientAPI*                      CallFunc_UpdateUserData_ReturnValue;               // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue_1;        // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_3;             // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_DecodeJson_ReturnValue;                   // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0392(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EActionState                                  K2Node_Event_Reason;                               // 0x0393(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33EC[0x4];                                     // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response_1;                     // 0x0398(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_5;                   // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful_1;                   // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33ED[0x6];                                     // 0x03E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_4;      // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue_1;        // 0x03F0(0x0010)(ReferenceParm)
	class UPlayFabJsonObject*                     CallFunc_Array_Get_Item_1;                         // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33EE[0x4];                                     // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_4;             // 0x0410(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0423(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33EF[0x3];                                     // 0x0425(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0428(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33F0[0x7];                                     // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_C* CallFunc_Create_ReturnValue;                       // 0x0450(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0458(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33F1[0x7];                                     // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0470(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0480(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33F2[0x4];                                     // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x049A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33F3[0x5];                                     // 0x049B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle) == 0x000008, "Wrong alignment on Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle");
static_assert(sizeof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle) == 0x0004B0, "Wrong size on Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, EntryPoint) == 0x000000, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::EntryPoint' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CustomEvent_response) == 0x000020, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CustomEvent_customData_4) == 0x000060, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CustomEvent_customData_4' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CustomEvent_successful) == 0x000068, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, Temp_bool_Variable) == 0x000069, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, Temp_object_Variable) == 0x000070, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, Temp_struct_Variable) == 0x000078, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000C8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, Temp_bool_True_if_break_was_hit_Variable) == 0x0000D9, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, Temp_int_Array_Index_Variable) == 0x0000DC, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_Not_PreBool_ReturnValue) == 0x0000E0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, Temp_int_Loop_Counter_Variable_1) == 0x0000E4, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000E8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000F8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, Temp_int_Array_Index_Variable_1) == 0x0000FC, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, Temp_int_Loop_Counter_Variable_2) == 0x000100, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_Add_IntInt_ReturnValue_2) == 0x000104, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000108, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, Temp_int_Array_Index_Variable_2) == 0x00010C, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_Not_PreBool_ReturnValue_1) == 0x000110, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CustomEvent_error_1) == 0x000118, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CustomEvent_error_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CustomEvent_customData_3) == 0x000150, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CustomEvent_customData_3' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CustomEvent_result_1) == 0x000158, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CustomEvent_result_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CustomEvent_customData_2) == 0x000170, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CustomEvent_customData_2' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000178, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_GetObjectField_ReturnValue) == 0x000180, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_DateTimeFromIsoString_Result) == 0x000188, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_DateTimeFromIsoString_Result' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_DateTimeFromIsoString_ReturnValue) == 0x000190, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_DateTimeFromIsoString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_GetObjectField_ReturnValue_1) == 0x000198, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_GetStringField_ReturnValue) == 0x0001A0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_GetStringField_ReturnValue_1) == 0x0001B0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_DateTimeFromIsoString_Result_1) == 0x0001C0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_DateTimeFromIsoString_Result_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_DateTimeFromIsoString_ReturnValue_1) == 0x0001C8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_DateTimeFromIsoString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x0001D0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_GetDuration_ReturnValue) == 0x0001D8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_GetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_GetTotalSeconds_ReturnValue) == 0x0001E0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_FTrunc_ReturnValue) == 0x0001E4, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001E8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_GetPlayerCombinedInfo_ReturnValue_1) == 0x0001F0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_GetPlayerCombinedInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_Clamp_ReturnValue) == 0x0001F8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_HasField_ReturnValue) == 0x0001FC, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_HasField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, Temp_bool_True_if_break_was_hit_Variable_2) == 0x0001FD, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::Temp_bool_True_if_break_was_hit_Variable_2' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_GetPlayerCombinedInfo_ReturnValue_2) == 0x000200, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_GetPlayerCombinedInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_Not_PreBool_ReturnValue_2) == 0x000208, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_GetObjectArrayField_ReturnValue) == 0x000210, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_GetObjectArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_Array_Get_Item) == 0x000220, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_Array_Length_ReturnValue) == 0x000228, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_GetNumberField_ReturnValue) == 0x00022C, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_Less_IntInt_ReturnValue) == 0x000230, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000231, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_BooleanAND_ReturnValue) == 0x000232, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_GetStringField_ReturnValue_2) == 0x000238, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_GetStringField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000248, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_GetPlayerCombinedInfo_ReturnValue_3) == 0x000250, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_GetPlayerCombinedInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CreateDelegate_OutputDelegate_4) == 0x000258, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_GetObjectField_ReturnValue_2) == 0x000268, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_GetObjectField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_GetTime_ReturnValue) == 0x000270, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_GetTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_HasField_ReturnValue_1) == 0x000278, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_HasField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_IsValid_ReturnValue) == 0x000279, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, Temp_struct_Variable_1) == 0x000280, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CustomEvent_result) == 0x0002C0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CustomEvent_result' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CustomEvent_customData_1) == 0x0002D0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CustomEvent_customData_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CustomEvent_error) == 0x0002D8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CustomEvent_error' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CustomEvent_customData) == 0x000310, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CustomEvent_customData' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_ConstructJsonObject_ReturnValue) == 0x000318, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, Temp_object_Variable_1) == 0x000320, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000328, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, Temp_bool_Variable_1) == 0x000330, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_MakeStruct_ClientUpdateUserDataRequest) == 0x000338, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_MakeStruct_ClientUpdateUserDataRequest' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_UpdateUserData_ReturnValue) == 0x000368, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_UpdateUserData_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_ConstructJsonObject_ReturnValue_1) == 0x000370, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_ConstructJsonObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_LowEntry_LocalVariable_Value__1_Object) == 0x000378, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_LowEntry_LocalVariable_Value__1_Object' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_GetStringField_ReturnValue_3) == 0x000380, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_GetStringField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_DecodeJson_ReturnValue) == 0x000390, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_DecodeJson_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000391, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_IsValid_ReturnValue_1) == 0x000392, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_Event_Reason) == 0x000393, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CustomEvent_response_1) == 0x000398, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CustomEvent_response_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CustomEvent_customData_5) == 0x0003D8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CustomEvent_customData_5' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, K2Node_CustomEvent_successful_1) == 0x0003E0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::K2Node_CustomEvent_successful_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0003E1, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle, CallFunc_GetPlayerCombinedInfo_ReturnValue_4) == 0x0003E8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle::CallFunc_GetPlayerCombinedInfo_ReturnValue_4' has a wrong offset!");
