#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_General_CameraTransition

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Actions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Task_General_CameraTransition.Task_General_CameraTransition_C
// 0x0028 (0x00D0 - 0x00A8)
class UTask_General_CameraTransition_C final : public UAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUI_CameraTransitions_DarkenScreen_C*   CreatedCameraTransitionWidget;                     // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         ZOrder;                                            // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   SwitchCameraTag;                                   // 0x00BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3CF3[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SwitchCameraBlendTime;                             // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Task_General_CameraTransition(int32 EntryPoint);
	void ReceiveActivate();
	void SwitchCamera_Event();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Task_General_CameraTransition_C">();
	}
	static class UTask_General_CameraTransition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTask_General_CameraTransition_C>();
	}
};
static_assert(alignof(UTask_General_CameraTransition_C) == 0x000008, "Wrong alignment on UTask_General_CameraTransition_C");
static_assert(sizeof(UTask_General_CameraTransition_C) == 0x0000D0, "Wrong size on UTask_General_CameraTransition_C");
static_assert(offsetof(UTask_General_CameraTransition_C, UberGraphFrame) == 0x0000A8, "Member 'UTask_General_CameraTransition_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTask_General_CameraTransition_C, CreatedCameraTransitionWidget) == 0x0000B0, "Member 'UTask_General_CameraTransition_C::CreatedCameraTransitionWidget' has a wrong offset!");
static_assert(offsetof(UTask_General_CameraTransition_C, ZOrder) == 0x0000B8, "Member 'UTask_General_CameraTransition_C::ZOrder' has a wrong offset!");
static_assert(offsetof(UTask_General_CameraTransition_C, SwitchCameraTag) == 0x0000BC, "Member 'UTask_General_CameraTransition_C::SwitchCameraTag' has a wrong offset!");
static_assert(offsetof(UTask_General_CameraTransition_C, SwitchCameraBlendTime) == 0x0000C8, "Member 'UTask_General_CameraTransition_C::SwitchCameraBlendTime' has a wrong offset!");

}

