#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_Character_SetupByTeam

#include "Basic.hpp"

#include "POLYGON_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Task_Character_SetupByTeam.Task_Character_SetupByTeam_C.ExecuteUbergraph_Task_Character_SetupByTeam
// 0x02C0 (0x02C0 - 0x0000)
struct Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E18[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E19[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1A[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1B[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerController_Base*              K2Node_DynamicCast_AsPG_Player_Controller_Base;    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1C[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1D[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1E[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_Game_Character_C*                K2Node_DynamicCast_AsBP_PG_Game_Character;         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1F[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game_1;    // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E20[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_PlayerMarker_C*                     K2Node_DynamicCast_AsUI_Player_Marker;             // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E21[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E22[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_1;                  // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_PlayerMarker_C*                     K2Node_DynamicCast_AsUI_Player_Marker_1;           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E23[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x010C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_3;          // 0x011F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E24[0x3];                                     // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPlayerViewPoint_Location;              // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetPlayerViewPoint_Rotation;              // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E25[0x3];                                     // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFOVAngle_ReturnValue;                  // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E26[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue_1;                       // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam) == 0x000008, "Wrong alignment on Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam");
static_assert(sizeof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam) == 0x0002C0, "Wrong size on Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, EntryPoint) == 0x000000, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::EntryPoint' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, Temp_bool_Has_Been_Initd_Variable) == 0x000034, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x000058, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_GetPlayerController_ReturnValue_1) == 0x000068, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_DynamicCast_AsPG_Player_Controller_Base) == 0x000070, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_DynamicCast_AsPG_Player_Controller_Base' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_GetPlayerController_ReturnValue_2) == 0x000080, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, Temp_bool_IsClosed_Variable) == 0x000088, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x000090, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_IsValid_ReturnValue_1) == 0x000099, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_GetOwnerActor_ReturnValue) == 0x0000A0, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_DynamicCast_AsBP_PG_Game_Character) == 0x0000A8, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_DynamicCast_AsBP_PG_Game_Character' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_DynamicCast_bSuccess_3) == 0x0000B0, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_DynamicCast_AsBP_PG_Player_State_Game_1) == 0x0000B8, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_DynamicCast_AsBP_PG_Player_State_Game_1' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_DynamicCast_bSuccess_4) == 0x0000C0, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_IsValid_ReturnValue_2) == 0x0000C1, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_IsValid_ReturnValue_3) == 0x0000C2, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_BooleanAND_ReturnValue) == 0x0000C3, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C4, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_GetWidget_ReturnValue) == 0x0000C8, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_DynamicCast_AsUI_Player_Marker) == 0x0000D0, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_DynamicCast_AsUI_Player_Marker' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_DynamicCast_bSuccess_5) == 0x0000D8, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000DC, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0000F0, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_GetWidget_ReturnValue_1) == 0x0000F8, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_GetWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_DynamicCast_AsUI_Player_Marker_1) == 0x000100, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_DynamicCast_AsUI_Player_Marker_1' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_DynamicCast_bSuccess_6) == 0x000108, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_CreateDelegate_OutputDelegate_3) == 0x00010C, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00011C, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x00011D, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x00011E, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_NotEqual_ByteByte_ReturnValue_3) == 0x00011F, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_NotEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_BooleanAND_ReturnValue_1) == 0x000120, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_BooleanAND_ReturnValue_2) == 0x000121, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_BooleanAND_ReturnValue_3) == 0x000122, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_GetLocalRole_ReturnValue) == 0x000123, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_GetLocalRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000124, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_GetPlayerController_ReturnValue_3) == 0x000128, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_CreateDelegate_OutputDelegate_4) == 0x000130, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_GetPlayerViewPoint_Location) == 0x000140, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_GetPlayerViewPoint_Location' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_GetPlayerViewPoint_Rotation) == 0x000158, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_GetPlayerViewPoint_Rotation' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000170, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, K2Node_CreateDelegate_OutputDelegate_5) == 0x000188, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000198, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_VSize_ReturnValue) == 0x0001B0, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0001B8, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_K2_GetComponentScale_ReturnValue) == 0x0001C0, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_BreakVector_X) == 0x0001D8, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_BreakVector_Y) == 0x0001E0, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_BreakVector_Z) == 0x0001E8, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_MakeVector_ReturnValue) == 0x0001F0, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_MakeVector_ReturnValue_1) == 0x000208, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000220, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_IsDedicatedServer_ReturnValue) == 0x000228, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_GetFOVAngle_ReturnValue) == 0x00022C, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_GetFOVAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_Not_PreBool_ReturnValue) == 0x000230, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000238, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_FMin_ReturnValue) == 0x000240, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000248, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_FMin_ReturnValue_1) == 0x000250, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000258, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_Add_VectorVector_ReturnValue) == 0x000270, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000288, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0002A0, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0002B8, "Member 'Task_Character_SetupByTeam_C_ExecuteUbergraph_Task_Character_SetupByTeam::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function Task_Character_SetupByTeam.Task_Character_SetupByTeam_C.SetMaterialsByTeam
// 0x0130 (0x0130 - 0x0000)
struct Task_Character_SetupByTeam_C_SetMaterialsByTeam final
{
public:
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E27[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_4;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_5;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E28[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_6;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_7;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETeam                                         Temp_byte_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E29[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_8;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_9;                            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E2A[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_10;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_11;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E2B[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_12;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_13;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E2C[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_14;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_15;                           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETeam                                         Temp_byte_Variable_1;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeam                                         Temp_byte_Variable_2;                              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeam                                         CallFunc_GetTeam_ReturnValue;                      // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeam                                         CallFunc_GetTeam_ReturnValue_1;                    // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E2D[0x2];                                     // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E2E[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E2F[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default_2;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETeam                                         Temp_byte_Variable_3;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue_1;               // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E30[0x5];                                     // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default_3;                           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_4;                           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_5;                           // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue_2;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeam                                         CallFunc_GetTeam_ReturnValue_2;                    // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E31[0x5];                                     // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default_6;                           // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_7;                           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_8;                           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETeam                                         CallFunc_GetTeam_ReturnValue_3;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E32[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default_9;                           // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Character_SetupByTeam_C_SetMaterialsByTeam) == 0x000008, "Wrong alignment on Task_Character_SetupByTeam_C_SetMaterialsByTeam");
static_assert(sizeof(Task_Character_SetupByTeam_C_SetMaterialsByTeam) == 0x000130, "Wrong size on Task_Character_SetupByTeam_C_SetMaterialsByTeam");
static_assert(offsetof(Task_Character_SetupByTeam_C_SetMaterialsByTeam, Temp_object_Variable) == 0x000000, "Member 'Task_Character_SetupByTeam_C_SetMaterialsByTeam::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Task_Character_SetupByTeam_C_SetMaterialsByTeam, Temp_object_Variable_1) == 0x000008, "Member 'Task_Character_SetupByTeam_C_SetMaterialsByTeam::Temp_object_Variable_1' has a wrong offset!");
