#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_Character_SetupByTeam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Actions_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Task_Character_SetupByTeam.Task_Character_SetupByTeam_C
// 0x0048 (0x00F0 - 0x00A8)
class UTask_Character_SetupByTeam_C final : public UAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_PG_Game_Character_C*                Character;                                         // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              CharacterPlayerState;                              // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              LocalPlayerState;                                  // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          IsFriendly;                                        // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E17[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Timer_VisibleMarkerByDistance;                     // 0x00D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CharacterDefaultWorldScale;                        // 0x00D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Task_Character_SetupByTeam(int32 EntryPoint);
	void OnIsMemberMySquad_Event();
	void OnSetPlayerState_Event();
	void OnSetPlayerStateLocal_Event();
	void OnSetTeam_Event();
	void ReceiveActivate();
	void ScaleCharacterByDistance();
	void SetMaterialsByTeam();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Task_Character_SetupByTeam_C">();
	}
	static class UTask_Character_SetupByTeam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTask_Character_SetupByTeam_C>();
	}
};
static_assert(alignof(UTask_Character_SetupByTeam_C) == 0x000008, "Wrong alignment on UTask_Character_SetupByTeam_C");
static_assert(sizeof(UTask_Character_SetupByTeam_C) == 0x0000F0, "Wrong size on UTask_Character_SetupByTeam_C");
static_assert(offsetof(UTask_Character_SetupByTeam_C, UberGraphFrame) == 0x0000A8, "Member 'UTask_Character_SetupByTeam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTask_Character_SetupByTeam_C, Character) == 0x0000B0, "Member 'UTask_Character_SetupByTeam_C::Character' has a wrong offset!");
static_assert(offsetof(UTask_Character_SetupByTeam_C, CharacterPlayerState) == 0x0000B8, "Member 'UTask_Character_SetupByTeam_C::CharacterPlayerState' has a wrong offset!");
static_assert(offsetof(UTask_Character_SetupByTeam_C, LocalPlayerState) == 0x0000C0, "Member 'UTask_Character_SetupByTeam_C::LocalPlayerState' has a wrong offset!");
static_assert(offsetof(UTask_Character_SetupByTeam_C, IsFriendly) == 0x0000C8, "Member 'UTask_Character_SetupByTeam_C::IsFriendly' has a wrong offset!");
static_assert(offsetof(UTask_Character_SetupByTeam_C, Timer_VisibleMarkerByDistance) == 0x0000D0, "Member 'UTask_Character_SetupByTeam_C::Timer_VisibleMarkerByDistance' has a wrong offset!");
static_assert(offsetof(UTask_Character_SetupByTeam_C, CharacterDefaultWorldScale) == 0x0000D8, "Member 'UTask_Character_SetupByTeam_C::CharacterDefaultWorldScale' has a wrong offset!");

}

