#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack

#include "Basic.hpp"

#include "Actions_structs.hpp"
#include "PlayFab_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack.Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C.ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack
// 0x04D0 (0x04D0 - 0x0000)
struct Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35CE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x0008(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_4;                   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35CF[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D0[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x0070(0x0040)()
	TDelegate<void(const struct FClientUpdateUserDataResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D1[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_MainMenu_Shop_Premium_Offers_StarterPack_C* CallFunc_Create_ReturnValue;                       // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D2[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D3[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabError                          K2Node_CustomEvent_error_1;                        // 0x00F8(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_3;                   // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientGetTimeResult                   K2Node_CustomEvent_result_1;                       // 0x0138(0x0018)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_DateTimeFromIsoString_Result;             // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DateTimeFromIsoString_ReturnValue;        // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D4[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D5[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_DateTimeFromIsoString_Result_1;           // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DateTimeFromIsoString_ReturnValue_1;      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D6[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetDuration_ReturnValue;                  // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_1;      // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_2;             // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D7[0x6];                                     // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_2;      // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_1;                   // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D8[0x1];                                     // 0x01FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_3;      // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue;          // 0x0208(0x0010)(ReferenceParm)
	class UPlayFabJsonObject*                     CallFunc_Array_Get_Item;                           // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_4;      // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_1;             // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D9[0x4];                                     // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_3;             // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_2;                   // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35DA[0x6];                                     // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_2;             // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0256(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35DB[0x1];                                     // 0x0257(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientUpdateUserDataResult            K2Node_CustomEvent_result;                         // 0x0258(0x0010)(NoDestructor)
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FClientGetTimeResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0270(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x0280(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue_1;        // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__Object;       // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientUpdateUserDataRequest           K2Node_MakeStruct_ClientUpdateUserDataRequest;     // 0x02E0(0x0030)()
	class FString                                 CallFunc_GetStringField_ReturnValue_3;             // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                      CallFunc_UpdateUserData_ReturnValue;               // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DecodeJson_ReturnValue;                   // 0x032A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35DC[0x5];                                     // 0x032B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      Temp_struct_Variable_1;                            // 0x0330(0x0040)()
	class UObject*                                Temp_object_Variable_1;                            // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EActionState                                  K2Node_Event_Reason;                               // 0x0378(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35DD[0x5];                                     // 0x037B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35DE[0x3];                                     // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0394(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35DF[0x4];                                     // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabClientAPI*                      CallFunc_GetTime_ReturnValue;                      // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35E0[0x7];                                     // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOwner_ReturnValue;                     // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTask_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C* CallFunc_CreateAction_ReturnValue;                 // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOwner_ReturnValue_1;                   // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTask_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C* CallFunc_CreateAction_ReturnValue_1;               // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOwner_ReturnValue_2;                   // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTask_MainMenu_Shop_Premium_Offers_GenerateBoosterBundle_C* CallFunc_CreateAction_ReturnValue_2;               // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response_1;                     // 0x03F0(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_5;                   // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful_1;                   // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35E1[0x7];                                     // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1; // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35E2[0x3];                                     // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0454(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35E3[0x4];                                     // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0468(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0478(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35E4[0x4];                                     // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0492(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35E5[0x1];                                     // 0x0493(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35E6[0x3];                                     // 0x0499(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35E7[0x7];                                     // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35E8[0x7];                                     // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack) == 0x000008, "Wrong alignment on Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack");
static_assert(sizeof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack) == 0x0004D0, "Wrong size on Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, EntryPoint) == 0x000000, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::EntryPoint' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_CustomEvent_response) == 0x000008, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_CustomEvent_customData_4) == 0x000048, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_CustomEvent_customData_4' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_CustomEvent_successful) == 0x000050, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, Temp_bool_Variable) == 0x000064, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, Temp_object_Variable) == 0x000068, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, Temp_struct_Variable) == 0x000070, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000C0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_Create_ReturnValue) == 0x0000D8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, Temp_int_Loop_Counter_Variable) == 0x0000E0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_Add_IntInt_ReturnValue) == 0x0000E4, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, Temp_bool_True_if_break_was_hit_Variable) == 0x0000E8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, Temp_int_Array_Index_Variable) == 0x0000EC, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_Not_PreBool_ReturnValue) == 0x0000F0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_CustomEvent_error_1) == 0x0000F8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_CustomEvent_error_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_CustomEvent_customData_3) == 0x000130, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_CustomEvent_customData_3' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_CustomEvent_result_1) == 0x000138, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_CustomEvent_result_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_CustomEvent_customData_2) == 0x000150, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_CustomEvent_customData_2' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000158, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetObjectField_ReturnValue) == 0x000160, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_DateTimeFromIsoString_Result) == 0x000168, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_DateTimeFromIsoString_Result' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_DateTimeFromIsoString_ReturnValue) == 0x000170, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_DateTimeFromIsoString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetObjectField_ReturnValue_1) == 0x000178, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, Temp_int_Array_Index_Variable_1) == 0x000180, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetStringField_ReturnValue) == 0x000188, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_DateTimeFromIsoString_Result_1) == 0x000198, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_DateTimeFromIsoString_Result_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_DateTimeFromIsoString_ReturnValue_1) == 0x0001A0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_DateTimeFromIsoString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetStringField_ReturnValue_1) == 0x0001A8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x0001B8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetDuration_ReturnValue) == 0x0001C0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetTotalSeconds_ReturnValue) == 0x0001C8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_FTrunc_ReturnValue) == 0x0001CC, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001D0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_Clamp_ReturnValue) == 0x0001D4, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetPlayerCombinedInfo_ReturnValue_1) == 0x0001D8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetPlayerCombinedInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetObjectField_ReturnValue_2) == 0x0001E0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetObjectField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_HasField_ReturnValue) == 0x0001E8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_HasField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001E9, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetPlayerCombinedInfo_ReturnValue_2) == 0x0001F0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetPlayerCombinedInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetNumberField_ReturnValue) == 0x0001F8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_HasField_ReturnValue_1) == 0x0001FC, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_HasField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0001FD, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_BooleanOR_ReturnValue) == 0x0001FE, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetPlayerCombinedInfo_ReturnValue_3) == 0x000200, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetPlayerCombinedInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetObjectArrayField_ReturnValue) == 0x000208, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetObjectArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_Array_Get_Item) == 0x000218, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetPlayerCombinedInfo_ReturnValue_4) == 0x000220, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetPlayerCombinedInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetNumberField_ReturnValue_1) == 0x000228, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetNumberField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetObjectField_ReturnValue_3) == 0x000230, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetObjectField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000238, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_HasField_ReturnValue_2) == 0x000239, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_HasField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetStringField_ReturnValue_2) == 0x000240, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetStringField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_Array_Length_ReturnValue) == 0x000250, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000254, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000255, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_Not_PreBool_ReturnValue_2) == 0x000256, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_CustomEvent_result) == 0x000258, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_CustomEvent_result' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_CustomEvent_customData_1) == 0x000268, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_CustomEvent_customData_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_CreateDelegate_OutputDelegate_3) == 0x000270, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_CustomEvent_error) == 0x000280, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_CustomEvent_error' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_CustomEvent_customData) == 0x0002B8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_CustomEvent_customData' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_ConstructJsonObject_ReturnValue) == 0x0002C0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_ConstructJsonObject_ReturnValue_1) == 0x0002C8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_ConstructJsonObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_LowEntry_LocalVariable_Value__Object) == 0x0002D0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_LowEntry_LocalVariable_Value__1_Object) == 0x0002D8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_LowEntry_LocalVariable_Value__1_Object' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_MakeStruct_ClientUpdateUserDataRequest) == 0x0002E0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_MakeStruct_ClientUpdateUserDataRequest' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetStringField_ReturnValue_3) == 0x000310, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetStringField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_UpdateUserData_ReturnValue) == 0x000320, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_UpdateUserData_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000328, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_IsValid_ReturnValue) == 0x000329, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_DecodeJson_ReturnValue) == 0x00032A, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_DecodeJson_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, Temp_struct_Variable_1) == 0x000330, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, Temp_object_Variable_1) == 0x000370, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_Event_Reason) == 0x000378, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, Temp_bool_Variable_1) == 0x000379, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00037A, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetPlayerController_ReturnValue) == 0x000380, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000388, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_DynamicCast_bSuccess) == 0x000390, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, K2Node_CreateDelegate_OutputDelegate_4) == 0x000394, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_GetTime_ReturnValue) == 0x0003A8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_GetTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_IsValid_ReturnValue_1) == 0x0003B0, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack, CallFunc_AddChildToWrapBox_ReturnValue) == 0x0003B8, "Member 'Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C_ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack::CallFunc_AddChildToWrapBox_ReturnValue' has a wrong offset!");
