#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_Menu_CameraSetFOV

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Actions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Task_Menu_CameraSetFOV.Task_Menu_CameraSetFOV_C
// 0x0020 (0x00C8 - 0x00A8)
class UTask_Menu_CameraSetFOV_C final : public UAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       Camera_Component;                                  // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        TargetFOV;                                         // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        InterpSpeed;                                       // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Task_Menu_CameraSetFOV(int32 EntryPoint);
	void ReceiveActivate();
	void ReceiveTick(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Task_Menu_CameraSetFOV_C">();
	}
	static class UTask_Menu_CameraSetFOV_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTask_Menu_CameraSetFOV_C>();
	}
};
static_assert(alignof(UTask_Menu_CameraSetFOV_C) == 0x000008, "Wrong alignment on UTask_Menu_CameraSetFOV_C");
static_assert(sizeof(UTask_Menu_CameraSetFOV_C) == 0x0000C8, "Wrong size on UTask_Menu_CameraSetFOV_C");
static_assert(offsetof(UTask_Menu_CameraSetFOV_C, UberGraphFrame) == 0x0000A8, "Member 'UTask_Menu_CameraSetFOV_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTask_Menu_CameraSetFOV_C, Camera_Component) == 0x0000B0, "Member 'UTask_Menu_CameraSetFOV_C::Camera_Component' has a wrong offset!");
static_assert(offsetof(UTask_Menu_CameraSetFOV_C, TargetFOV) == 0x0000B8, "Member 'UTask_Menu_CameraSetFOV_C::TargetFOV' has a wrong offset!");
static_assert(offsetof(UTask_Menu_CameraSetFOV_C, InterpSpeed) == 0x0000C0, "Member 'UTask_Menu_CameraSetFOV_C::InterpSpeed' has a wrong offset!");

}

