#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_Multiplayer_RequestReserveSlots

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Actions_structs.hpp"
#include "Actions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Task_Multiplayer_RequestReserveSlots.Task_Multiplayer_RequestReserveSlots_C
// 0x0058 (0x0100 - 0x00A8)
class UTask_Multiplayer_RequestReserveSlots_C final : public UAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 IP;                                                // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         BeaconPort;                                        // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsUseMatchmaker;                                   // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3448[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerController_Menu_C*         PlayerController;                                  // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<struct FUniqueNetIdRepl>               UserIds;                                           // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUI_Multiplayer_Queue_C*                UI_Queue;                                          // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFinished;                                        // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	uint8                                         ErrorCode;                                         // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Task_Multiplayer_RequestReserveSlots(int32 EntryPoint);
	void OnClickLeave_Event();
	void OnConnectionStateChange_Event(bool bWasSuccessful);
	void OnFinished__DelegateSignature(bool IsSuccessful, uint8 Param_ErrorCode);
	void OnPutInQueue_Event(uint8 Number);
	void OnResponseReserveSlot_Event(uint8 Payload);
	void ReceiveActivate();
	void ReceiveFinished(const EActionState Reason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Task_Multiplayer_RequestReserveSlots_C">();
	}
	static class UTask_Multiplayer_RequestReserveSlots_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTask_Multiplayer_RequestReserveSlots_C>();
	}
};
static_assert(alignof(UTask_Multiplayer_RequestReserveSlots_C) == 0x000008, "Wrong alignment on UTask_Multiplayer_RequestReserveSlots_C");
static_assert(sizeof(UTask_Multiplayer_RequestReserveSlots_C) == 0x000100, "Wrong size on UTask_Multiplayer_RequestReserveSlots_C");
static_assert(offsetof(UTask_Multiplayer_RequestReserveSlots_C, UberGraphFrame) == 0x0000A8, "Member 'UTask_Multiplayer_RequestReserveSlots_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTask_Multiplayer_RequestReserveSlots_C, IP) == 0x0000B0, "Member 'UTask_Multiplayer_RequestReserveSlots_C::IP' has a wrong offset!");
static_assert(offsetof(UTask_Multiplayer_RequestReserveSlots_C, BeaconPort) == 0x0000C0, "Member 'UTask_Multiplayer_RequestReserveSlots_C::BeaconPort' has a wrong offset!");
static_assert(offsetof(UTask_Multiplayer_RequestReserveSlots_C, IsUseMatchmaker) == 0x0000C4, "Member 'UTask_Multiplayer_RequestReserveSlots_C::IsUseMatchmaker' has a wrong offset!");
static_assert(offsetof(UTask_Multiplayer_RequestReserveSlots_C, PlayerController) == 0x0000C8, "Member 'UTask_Multiplayer_RequestReserveSlots_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UTask_Multiplayer_RequestReserveSlots_C, UserIds) == 0x0000D0, "Member 'UTask_Multiplayer_RequestReserveSlots_C::UserIds' has a wrong offset!");
static_assert(offsetof(UTask_Multiplayer_RequestReserveSlots_C, UI_Queue) == 0x0000E0, "Member 'UTask_Multiplayer_RequestReserveSlots_C::UI_Queue' has a wrong offset!");
static_assert(offsetof(UTask_Multiplayer_RequestReserveSlots_C, OnFinished) == 0x0000E8, "Member 'UTask_Multiplayer_RequestReserveSlots_C::OnFinished' has a wrong offset!");
static_assert(offsetof(UTask_Multiplayer_RequestReserveSlots_C, ErrorCode) == 0x0000F8, "Member 'UTask_Multiplayer_RequestReserveSlots_C::ErrorCode' has a wrong offset!");

}

