#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Actions_structs.hpp"
#include "Actions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack.Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C
// 0x0020 (0x00C8 - 0x00A8)
class UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C final : public UAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APG_PlayerState_Menu*                   PlayerState;                                       // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         TimeToCloseOffer;                                  // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanContinue;                                       // 0x00BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35CD[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerController_Menu_C*         PlayerController;                                  // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack(int32 EntryPoint);
	void GetServerTime_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void GetServerTime_Success(const struct FClientGetTimeResult& Result, class UObject* CustomData);
	void OnPlayFabResponse_9BE38AD1458C3F3FCDB0EC89AA2FE699(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void OnPlayFabResponse_A8F1BBA44DF301669E4FCE91FD3F3DA7(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void ReceiveActivate();
	void ReceiveFinished(const EActionState Reason);
	void StartOfferTimer_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void StartOfferTimer_Success(const struct FClientUpdateUserDataResult& Result, class UObject* CustomData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Task_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C">();
	}
	static class UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C>();
	}
};
static_assert(alignof(UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C) == 0x000008, "Wrong alignment on UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C");
static_assert(sizeof(UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C) == 0x0000C8, "Wrong size on UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C");
static_assert(offsetof(UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C, UberGraphFrame) == 0x0000A8, "Member 'UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C, PlayerState) == 0x0000B0, "Member 'UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C::PlayerState' has a wrong offset!");
static_assert(offsetof(UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C, TimeToCloseOffer) == 0x0000B8, "Member 'UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C::TimeToCloseOffer' has a wrong offset!");
static_assert(offsetof(UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C, CanContinue) == 0x0000BC, "Member 'UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C::CanContinue' has a wrong offset!");
static_assert(offsetof(UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C, PlayerController) == 0x0000C0, "Member 'UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C::PlayerController' has a wrong offset!");

}

