#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_DevepolerLogin

#include "Basic.hpp"

#include "PlayFab_structs.hpp"
#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function Task_DevepolerLogin.Task_DevepolerLogin_C.ConstructRequestPlayerCombinedInfo
// 0x0028 (0x0028 - 0x0000)
struct Task_DevepolerLogin_C_ConstructRequestPlayerCombinedInfo final
{
public:
	class UPlayFabJsonObject*                     Request;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     L_Request;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_DevepolerLogin_C_ConstructRequestPlayerCombinedInfo) == 0x000008, "Wrong alignment on Task_DevepolerLogin_C_ConstructRequestPlayerCombinedInfo");
static_assert(sizeof(Task_DevepolerLogin_C_ConstructRequestPlayerCombinedInfo) == 0x000028, "Wrong size on Task_DevepolerLogin_C_ConstructRequestPlayerCombinedInfo");
static_assert(offsetof(Task_DevepolerLogin_C_ConstructRequestPlayerCombinedInfo, Request) == 0x000000, "Member 'Task_DevepolerLogin_C_ConstructRequestPlayerCombinedInfo::Request' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ConstructRequestPlayerCombinedInfo, L_Request) == 0x000008, "Member 'Task_DevepolerLogin_C_ConstructRequestPlayerCombinedInfo::L_Request' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ConstructRequestPlayerCombinedInfo, CallFunc_ConstructJsonObject_ReturnValue) == 0x000010, "Member 'Task_DevepolerLogin_C_ConstructRequestPlayerCombinedInfo::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ConstructRequestPlayerCombinedInfo, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000018, "Member 'Task_DevepolerLogin_C_ConstructRequestPlayerCombinedInfo::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ConstructRequestPlayerCombinedInfo, CallFunc_ConstructJsonObject_ReturnValue_1) == 0x000020, "Member 'Task_DevepolerLogin_C_ConstructRequestPlayerCombinedInfo::CallFunc_ConstructJsonObject_ReturnValue_1' has a wrong offset!");

// Function Task_DevepolerLogin.Task_DevepolerLogin_C.ExecuteUbergraph_Task_DevepolerLogin
// 0x0358 (0x0358 - 0x0000)
struct Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DDC[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x0010(0x0040)()
	TDelegate<void(const struct FClientLoginResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x0070(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_3;                   // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DDD[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DDE[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable_1;                            // 0x00D8(0x0040)()
	TDelegate<void(const struct FClientGetPlayerCombinedInfoResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WithEditor_ReturnValue;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DDF[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_ConstructRequestPlayerCombinedInfo_Request; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientLoginWithCustomIDRequest        K2Node_MakeStruct_ClientLoginWithCustomIDRequest;  // 0x0138(0x0050)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                      CallFunc_LoginWithCustomID_ReturnValue;            // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Base*                   K2Node_DynamicCast_AsPG_Player_State_Base;         // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DE0[0x6];                                     // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x01A8(0x0010)(ConstParm, ReferenceParm)
	struct FClientLoginResult                     K2Node_CustomEvent_result_1;                       // 0x01B8(0x0068)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DE1[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x0230(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_ConstructRequestPlayerCombinedInfo_Request_1; // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response_1;                     // 0x0278(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_4;                   // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful_1;                   // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DE2[0x7];                                     // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientGetPlayerCombinedInfoRequest    K2Node_MakeStruct_ClientGetPlayerCombinedInfoRequest; // 0x02C8(0x0028)()
	struct FClientGetPlayerCombinedInfoResult     K2Node_CustomEvent_result;                         // 0x02F0(0x0020)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0318(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0328(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                      CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_MakeArray_Array_1;                          // 0x0340(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin) == 0x000008, "Wrong alignment on Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin");
static_assert(sizeof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin) == 0x000358, "Wrong size on Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, EntryPoint) == 0x000000, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::EntryPoint' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, Temp_bool_Variable) == 0x000004, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, Temp_object_Variable) == 0x000008, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, Temp_struct_Variable) == 0x000010, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CustomEvent_response) == 0x000070, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CustomEvent_customData_3) == 0x0000B0, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CustomEvent_customData_3' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CustomEvent_successful) == 0x0000B8, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000BC, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, Temp_bool_Variable_1) == 0x0000CC, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, Temp_object_Variable_1) == 0x0000D0, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, Temp_struct_Variable_1) == 0x0000D8, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CreateDelegate_OutputDelegate_3) == 0x000118, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, CallFunc_WithEditor_ReturnValue) == 0x000128, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::CallFunc_WithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, CallFunc_ConstructRequestPlayerCombinedInfo_Request) == 0x000130, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::CallFunc_ConstructRequestPlayerCombinedInfo_Request' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_MakeStruct_ClientLoginWithCustomIDRequest) == 0x000138, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_MakeStruct_ClientLoginWithCustomIDRequest' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, CallFunc_GetPlayerController_ReturnValue) == 0x000188, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, CallFunc_LoginWithCustomID_ReturnValue) == 0x000190, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::CallFunc_LoginWithCustomID_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_DynamicCast_AsPG_Player_State_Base) == 0x000198, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_DynamicCast_AsPG_Player_State_Base' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, CallFunc_IsValid_ReturnValue) == 0x0001A1, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_MakeArray_Array) == 0x0001A8, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CustomEvent_result_1) == 0x0001B8, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CustomEvent_result_1' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CustomEvent_customData_2) == 0x000220, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CustomEvent_customData_2' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, CallFunc_HasField_ReturnValue) == 0x000228, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::CallFunc_HasField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CustomEvent_error) == 0x000230, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CustomEvent_error' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CustomEvent_customData_1) == 0x000268, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CustomEvent_customData_1' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, CallFunc_ConstructRequestPlayerCombinedInfo_Request_1) == 0x000270, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::CallFunc_ConstructRequestPlayerCombinedInfo_Request_1' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CustomEvent_response_1) == 0x000278, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CustomEvent_response_1' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CustomEvent_customData_4) == 0x0002B8, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CustomEvent_customData_4' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CustomEvent_successful_1) == 0x0002C0, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CustomEvent_successful_1' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_MakeStruct_ClientGetPlayerCombinedInfoRequest) == 0x0002C8, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_MakeStruct_ClientGetPlayerCombinedInfoRequest' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CustomEvent_result) == 0x0002F0, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CustomEvent_result' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CustomEvent_customData) == 0x000310, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CustomEvent_customData' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CreateDelegate_OutputDelegate_4) == 0x000318, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_CreateDelegate_OutputDelegate_5) == 0x000328, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000338, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, K2Node_MakeArray_Array_1) == 0x000340, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin, CallFunc_IsValid_ReturnValue_1) == 0x000350, "Member 'Task_DevepolerLogin_C_ExecuteUbergraph_Task_DevepolerLogin::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function Task_DevepolerLogin.Task_DevepolerLogin_C.GetPlayerCombinedInfo_Success
// 0x0028 (0x0028 - 0x0000)
struct Task_DevepolerLogin_C_GetPlayerCombinedInfo_Success final
{
public:
	struct FClientGetPlayerCombinedInfoResult     Result;                                            // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_DevepolerLogin_C_GetPlayerCombinedInfo_Success) == 0x000008, "Wrong alignment on Task_DevepolerLogin_C_GetPlayerCombinedInfo_Success");
static_assert(sizeof(Task_DevepolerLogin_C_GetPlayerCombinedInfo_Success) == 0x000028, "Wrong size on Task_DevepolerLogin_C_GetPlayerCombinedInfo_Success");
static_assert(offsetof(Task_DevepolerLogin_C_GetPlayerCombinedInfo_Success, Result) == 0x000000, "Member 'Task_DevepolerLogin_C_GetPlayerCombinedInfo_Success::Result' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_GetPlayerCombinedInfo_Success, CustomData) == 0x000020, "Member 'Task_DevepolerLogin_C_GetPlayerCombinedInfo_Success::CustomData' has a wrong offset!");

// Function Task_DevepolerLogin.Task_DevepolerLogin_C.Login_Failure
// 0x0040 (0x0040 - 0x0000)
struct Task_DevepolerLogin_C_Login_Failure final
{
public:
	struct FPlayFabError                          Error;                                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_DevepolerLogin_C_Login_Failure) == 0x000008, "Wrong alignment on Task_DevepolerLogin_C_Login_Failure");
static_assert(sizeof(Task_DevepolerLogin_C_Login_Failure) == 0x000040, "Wrong size on Task_DevepolerLogin_C_Login_Failure");
static_assert(offsetof(Task_DevepolerLogin_C_Login_Failure, Error) == 0x000000, "Member 'Task_DevepolerLogin_C_Login_Failure::Error' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_Login_Failure, CustomData) == 0x000038, "Member 'Task_DevepolerLogin_C_Login_Failure::CustomData' has a wrong offset!");

// Function Task_DevepolerLogin.Task_DevepolerLogin_C.Login_Success
// 0x0070 (0x0070 - 0x0000)
struct Task_DevepolerLogin_C_Login_Success final
{
public:
	struct FClientLoginResult                     Result;                                            // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_DevepolerLogin_C_Login_Success) == 0x000008, "Wrong alignment on Task_DevepolerLogin_C_Login_Success");
static_assert(sizeof(Task_DevepolerLogin_C_Login_Success) == 0x000070, "Wrong size on Task_DevepolerLogin_C_Login_Success");
static_assert(offsetof(Task_DevepolerLogin_C_Login_Success, Result) == 0x000000, "Member 'Task_DevepolerLogin_C_Login_Success::Result' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_Login_Success, CustomData) == 0x000068, "Member 'Task_DevepolerLogin_C_Login_Success::CustomData' has a wrong offset!");

// Function Task_DevepolerLogin.Task_DevepolerLogin_C.OnFailure__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct Task_DevepolerLogin_C_OnFailure__DelegateSignature final
{
public:
	struct FPlayFabError                          Error;                                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Task_DevepolerLogin_C_OnFailure__DelegateSignature) == 0x000008, "Wrong alignment on Task_DevepolerLogin_C_OnFailure__DelegateSignature");
static_assert(sizeof(Task_DevepolerLogin_C_OnFailure__DelegateSignature) == 0x000038, "Wrong size on Task_DevepolerLogin_C_OnFailure__DelegateSignature");
static_assert(offsetof(Task_DevepolerLogin_C_OnFailure__DelegateSignature, Error) == 0x000000, "Member 'Task_DevepolerLogin_C_OnFailure__DelegateSignature::Error' has a wrong offset!");

// Function Task_DevepolerLogin.Task_DevepolerLogin_C.OnPlayFabResponse_57D036694E81E3042DF61EA9CBCE87C6
// 0x0050 (0x0050 - 0x0000)
struct Task_DevepolerLogin_C_OnPlayFabResponse_57D036694E81E3042DF61EA9CBCE87C6 final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_DevepolerLogin_C_OnPlayFabResponse_57D036694E81E3042DF61EA9CBCE87C6) == 0x000008, "Wrong alignment on Task_DevepolerLogin_C_OnPlayFabResponse_57D036694E81E3042DF61EA9CBCE87C6");
static_assert(sizeof(Task_DevepolerLogin_C_OnPlayFabResponse_57D036694E81E3042DF61EA9CBCE87C6) == 0x000050, "Wrong size on Task_DevepolerLogin_C_OnPlayFabResponse_57D036694E81E3042DF61EA9CBCE87C6");
static_assert(offsetof(Task_DevepolerLogin_C_OnPlayFabResponse_57D036694E81E3042DF61EA9CBCE87C6, Response) == 0x000000, "Member 'Task_DevepolerLogin_C_OnPlayFabResponse_57D036694E81E3042DF61EA9CBCE87C6::Response' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_OnPlayFabResponse_57D036694E81E3042DF61EA9CBCE87C6, CustomData) == 0x000040, "Member 'Task_DevepolerLogin_C_OnPlayFabResponse_57D036694E81E3042DF61EA9CBCE87C6::CustomData' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_OnPlayFabResponse_57D036694E81E3042DF61EA9CBCE87C6, Successful) == 0x000048, "Member 'Task_DevepolerLogin_C_OnPlayFabResponse_57D036694E81E3042DF61EA9CBCE87C6::Successful' has a wrong offset!");

// Function Task_DevepolerLogin.Task_DevepolerLogin_C.OnPlayFabResponse_763BB15148AF2429F3E103B2AA4E64DC
// 0x0050 (0x0050 - 0x0000)
struct Task_DevepolerLogin_C_OnPlayFabResponse_763BB15148AF2429F3E103B2AA4E64DC final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_DevepolerLogin_C_OnPlayFabResponse_763BB15148AF2429F3E103B2AA4E64DC) == 0x000008, "Wrong alignment on Task_DevepolerLogin_C_OnPlayFabResponse_763BB15148AF2429F3E103B2AA4E64DC");
static_assert(sizeof(Task_DevepolerLogin_C_OnPlayFabResponse_763BB15148AF2429F3E103B2AA4E64DC) == 0x000050, "Wrong size on Task_DevepolerLogin_C_OnPlayFabResponse_763BB15148AF2429F3E103B2AA4E64DC");
static_assert(offsetof(Task_DevepolerLogin_C_OnPlayFabResponse_763BB15148AF2429F3E103B2AA4E64DC, Response) == 0x000000, "Member 'Task_DevepolerLogin_C_OnPlayFabResponse_763BB15148AF2429F3E103B2AA4E64DC::Response' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_OnPlayFabResponse_763BB15148AF2429F3E103B2AA4E64DC, CustomData) == 0x000040, "Member 'Task_DevepolerLogin_C_OnPlayFabResponse_763BB15148AF2429F3E103B2AA4E64DC::CustomData' has a wrong offset!");
static_assert(offsetof(Task_DevepolerLogin_C_OnPlayFabResponse_763BB15148AF2429F3E103B2AA4E64DC, Successful) == 0x000048, "Member 'Task_DevepolerLogin_C_OnPlayFabResponse_763BB15148AF2429F3E103B2AA4E64DC::Successful' has a wrong offset!");

}

