#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_Multiplayer_RequestServer

#include "Basic.hpp"

#include "PingQoS_structs.hpp"
#include "Actions_structs.hpp"
#include "PlayFab_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Task_Multiplayer_RequestServer.Task_Multiplayer_RequestServer_C.CheckForErrors
// 0x00B8 (0x00B8 - 0x0000)
struct Task_Multiplayer_RequestServer_C_CheckForErrors final
{
public:
	TArray<class UPlayFabJsonObject*>             Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          HasError;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34B9[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34BA[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34BB[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0078(0x0018)()
	bool                                          CallFunc_HasField_ReturnValue_1;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_2;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34BC[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_2;             // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34BD[0x2];                                     // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Multiplayer_RequestServer_C_CheckForErrors) == 0x000008, "Wrong alignment on Task_Multiplayer_RequestServer_C_CheckForErrors");
static_assert(sizeof(Task_Multiplayer_RequestServer_C_CheckForErrors) == 0x0000B8, "Wrong size on Task_Multiplayer_RequestServer_C_CheckForErrors");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, Array) == 0x000000, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::Array' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, HasError) == 0x000010, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::HasError' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, Temp_int_Array_Index_Variable) == 0x000014, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, CallFunc_Array_Get_Item) == 0x000020, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, CallFunc_GetObjectField_ReturnValue) == 0x000028, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, CallFunc_HasField_ReturnValue) == 0x000030, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::CallFunc_HasField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, CallFunc_GetObjectField_ReturnValue_1) == 0x000038, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, CallFunc_GetStringField_ReturnValue) == 0x000040, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, CallFunc_GetStringField_ReturnValue_1) == 0x000050, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000078, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, CallFunc_HasField_ReturnValue_1) == 0x000090, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::CallFunc_HasField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, CallFunc_HasField_ReturnValue_2) == 0x000091, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::CallFunc_HasField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, CallFunc_GetStringField_ReturnValue_2) == 0x000098, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::CallFunc_GetStringField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, Temp_int_Loop_Counter_Variable) == 0x0000A8, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000AC, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, CallFunc_Less_IntInt_ReturnValue) == 0x0000AD, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_CheckForErrors, CallFunc_Add_IntInt_ReturnValue) == 0x0000B0, "Member 'Task_Multiplayer_RequestServer_C_CheckForErrors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function Task_Multiplayer_RequestServer.Task_Multiplayer_RequestServer_C.ConstructRequest
// 0x00D8 (0x00D8 - 0x0000)
struct Task_Multiplayer_RequestServer_C_ConstructRequest final
{
public:
	class UPlayFabJsonObject*                     Value_;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     L_SessionCookie;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         L_RegionList;                                      // 0x0010(0x0010)(Edit, BlueprintVisible)
	class UPlayFabJsonObject*                     L_Result;                                          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34BE[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34BF[0x5];                                     // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_EncodeJson_ReturnValue;                   // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPingQoSSubsystem*                      CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBuildNumber_ReturnValue;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C0[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPingQoSInfo                           CallFunc_Array_Get_Item;                           // 0x0070(0x0040)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C1[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue_1;        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast;       // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast_1;     // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Multiplayer_RequestServer_C_ConstructRequest) == 0x000008, "Wrong alignment on Task_Multiplayer_RequestServer_C_ConstructRequest");
static_assert(sizeof(Task_Multiplayer_RequestServer_C_ConstructRequest) == 0x0000D8, "Wrong size on Task_Multiplayer_RequestServer_C_ConstructRequest");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, Value_) == 0x000000, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::Value_' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, L_SessionCookie) == 0x000008, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::L_SessionCookie' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, L_RegionList) == 0x000010, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::L_RegionList' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, L_Result) == 0x000020, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::L_Result' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, Temp_int_Array_Index_Variable) == 0x000028, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_IsEmpty_ReturnValue) == 0x000034, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_IsEmpty_ReturnValue_1) == 0x000041, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_Not_PreBool_ReturnValue_1) == 0x000042, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_EncodeJson_ReturnValue) == 0x000048, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_EncodeJson_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_ConstructJsonObject_ReturnValue) == 0x000058, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000060, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_GetBuildNumber_ReturnValue) == 0x000068, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_GetBuildNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_Array_Get_Item) == 0x000070, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000B0, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_Array_Add_ReturnValue) == 0x0000BC, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_Less_IntInt_ReturnValue) == 0x0000C0, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_ConstructJsonObject_ReturnValue_1) == 0x0000C8, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_ConstructJsonObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_SetNumberField_Number_ImplicitCast) == 0x0000D0, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_SetNumberField_Number_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ConstructRequest, CallFunc_SetNumberField_Number_ImplicitCast_1) == 0x0000D4, "Member 'Task_Multiplayer_RequestServer_C_ConstructRequest::CallFunc_SetNumberField_Number_ImplicitCast_1' has a wrong offset!");

// Function Task_Multiplayer_RequestServer.Task_Multiplayer_RequestServer_C.ExecuteUbergraph_Task_Multiplayer_RequestServer
// 0x03D0 (0x03D0 - 0x0000)
struct Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EActionState                                  Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTask_Multiplayer_ConnectToServer_C*    CallFunc_CreateAction_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsSuccessful)>            K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0048(0x0018)()
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0078(0x0018)()
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x0090(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result;                         // 0x00D0(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0138(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0150(0x0018)()
	bool                                          CallFunc_CheckForErrors_HasError;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C2[0x6];                                     // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0170(0x0018)()
	class UPlayFabJsonObject*                     CallFunc_ConstructRequest_Value_;                  // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptRequest       K2Node_MakeStruct_ClientExecuteCloudScriptRequest; // 0x0198(0x0030)()
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EActionState                                  K2Node_Event_Reason;                               // 0x01D1(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x01D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C3[0x4];                                     // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x01E8(0x0018)()
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsSuccessful;                   // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C4[0x7];                                     // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_1;             // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x0238(0x0040)()
	class UObject*                                Temp_object_Variable;                              // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetControllerUniqueNetId_ReturnValue;     // 0x0280(0x0030)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C5[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x02B8(0x0018)()
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x02D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                      CallFunc_ExecuteCloudScript_ReturnValue;           // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMemberLeader_ReturnValue;               // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C6[0x4];                                     // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x02F0(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C7[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetControllerUniqueNetId_ReturnValue_1;   // 0x0340(0x0030)(HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C8[0x4];                                     // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0378(0x0018)()
	TArray<class UBlueprintPartyMember*>          CallFunc_GetPartyMembers_OutPartyMembersArray;     // 0x0390(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetPartyMembers_ReturnValue;              // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C9[0x3];                                     // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x03A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34CA[0x6];                                     // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_1;                  // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer) == 0x000008, "Wrong alignment on Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer");
static_assert(sizeof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer) == 0x0003D0, "Wrong size on Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, EntryPoint) == 0x000000, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::EntryPoint' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, Temp_byte_Variable) == 0x000014, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, Temp_bool_Variable) == 0x000015, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, Temp_bool_Variable_1) == 0x000016, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, Temp_bool_Variable_2) == 0x000017, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_CreateAction_ReturnValue) == 0x000018, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_CreateAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_MakeArray_Array) == 0x000038, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_Format_ReturnValue) == 0x000048, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000060, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_MakeArray_Array_1) == 0x000068, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_Format_ReturnValue_1) == 0x000078, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_CustomEvent_error) == 0x000090, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_CustomEvent_error' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_CustomEvent_customData_1) == 0x0000C8, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_CustomEvent_customData_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_CustomEvent_result) == 0x0000D0, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_CustomEvent_result' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_CustomEvent_customData) == 0x000130, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_CustomEvent_customData' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_Conv_StringToText_ReturnValue) == 0x000138, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000150, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_CheckForErrors_HasError) == 0x000168, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_CheckForErrors_HasError' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_Not_PreBool_ReturnValue) == 0x000169, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_MakeLiteralText_ReturnValue) == 0x000170, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_ConstructRequest_Value_) == 0x000188, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_ConstructRequest_Value_' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_GetPlayerController_ReturnValue) == 0x000190, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_MakeStruct_ClientExecuteCloudScriptRequest) == 0x000198, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_MakeStruct_ClientExecuteCloudScriptRequest' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x0001C8, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_DynamicCast_bSuccess) == 0x0001D0, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_Event_Reason) == 0x0001D1, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_Select_Default) == 0x0001D2, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_GetBoolField_ReturnValue) == 0x0001D3, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_GetBoolField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_GetStringField_ReturnValue) == 0x0001D8, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0001E8, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_GetObjectField_ReturnValue) == 0x000200, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000208, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_CustomEvent_IsSuccessful) == 0x000210, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_CustomEvent_IsSuccessful' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_GetStringField_ReturnValue_1) == 0x000218, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_GetNumberField_ReturnValue) == 0x000228, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_GetNumberField_ReturnValue_1) == 0x00022C, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_GetNumberField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_FTrunc_ReturnValue) == 0x000230, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_FTrunc_ReturnValue_1) == 0x000234, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, Temp_struct_Variable) == 0x000238, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, Temp_object_Variable) == 0x000278, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_GetControllerUniqueNetId_ReturnValue) == 0x000280, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_GetControllerUniqueNetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, Temp_bool_Variable_3) == 0x0002B0, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0002B8, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002D0, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_ExecuteCloudScript_ReturnValue) == 0x0002E0, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_ExecuteCloudScript_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_IsValid_ReturnValue) == 0x0002E8, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_IsMemberLeader_ReturnValue) == 0x0002E9, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_IsMemberLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_IsValid_ReturnValue_1) == 0x0002EA, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_IsValid_ReturnValue_2) == 0x0002EB, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_CustomEvent_response) == 0x0002F0, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_CustomEvent_customData_2) == 0x000330, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_CustomEvent_customData_2' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_CustomEvent_successful) == 0x000338, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_GetControllerUniqueNetId_ReturnValue_1) == 0x000340, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_GetControllerUniqueNetId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_Divide_IntInt_ReturnValue) == 0x000370, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000378, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_GetPartyMembers_OutPartyMembersArray) == 0x000390, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_GetPartyMembers_OutPartyMembersArray' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_GetPartyMembers_ReturnValue) == 0x0003A0, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_GetPartyMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, K2Node_CreateDelegate_OutputDelegate_3) == 0x0003A4, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_Array_Length_ReturnValue) == 0x0003B4, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0003B8, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_Greater_IntInt_ReturnValue) == 0x0003B9, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_FTrunc_A_ImplicitCast) == 0x0003C0, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer, CallFunc_FTrunc_A_ImplicitCast_1) == 0x0003C8, "Member 'Task_Multiplayer_RequestServer_C_ExecuteUbergraph_Task_Multiplayer_RequestServer::CallFunc_FTrunc_A_ImplicitCast_1' has a wrong offset!");

// Function Task_Multiplayer_RequestServer.Task_Multiplayer_RequestServer_C.OnConnectionFinished_Event
// 0x0001 (0x0001 - 0x0000)
struct Task_Multiplayer_RequestServer_C_OnConnectionFinished_Event final
{
public:
	bool                                          IsSuccessful;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Multiplayer_RequestServer_C_OnConnectionFinished_Event) == 0x000001, "Wrong alignment on Task_Multiplayer_RequestServer_C_OnConnectionFinished_Event");
static_assert(sizeof(Task_Multiplayer_RequestServer_C_OnConnectionFinished_Event) == 0x000001, "Wrong size on Task_Multiplayer_RequestServer_C_OnConnectionFinished_Event");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_OnConnectionFinished_Event, IsSuccessful) == 0x000000, "Member 'Task_Multiplayer_RequestServer_C_OnConnectionFinished_Event::IsSuccessful' has a wrong offset!");

// Function Task_Multiplayer_RequestServer.Task_Multiplayer_RequestServer_C.OnFinished__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Task_Multiplayer_RequestServer_C_OnFinished__DelegateSignature final
{
public:
	bool                                          IsSuccessful;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Multiplayer_RequestServer_C_OnFinished__DelegateSignature) == 0x000001, "Wrong alignment on Task_Multiplayer_RequestServer_C_OnFinished__DelegateSignature");
static_assert(sizeof(Task_Multiplayer_RequestServer_C_OnFinished__DelegateSignature) == 0x000001, "Wrong size on Task_Multiplayer_RequestServer_C_OnFinished__DelegateSignature");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_OnFinished__DelegateSignature, IsSuccessful) == 0x000000, "Member 'Task_Multiplayer_RequestServer_C_OnFinished__DelegateSignature::IsSuccessful' has a wrong offset!");

// Function Task_Multiplayer_RequestServer.Task_Multiplayer_RequestServer_C.OnPlayFabResponse_1640A79F41DF44E967384B9B9BAD3EE6
// 0x0050 (0x0050 - 0x0000)
struct Task_Multiplayer_RequestServer_C_OnPlayFabResponse_1640A79F41DF44E967384B9B9BAD3EE6 final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Multiplayer_RequestServer_C_OnPlayFabResponse_1640A79F41DF44E967384B9B9BAD3EE6) == 0x000008, "Wrong alignment on Task_Multiplayer_RequestServer_C_OnPlayFabResponse_1640A79F41DF44E967384B9B9BAD3EE6");
static_assert(sizeof(Task_Multiplayer_RequestServer_C_OnPlayFabResponse_1640A79F41DF44E967384B9B9BAD3EE6) == 0x000050, "Wrong size on Task_Multiplayer_RequestServer_C_OnPlayFabResponse_1640A79F41DF44E967384B9B9BAD3EE6");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_OnPlayFabResponse_1640A79F41DF44E967384B9B9BAD3EE6, Response) == 0x000000, "Member 'Task_Multiplayer_RequestServer_C_OnPlayFabResponse_1640A79F41DF44E967384B9B9BAD3EE6::Response' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_OnPlayFabResponse_1640A79F41DF44E967384B9B9BAD3EE6, CustomData) == 0x000040, "Member 'Task_Multiplayer_RequestServer_C_OnPlayFabResponse_1640A79F41DF44E967384B9B9BAD3EE6::CustomData' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_OnPlayFabResponse_1640A79F41DF44E967384B9B9BAD3EE6, Successful) == 0x000048, "Member 'Task_Multiplayer_RequestServer_C_OnPlayFabResponse_1640A79F41DF44E967384B9B9BAD3EE6::Successful' has a wrong offset!");

// Function Task_Multiplayer_RequestServer.Task_Multiplayer_RequestServer_C.ReceiveFinished
// 0x0001 (0x0001 - 0x0000)
struct Task_Multiplayer_RequestServer_C_ReceiveFinished final
{
public:
	EActionState                                  Reason;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Multiplayer_RequestServer_C_ReceiveFinished) == 0x000001, "Wrong alignment on Task_Multiplayer_RequestServer_C_ReceiveFinished");
static_assert(sizeof(Task_Multiplayer_RequestServer_C_ReceiveFinished) == 0x000001, "Wrong size on Task_Multiplayer_RequestServer_C_ReceiveFinished");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_ReceiveFinished, Reason) == 0x000000, "Member 'Task_Multiplayer_RequestServer_C_ReceiveFinished::Reason' has a wrong offset!");

// Function Task_Multiplayer_RequestServer.Task_Multiplayer_RequestServer_C.RequestServer_Failure
// 0x0040 (0x0040 - 0x0000)
struct Task_Multiplayer_RequestServer_C_RequestServer_Failure final
{
public:
	struct FPlayFabError                          Error;                                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_Multiplayer_RequestServer_C_RequestServer_Failure) == 0x000008, "Wrong alignment on Task_Multiplayer_RequestServer_C_RequestServer_Failure");
static_assert(sizeof(Task_Multiplayer_RequestServer_C_RequestServer_Failure) == 0x000040, "Wrong size on Task_Multiplayer_RequestServer_C_RequestServer_Failure");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_RequestServer_Failure, Error) == 0x000000, "Member 'Task_Multiplayer_RequestServer_C_RequestServer_Failure::Error' has a wrong offset!");
static_assert(offsetof(Task_Multiplayer_RequestServer_C_RequestServer_Failure, CustomData) == 0x000038, "Member 'Task_Multiplayer_RequestServer_C_RequestServer_Failure::CustomData' has a wrong offset!");

// Function Task_Multiplayer_RequestServer.Task_Multiplayer_RequestServer_C.RequestServer_Success
// 0x0068 (0x0068 - 0x0000)
struct Task_Multiplayer_RequestServer_C_RequestServer_Success final
{
public:
	struct FClientExecuteCloudScriptResult        Result;                                            // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
