#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: U_Menu_Soldier_Statistic

#include "Basic.hpp"

#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function U_Menu_Soldier_Statistic.U_Menu_Soldier_Statistic_C.ExecuteUbergraph_U_Menu_Soldier_Statistic
// 0x0060 (0x0060 - 0x0000)
struct U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3865[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_CustomEvent_ModifiedData;                   // 0x0010(0x0010)(ConstParm, ReferenceParm)
	class FString                                 K2Node_CustomEvent_CustomString;                   // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Menu_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Menu;      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3866[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3867[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<EModifiedData>& ModifiedData, const class FString& CustomString)> K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic) == 0x000008, "Wrong alignment on U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic");
static_assert(sizeof(U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic) == 0x000060, "Wrong size on U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic, EntryPoint) == 0x000000, "Member 'U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic::EntryPoint' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic, K2Node_CustomEvent_ModifiedData) == 0x000010, "Member 'U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic::K2Node_CustomEvent_ModifiedData' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic, K2Node_CustomEvent_CustomString) == 0x000020, "Member 'U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic::K2Node_CustomEvent_CustomString' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic, K2Node_DynamicCast_AsBP_PG_Player_State_Menu) == 0x000030, "Member 'U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic::K2Node_DynamicCast_AsBP_PG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic, Temp_bool_Has_Been_Initd_Variable) == 0x000039, "Member 'U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000040, "Member 'U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'U_Menu_Soldier_Statistic_C_ExecuteUbergraph_U_Menu_Soldier_Statistic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function U_Menu_Soldier_Statistic.U_Menu_Soldier_Statistic_C.OnUpdatePlayerCombinedInfo_Event
// 0x0020 (0x0020 - 0x0000)
struct U_Menu_Soldier_Statistic_C_OnUpdatePlayerCombinedInfo_Event final
{
public:
	TArray<EModifiedData>                         ModifiedData;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 CustomString;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(U_Menu_Soldier_Statistic_C_OnUpdatePlayerCombinedInfo_Event) == 0x000008, "Wrong alignment on U_Menu_Soldier_Statistic_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(sizeof(U_Menu_Soldier_Statistic_C_OnUpdatePlayerCombinedInfo_Event) == 0x000020, "Wrong size on U_Menu_Soldier_Statistic_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_OnUpdatePlayerCombinedInfo_Event, ModifiedData) == 0x000000, "Member 'U_Menu_Soldier_Statistic_C_OnUpdatePlayerCombinedInfo_Event::ModifiedData' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_OnUpdatePlayerCombinedInfo_Event, CustomString) == 0x000010, "Member 'U_Menu_Soldier_Statistic_C_OnUpdatePlayerCombinedInfo_Event::CustomString' has a wrong offset!");

// Function U_Menu_Soldier_Statistic.U_Menu_Soldier_Statistic_C.ParsePlayerCombinedInfo
// 0x00B0 (0x00B0 - 0x0000)
struct U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3868[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3869[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_386A[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0098(0x0018)()
};
static_assert(alignof(U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo) == 0x000008, "Wrong alignment on U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo");
static_assert(sizeof(U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo) == 0x0000B0, "Wrong size on U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo, K2Node_DynamicCast_AsPG_Player_State_Menu) == 0x000008, "Member 'U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo::K2Node_DynamicCast_AsPG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000018, "Member 'U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo, CallFunc_GetObjectField_ReturnValue) == 0x000020, "Member 'U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo, CallFunc_HasField_ReturnValue) == 0x000028, "Member 'U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo::CallFunc_HasField_ReturnValue' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo, CallFunc_GetStringField_ReturnValue) == 0x000030, "Member 'U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo, CallFunc_Split_LeftS) == 0x000040, "Member 'U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo, CallFunc_Split_RightS) == 0x000050, "Member 'U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo, CallFunc_Split_ReturnValue) == 0x000060, "Member 'U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo, CallFunc_GetObjectField_ReturnValue_1) == 0x000068, "Member 'U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo, CallFunc_GetStringField_ReturnValue_1) == 0x000088, "Member 'U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000098, "Member 'U_Menu_Soldier_Statistic_C_ParsePlayerCombinedInfo::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

}

