#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: U_Menu_Soldier

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass U_Menu_Soldier.U_Menu_Soldier_C
// 0x0050 (0x02D0 - 0x0280)
class UU_Menu_Soldier_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_Header;                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           UI_Button_Gear;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           UI_Button_Statistics;                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           UI_Button_Weapon;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Menu_Soldier_Gear_C*                UI_Menu_Soldier_Gear;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UU_Menu_Soldier_Statistic_C*            UI_Menu_Soldier_Statistic;                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Menu_Soldier_Weapon_C*              UI_Menu_Soldier_Weapon;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Header;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Main;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__U_Menu_Soldier_UI_Button_Gear_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature(class UUI_Button_C* Button);
	void BndEvt__UI_Button_Customization_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature(class UUI_Button_C* Button);
	void BndEvt__UI_Button_Statistics_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature(class UUI_Button_C* Button);
	void Construct();
	void ExecuteUbergraph_U_Menu_Soldier(int32 EntryPoint);
	void OnPressed_Event(class UUI_Button_C* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"U_Menu_Soldier_C">();
	}
	static class UU_Menu_Soldier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UU_Menu_Soldier_C>();
	}
};
static_assert(alignof(UU_Menu_Soldier_C) == 0x000008, "Wrong alignment on UU_Menu_Soldier_C");
static_assert(sizeof(UU_Menu_Soldier_C) == 0x0002D0, "Wrong size on UU_Menu_Soldier_C");
static_assert(offsetof(UU_Menu_Soldier_C, UberGraphFrame) == 0x000280, "Member 'UU_Menu_Soldier_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UU_Menu_Soldier_C, HorizontalBox_Header) == 0x000288, "Member 'UU_Menu_Soldier_C::HorizontalBox_Header' has a wrong offset!");
static_assert(offsetof(UU_Menu_Soldier_C, UI_Button_Gear) == 0x000290, "Member 'UU_Menu_Soldier_C::UI_Button_Gear' has a wrong offset!");
static_assert(offsetof(UU_Menu_Soldier_C, UI_Button_Statistics) == 0x000298, "Member 'UU_Menu_Soldier_C::UI_Button_Statistics' has a wrong offset!");
static_assert(offsetof(UU_Menu_Soldier_C, UI_Button_Weapon) == 0x0002A0, "Member 'UU_Menu_Soldier_C::UI_Button_Weapon' has a wrong offset!");
static_assert(offsetof(UU_Menu_Soldier_C, UI_Menu_Soldier_Gear) == 0x0002A8, "Member 'UU_Menu_Soldier_C::UI_Menu_Soldier_Gear' has a wrong offset!");
static_assert(offsetof(UU_Menu_Soldier_C, UI_Menu_Soldier_Statistic) == 0x0002B0, "Member 'UU_Menu_Soldier_C::UI_Menu_Soldier_Statistic' has a wrong offset!");
static_assert(offsetof(UU_Menu_Soldier_C, UI_Menu_Soldier_Weapon) == 0x0002B8, "Member 'UU_Menu_Soldier_C::UI_Menu_Soldier_Weapon' has a wrong offset!");
static_assert(offsetof(UU_Menu_Soldier_C, VerticalBox_Header) == 0x0002C0, "Member 'UU_Menu_Soldier_C::VerticalBox_Header' has a wrong offset!");
static_assert(offsetof(UU_Menu_Soldier_C, WidgetSwitcher_Main) == 0x0002C8, "Member 'UU_Menu_Soldier_C::WidgetSwitcher_Main' has a wrong offset!");

}

