#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_Post_Process_Stage

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct UDS_Post_Process_Stage.UDS_Post_Process_Stage
// 0x0710 (0x0710 - 0x0000)
struct FUDS_Post_Process_Stage final
{
public:
	class FString                                 Label_24_760DA3B649F655929138B7846A0B840F;         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FPostProcessSettings                   PostProcessSettings_25_E746F2674432B2790E7147B9B9D48686; // 0x0010(0x06E0)(Edit, BlueprintVisible)
	bool                                          DisableDuringDay_60_6A0C0A844D25727B201270B8E6794534; // 0x06F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableatDawnDusk_61_D0DA84F840D05C7DA0D7B49A2E6743C4; // 0x06F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableatNight_62_1D5FD8DD4142C2B92FFCEFBE2A0E581F; // 0x06F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifOvercast_52_989272994F5025F12C728292C335B969; // 0x06F3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifNotOvercast_53_D95A77BB4DB1672F50FDC6B817C28515; // 0x06F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifFoggy_54_539D2C7E4D2FD2EB58A526993DBB4A10; // 0x06F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifNotFoggy_55_34F8C6474E89F3CB3996E78C6CEF2907; // 0x06F6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifDusty_56_0044404B424580AF8096A6B8CD97F80F; // 0x06F7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifNotDusty_57_B002D3174D9C870BA261FCA71ADF2E02; // 0x06F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifInsideInterior_58_8D9B008146005C1946D6B4B9F02F9C83; // 0x06F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifOutsideInterior_59_BF184CAA469ECC2CC17795A644DA512E; // 0x06FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38EF[0x5];                                     // 0x06FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Priority_47_5B0BDA844B69DB2E7768168865CD16E0;      // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUDS_Post_Process_Stage) == 0x000010, "Wrong alignment on FUDS_Post_Process_Stage");
static_assert(sizeof(FUDS_Post_Process_Stage) == 0x000710, "Wrong size on FUDS_Post_Process_Stage");
static_assert(offsetof(FUDS_Post_Process_Stage, Label_24_760DA3B649F655929138B7846A0B840F) == 0x000000, "Member 'FUDS_Post_Process_Stage::Label_24_760DA3B649F655929138B7846A0B840F' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, PostProcessSettings_25_E746F2674432B2790E7147B9B9D48686) == 0x000010, "Member 'FUDS_Post_Process_Stage::PostProcessSettings_25_E746F2674432B2790E7147B9B9D48686' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableDuringDay_60_6A0C0A844D25727B201270B8E6794534) == 0x0006F0, "Member 'FUDS_Post_Process_Stage::DisableDuringDay_60_6A0C0A844D25727B201270B8E6794534' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableatDawnDusk_61_D0DA84F840D05C7DA0D7B49A2E6743C4) == 0x0006F1, "Member 'FUDS_Post_Process_Stage::DisableatDawnDusk_61_D0DA84F840D05C7DA0D7B49A2E6743C4' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableatNight_62_1D5FD8DD4142C2B92FFCEFBE2A0E581F) == 0x0006F2, "Member 'FUDS_Post_Process_Stage::DisableatNight_62_1D5FD8DD4142C2B92FFCEFBE2A0E581F' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifOvercast_52_989272994F5025F12C728292C335B969) == 0x0006F3, "Member 'FUDS_Post_Process_Stage::DisableifOvercast_52_989272994F5025F12C728292C335B969' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifNotOvercast_53_D95A77BB4DB1672F50FDC6B817C28515) == 0x0006F4, "Member 'FUDS_Post_Process_Stage::DisableifNotOvercast_53_D95A77BB4DB1672F50FDC6B817C28515' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifFoggy_54_539D2C7E4D2FD2EB58A526993DBB4A10) == 0x0006F5, "Member 'FUDS_Post_Process_Stage::DisableifFoggy_54_539D2C7E4D2FD2EB58A526993DBB4A10' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifNotFoggy_55_34F8C6474E89F3CB3996E78C6CEF2907) == 0x0006F6, "Member 'FUDS_Post_Process_Stage::DisableifNotFoggy_55_34F8C6474E89F3CB3996E78C6CEF2907' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifDusty_56_0044404B424580AF8096A6B8CD97F80F) == 0x0006F7, "Member 'FUDS_Post_Process_Stage::DisableifDusty_56_0044404B424580AF8096A6B8CD97F80F' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifNotDusty_57_B002D3174D9C870BA261FCA71ADF2E02) == 0x0006F8, "Member 'FUDS_Post_Process_Stage::DisableifNotDusty_57_B002D3174D9C870BA261FCA71ADF2E02' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifInsideInterior_58_8D9B008146005C1946D6B4B9F02F9C83) == 0x0006F9, "Member 'FUDS_Post_Process_Stage::DisableifInsideInterior_58_8D9B008146005C1946D6B4B9F02F9C83' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifOutsideInterior_59_BF184CAA469ECC2CC17795A644DA512E) == 0x0006FA, "Member 'FUDS_Post_Process_Stage::DisableifOutsideInterior_59_BF184CAA469ECC2CC17795A644DA512E' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, Priority_47_5B0BDA844B69DB2E7768168865CD16E0) == 0x000700, "Member 'FUDS_Post_Process_Stage::Priority_47_5B0BDA844B69DB2E7768168865CD16E0' has a wrong offset!");

}

