#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Button

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_Button.UI_Button_C.ExecuteUbergraph_UI_Button
// 0x0050 (0x0050 - 0x0000)
struct UI_Button_C_ExecuteUbergraph_UI_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByID_Color;                       // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorByID_Found;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CB4[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetColorByID_Color_1;                     // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorByID_Found_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CB5[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByID_Color_2;                     // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorByID_Found_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Button_C_ExecuteUbergraph_UI_Button) == 0x000008, "Wrong alignment on UI_Button_C_ExecuteUbergraph_UI_Button");
static_assert(sizeof(UI_Button_C_ExecuteUbergraph_UI_Button) == 0x000050, "Wrong size on UI_Button_C_ExecuteUbergraph_UI_Button");
static_assert(offsetof(UI_Button_C_ExecuteUbergraph_UI_Button, EntryPoint) == 0x000000, "Member 'UI_Button_C_ExecuteUbergraph_UI_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Button_C_ExecuteUbergraph_UI_Button, CallFunc_GetColorByID_Color) == 0x000004, "Member 'UI_Button_C_ExecuteUbergraph_UI_Button::CallFunc_GetColorByID_Color' has a wrong offset!");
static_assert(offsetof(UI_Button_C_ExecuteUbergraph_UI_Button, CallFunc_GetColorByID_Found) == 0x000014, "Member 'UI_Button_C_ExecuteUbergraph_UI_Button::CallFunc_GetColorByID_Found' has a wrong offset!");
static_assert(offsetof(UI_Button_C_ExecuteUbergraph_UI_Button, CallFunc_NotEqual_NameName_ReturnValue) == 0x000015, "Member 'UI_Button_C_ExecuteUbergraph_UI_Button::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Button_C_ExecuteUbergraph_UI_Button, CallFunc_GetColorByID_Color_1) == 0x000018, "Member 'UI_Button_C_ExecuteUbergraph_UI_Button::CallFunc_GetColorByID_Color_1' has a wrong offset!");
static_assert(offsetof(UI_Button_C_ExecuteUbergraph_UI_Button, CallFunc_GetColorByID_Found_1) == 0x000028, "Member 'UI_Button_C_ExecuteUbergraph_UI_Button::CallFunc_GetColorByID_Found_1' has a wrong offset!");
static_assert(offsetof(UI_Button_C_ExecuteUbergraph_UI_Button, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000030, "Member 'UI_Button_C_ExecuteUbergraph_UI_Button::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Button_C_ExecuteUbergraph_UI_Button, CallFunc_GetColorByID_Color_2) == 0x000038, "Member 'UI_Button_C_ExecuteUbergraph_UI_Button::CallFunc_GetColorByID_Color_2' has a wrong offset!");
static_assert(offsetof(UI_Button_C_ExecuteUbergraph_UI_Button, CallFunc_GetColorByID_Found_2) == 0x000048, "Member 'UI_Button_C_ExecuteUbergraph_UI_Button::CallFunc_GetColorByID_Found_2' has a wrong offset!");
static_assert(offsetof(UI_Button_C_ExecuteUbergraph_UI_Button, K2Node_Event_IsDesignTime) == 0x000049, "Member 'UI_Button_C_ExecuteUbergraph_UI_Button::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UI_Button.UI_Button_C.OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Button_C_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Param_Button;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Button_C_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Button_C_OnClick__DelegateSignature");
static_assert(sizeof(UI_Button_C_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Button_C_OnClick__DelegateSignature");
static_assert(offsetof(UI_Button_C_OnClick__DelegateSignature, Param_Button) == 0x000000, "Member 'UI_Button_C_OnClick__DelegateSignature::Param_Button' has a wrong offset!");

// Function UI_Button.UI_Button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Button_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Button_C_PreConstruct");
static_assert(sizeof(UI_Button_C_PreConstruct) == 0x000001, "Wrong size on UI_Button_C_PreConstruct");
static_assert(offsetof(UI_Button_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Button_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_Button.UI_Button_C.Set Color
// 0x005C (0x005C - 0x0000)
struct UI_Button_C_Set_Color final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CB6[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByID_Color;                       // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorByID_Found;                       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CB7[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0048(0x0014)()
};
static_assert(alignof(UI_Button_C_Set_Color) == 0x000004, "Wrong alignment on UI_Button_C_Set_Color");
static_assert(sizeof(UI_Button_C_Set_Color) == 0x00005C, "Wrong size on UI_Button_C_Set_Color");
static_assert(offsetof(UI_Button_C_Set_Color, Temp_bool_Variable) == 0x000000, "Member 'UI_Button_C_Set_Color::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Button_C_Set_Color, Temp_struct_Variable) == 0x000004, "Member 'UI_Button_C_Set_Color::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Button_C_Set_Color, Temp_struct_Variable_1) == 0x000014, "Member 'UI_Button_C_Set_Color::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Button_C_Set_Color, CallFunc_GetColorByID_Color) == 0x000024, "Member 'UI_Button_C_Set_Color::CallFunc_GetColorByID_Color' has a wrong offset!");
static_assert(offsetof(UI_Button_C_Set_Color, CallFunc_GetColorByID_Found) == 0x000034, "Member 'UI_Button_C_Set_Color::CallFunc_GetColorByID_Found' has a wrong offset!");
static_assert(offsetof(UI_Button_C_Set_Color, K2Node_Select_Default) == 0x000038, "Member 'UI_Button_C_Set_Color::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Button_C_Set_Color, K2Node_MakeStruct_SlateColor) == 0x000048, "Member 'UI_Button_C_Set_Color::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function UI_Button.UI_Button_C.SetSelectButton
// 0x0050 (0x0050 - 0x0000)
struct UI_Button_C_SetSelectButton final
{
public:
	bool                                          Param_IsSelected;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CB8[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CB9[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x003C(0x0014)()
};
static_assert(alignof(UI_Button_C_SetSelectButton) == 0x000004, "Wrong alignment on UI_Button_C_SetSelectButton");
static_assert(sizeof(UI_Button_C_SetSelectButton) == 0x000050, "Wrong size on UI_Button_C_SetSelectButton");
static_assert(offsetof(UI_Button_C_SetSelectButton, Param_IsSelected) == 0x000000, "Member 'UI_Button_C_SetSelectButton::Param_IsSelected' has a wrong offset!");
static_assert(offsetof(UI_Button_C_SetSelectButton, Temp_bool_Variable) == 0x000001, "Member 'UI_Button_C_SetSelectButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Button_C_SetSelectButton, Temp_struct_Variable) == 0x000004, "Member 'UI_Button_C_SetSelectButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Button_C_SetSelectButton, Temp_bool_Variable_1) == 0x000014, "Member 'UI_Button_C_SetSelectButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Button_C_SetSelectButton, Temp_byte_Variable) == 0x000015, "Member 'UI_Button_C_SetSelectButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Button_C_SetSelectButton, Temp_byte_Variable_1) == 0x000016, "Member 'UI_Button_C_SetSelectButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Button_C_SetSelectButton, Temp_bool_Variable_2) == 0x000017, "Member 'UI_Button_C_SetSelectButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Button_C_SetSelectButton, CallFunc_GetIsEnabled_ReturnValue) == 0x000018, "Member 'UI_Button_C_SetSelectButton::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Button_C_SetSelectButton, K2Node_Select_Default) == 0x000019, "Member 'UI_Button_C_SetSelectButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Button_C_SetSelectButton, K2Node_Select_Default_1) == 0x00001C, "Member 'UI_Button_C_SetSelectButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_Button_C_SetSelectButton, K2Node_Select_Default_2) == 0x00002C, "Member 'UI_Button_C_SetSelectButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UI_Button_C_SetSelectButton, K2Node_MakeStruct_SlateColor) == 0x00003C, "Member 'UI_Button_C_SetSelectButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

