#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_BattlePass_BuyAnimation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_BattlePass_BuyAnimation.UI_BattlePass_BuyAnimation_C
// 0x0030 (0x02B0 - 0x0280)
class UUI_BattlePass_BuyAnimation_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BuyBattlePassAnimation_03;                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BuyBattlePassAnimation_02;                         // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BuyBattlePassAnimation_01;                         // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnimation;                                     // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Main;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_BattlePass_BuyAnimation(int32 EntryPoint);
	void Finished_B4691D1648DFE5BC8D04DFA90DFD037F();
	void Finished_C59562724E96D1EE1EA7658EF238B4A5();
	void Finished_DB4C5BA5481B57A883CB2BB1C672664D();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_BattlePass_BuyAnimation_C">();
	}
	static class UUI_BattlePass_BuyAnimation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_BattlePass_BuyAnimation_C>();
	}
};
static_assert(alignof(UUI_BattlePass_BuyAnimation_C) == 0x000008, "Wrong alignment on UUI_BattlePass_BuyAnimation_C");
static_assert(sizeof(UUI_BattlePass_BuyAnimation_C) == 0x0002B0, "Wrong size on UUI_BattlePass_BuyAnimation_C");
static_assert(offsetof(UUI_BattlePass_BuyAnimation_C, UberGraphFrame) == 0x000280, "Member 'UUI_BattlePass_BuyAnimation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_BattlePass_BuyAnimation_C, BuyBattlePassAnimation_03) == 0x000288, "Member 'UUI_BattlePass_BuyAnimation_C::BuyBattlePassAnimation_03' has a wrong offset!");
static_assert(offsetof(UUI_BattlePass_BuyAnimation_C, BuyBattlePassAnimation_02) == 0x000290, "Member 'UUI_BattlePass_BuyAnimation_C::BuyBattlePassAnimation_02' has a wrong offset!");
static_assert(offsetof(UUI_BattlePass_BuyAnimation_C, BuyBattlePassAnimation_01) == 0x000298, "Member 'UUI_BattlePass_BuyAnimation_C::BuyBattlePassAnimation_01' has a wrong offset!");
static_assert(offsetof(UUI_BattlePass_BuyAnimation_C, ShowAnimation) == 0x0002A0, "Member 'UUI_BattlePass_BuyAnimation_C::ShowAnimation' has a wrong offset!");
static_assert(offsetof(UUI_BattlePass_BuyAnimation_C, Overlay_Main) == 0x0002A8, "Member 'UUI_BattlePass_BuyAnimation_C::Overlay_Main' has a wrong offset!");

}

