#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_BattlePass_BuyPage

#include "Basic.hpp"

#include "PlayFab_structs.hpp"
#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_BattlePass_BuyPage.UI_BattlePass_BuyPage_C.ExecuteUbergraph_UI_BattlePass_BuyPage
// 0x0740 (0x0740 - 0x0000)
struct UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3311[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerState_Menu_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Menu;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3312[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3313[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x0038(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_4;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3314[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x0090(0x0040)()
	TDelegate<void(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Yes)>                     K2Node_CreateDelegate_OutputDelegate_4;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_BattlePass_BuyAnimation_C*          CallFunc_Create_ReturnValue;                       // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_BattlePass_BuyAnimation_C*          CallFunc_Create_ReturnValue_1;                     // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3315[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3316[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Shop_WarningNoPC_C*                 CallFunc_Create_ReturnValue_2;                     // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3317[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Shop_ConfirmPurchase_C*             CallFunc_Create_ReturnValue_3;                     // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_ConfirmPurchase_C*             K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptRequest       K2Node_MakeStruct_ClientExecuteCloudScriptRequest; // 0x0168(0x0030)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0198(0x0018)()
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x01B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result_1;                       // 0x01C0(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData_3;                   // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0228(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3318[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0248(0x0018)()
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue;          // 0x0260(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3319[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabError                          K2Node_CustomEvent_error_1;                        // 0x0278(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x02B8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x02D0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x02E8(0x0018)()
	TDelegate<void(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0300(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                      CallFunc_ExecuteCloudScript_ReturnValue;           // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331A[0x3];                                     // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNumberField_ReturnValue_1;             // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331B[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0338(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_1;      // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331C[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_2;             // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_2;             // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331D[0x4];                                     // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue_1;        // 0x0388(0x0010)(ReferenceParm)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_2;      // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_3;             // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_WarningNoPC_C*                 CallFunc_Create_ReturnValue_4;                     // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_3;             // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x03B8(0x0018)()
	class UUI_Shop_ConfirmPurchase_C*             CallFunc_Create_ReturnValue_5;                     // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable_1;                            // 0x03D8(0x0040)()
	class UUI_Shop_ConfirmPurchase_C*             K2Node_LowEntry_LocalVariable_Value__2_Object;     // 0x0418(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptRequest       K2Node_MakeStruct_ClientExecuteCloudScriptRequest_1; // 0x0428(0x0030)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0458(0x0018)()
	class UPlayFabClientAPI*                      CallFunc_ExecuteCloudScript_ReturnValue_1;         // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x048C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331E[0x3];                                     // 0x048D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0494(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331F[0x3];                                     // 0x0495(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result;                         // 0x0498(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x04F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x0500(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x0538(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_4;             // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3320[0x4];                                     // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0548(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0560(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0578(0x0018)()
	bool                                          CallFunc_GetBoolField_ReturnValue_1;               // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3321[0x7];                                     // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0598(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3322[0x7];                                     // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x05B8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x05D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_3;      // 0x05E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue;          // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_4;             // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_5;             // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3323[0x4];                                     // 0x0604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue_2;        // 0x0608(0x0010)(ReferenceParm)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response_1;                     // 0x0618(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_5;                   // 0x0658(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful_1;                   // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3324[0x3];                                     // 0x0661(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0664(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3325[0x4];                                     // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue_1;        // 0x0678(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__3_Object;     // 0x0680(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_3;                    // 0x0688(0x0018)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3326[0x4];                                     // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x06A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_1;        // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x06C8(0x0010)(ConstParm, ReferenceParm)
	TArray<EModifiedData>                         K2Node_MakeArray_Array_1;                          // 0x06D8(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_CustomEvent_Yes;                            // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3327[0x3];                                     // 0x06E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Yes)>                     K2Node_CreateDelegate_OutputDelegate_9;            // 0x06EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x06FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3328[0x3];                                     // 0x06FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Round_A_ImplicitCast_1;                   // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast_1;   // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast;       // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3329[0x4];                                     // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast_1;     // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage) == 0x000008, "Wrong alignment on UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage");
static_assert(sizeof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage) == 0x000740, "Wrong size on UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, EntryPoint) == 0x000000, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_DynamicCast_AsBP_PG_Player_State_Menu) == 0x000018, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_DynamicCast_AsBP_PG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CustomEvent_response) == 0x000038, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CustomEvent_customData_4) == 0x000078, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CustomEvent_customData_4' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CustomEvent_successful) == 0x000080, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, Temp_bool_Variable) == 0x000081, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, Temp_object_Variable) == 0x000088, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, Temp_struct_Variable) == 0x000090, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000D0, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000E0, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000F0, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Create_ReturnValue) == 0x000100, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Create_ReturnValue_1) == 0x000108, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, Temp_bool_Has_Been_Initd_Variable) == 0x000110, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, Temp_bool_IsClosed_Variable) == 0x000111, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_PlayAnimation_ReturnValue) == 0x000118, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetOwningPlayer_ReturnValue) == 0x000120, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000128, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_DynamicCast_bSuccess_1) == 0x000130, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Create_ReturnValue_2) == 0x000138, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Not_PreBool_ReturnValue) == 0x000140, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Create_ReturnValue_3) == 0x000148, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_ConstructJsonObject_ReturnValue) == 0x000150, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000158, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_LowEntry_LocalVariable_Value__1_Object) == 0x000160, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_LowEntry_LocalVariable_Value__1_Object' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_MakeStruct_ClientExecuteCloudScriptRequest) == 0x000168, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_MakeStruct_ClientExecuteCloudScriptRequest' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_MakeLiteralText_ReturnValue) == 0x000198, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001B0, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CustomEvent_result_1) == 0x0001C0, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CustomEvent_result_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CustomEvent_customData_3) == 0x000220, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CustomEvent_customData_3' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CreateDelegate_OutputDelegate_6) == 0x000228, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetNumberField_ReturnValue) == 0x000238, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetObjectField_ReturnValue) == 0x000240, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000248, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetObjectArrayField_ReturnValue) == 0x000260, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetObjectArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetBoolField_ReturnValue) == 0x000270, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetBoolField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CustomEvent_error_1) == 0x000278, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CustomEvent_error_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CustomEvent_customData_2) == 0x0002B0, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CustomEvent_customData_2' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Conv_StringToText_ReturnValue) == 0x0002B8, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0002D0, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0002E8, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CreateDelegate_OutputDelegate_7) == 0x000300, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_ExecuteCloudScript_ReturnValue) == 0x000310, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_ExecuteCloudScript_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000318, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetObjectField_ReturnValue_1) == 0x000320, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_IsValid_ReturnValue) == 0x000328, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetNumberField_ReturnValue_1) == 0x00032C, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetNumberField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Round_ReturnValue) == 0x000330, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetText_ReturnValue) == 0x000338, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Conv_TextToString_ReturnValue) == 0x000350, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Conv_StringToInt_ReturnValue) == 0x000360, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Subtract_IntInt_ReturnValue) == 0x000364, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetPlayerCombinedInfo_ReturnValue_1) == 0x000368, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetPlayerCombinedInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000370, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetObjectField_ReturnValue_2) == 0x000378, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetObjectField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetNumberField_ReturnValue_2) == 0x000380, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetNumberField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetObjectArrayField_ReturnValue_1) == 0x000388, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetObjectArrayField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetPlayerCombinedInfo_ReturnValue_2) == 0x000398, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetPlayerCombinedInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetObjectField_ReturnValue_3) == 0x0003A0, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetObjectField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Create_ReturnValue_4) == 0x0003A8, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetNumberField_ReturnValue_3) == 0x0003B0, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetNumberField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Round_ReturnValue_1) == 0x0003B4, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_MakeLiteralText_ReturnValue_2) == 0x0003B8, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Create_ReturnValue_5) == 0x0003D0, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Create_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, Temp_struct_Variable_1) == 0x0003D8, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_LowEntry_LocalVariable_Value__2_Object) == 0x000418, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_LowEntry_LocalVariable_Value__2_Object' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, Temp_object_Variable_1) == 0x000420, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_MakeStruct_ClientExecuteCloudScriptRequest_1) == 0x000428, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_MakeStruct_ClientExecuteCloudScriptRequest_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetText_ReturnValue_1) == 0x000458, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_ExecuteCloudScript_ReturnValue_1) == 0x000470, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_ExecuteCloudScript_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000478, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Conv_StringToInt_ReturnValue_1) == 0x000488, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Conv_StringToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00048C, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000490, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_IsValid_ReturnValue_1) == 0x000494, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CustomEvent_result) == 0x000498, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CustomEvent_result' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CustomEvent_customData_1) == 0x0004F8, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CustomEvent_customData_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CustomEvent_error) == 0x000500, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CustomEvent_error' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CustomEvent_customData) == 0x000538, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CustomEvent_customData' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetNumberField_ReturnValue_4) == 0x000540, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetNumberField_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000548, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x000560, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000578, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetBoolField_ReturnValue_1) == 0x000590, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetBoolField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000598, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, Temp_bool_Variable_1) == 0x0005B0, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetText_ReturnValue_2) == 0x0005B8, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0005D0, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetPlayerCombinedInfo_ReturnValue_3) == 0x0005E0, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetPlayerCombinedInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Conv_StringToDouble_ReturnValue) == 0x0005E8, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Conv_StringToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetObjectField_ReturnValue_4) == 0x0005F0, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetObjectField_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0005F8, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetNumberField_ReturnValue_5) == 0x000600, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetNumberField_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetObjectArrayField_ReturnValue_2) == 0x000608, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetObjectArrayField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CustomEvent_response_1) == 0x000618, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CustomEvent_response_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CustomEvent_customData_5) == 0x000658, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CustomEvent_customData_5' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CustomEvent_successful_1) == 0x000660, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CustomEvent_successful_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CreateDelegate_OutputDelegate_8) == 0x000664, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_ConstructJsonObject_ReturnValue_1) == 0x000678, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_ConstructJsonObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_LowEntry_LocalVariable_Value__3_Object) == 0x000680, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_LowEntry_LocalVariable_Value__3_Object' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_GetText_ReturnValue_3) == 0x000688, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_GetText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Array_Add_ReturnValue) == 0x0006A0, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Conv_TextToString_ReturnValue_3) == 0x0006A8, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Conv_StringToDouble_ReturnValue_1) == 0x0006B8, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Conv_StringToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0006C0, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_MakeArray_Array) == 0x0006C8, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_MakeArray_Array_1) == 0x0006D8, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CustomEvent_Yes) == 0x0006E8, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CustomEvent_Yes' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, K2Node_CreateDelegate_OutputDelegate_9) == 0x0006EC, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Not_PreBool_ReturnValue_1) == 0x0006FC, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000700, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Round_A_ImplicitCast) == 0x000708, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Round_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000710, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Round_A_ImplicitCast_1) == 0x000718, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Round_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Conv_DoubleToText_Value_ImplicitCast_1) == 0x000720, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Conv_DoubleToText_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_SetNumberField_Number_ImplicitCast) == 0x000728, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_SetNumberField_Number_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1) == 0x000730, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage, CallFunc_SetNumberField_Number_ImplicitCast_1) == 0x000738, "Member 'UI_BattlePass_BuyPage_C_ExecuteUbergraph_UI_BattlePass_BuyPage::CallFunc_SetNumberField_Number_ImplicitCast_1' has a wrong offset!");

// Function UI_BattlePass_BuyPage.UI_BattlePass_BuyPage_C.OnPlayFabResponse_C7BCD03D4308CED6572F158C2FEE0D25
// 0x0050 (0x0050 - 0x0000)
struct UI_BattlePass_BuyPage_C_OnPlayFabResponse_C7BCD03D4308CED6572F158C2FEE0D25 final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_BattlePass_BuyPage_C_OnPlayFabResponse_C7BCD03D4308CED6572F158C2FEE0D25) == 0x000008, "Wrong alignment on UI_BattlePass_BuyPage_C_OnPlayFabResponse_C7BCD03D4308CED6572F158C2FEE0D25");
static_assert(sizeof(UI_BattlePass_BuyPage_C_OnPlayFabResponse_C7BCD03D4308CED6572F158C2FEE0D25) == 0x000050, "Wrong size on UI_BattlePass_BuyPage_C_OnPlayFabResponse_C7BCD03D4308CED6572F158C2FEE0D25");
static_assert(offsetof(UI_BattlePass_BuyPage_C_OnPlayFabResponse_C7BCD03D4308CED6572F158C2FEE0D25, Response) == 0x000000, "Member 'UI_BattlePass_BuyPage_C_OnPlayFabResponse_C7BCD03D4308CED6572F158C2FEE0D25::Response' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_OnPlayFabResponse_C7BCD03D4308CED6572F158C2FEE0D25, CustomData) == 0x000040, "Member 'UI_BattlePass_BuyPage_C_OnPlayFabResponse_C7BCD03D4308CED6572F158C2FEE0D25::CustomData' has a wrong offset!");
static_assert(offsetof(UI_BattlePass_BuyPage_C_OnPlayFabResponse_C7BCD03D4308CED6572F158C2FEE0D25, Successful) == 0x000048, "Member 'UI_BattlePass_BuyPage_C_OnPlayFabResponse_C7BCD03D4308CED6572F158C2FEE0D25::Successful' has a wrong offset!");

// Function UI_BattlePass_BuyPage.UI_BattlePass_BuyPage_C.OnPlayFabResponse_E9CDF6FD46FE9BCB3FDFB6AAC3EC95C4
// 0x0050 (0x0050 - 0x0000)
struct UI_BattlePass_BuyPage_C_OnPlayFabResponse_E9CDF6FD46FE9BCB3FDFB6AAC3EC95C4 final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
