#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Button_Line

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_Button_Line.UI_Button_Line_C.ExecuteUbergraph_UI_Button_Line
// 0x0118 (0x0118 - 0x0000)
struct UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38D9[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0008(0x0058)(HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByID_Color;                       // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorByID_Found;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38DA[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetColorByID_Color_1;                     // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorByID_Found_1;                     // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38DB[0x2];                                     // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetColorByID_Color_2;                     // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorByID_Found_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38DC[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x009C(0x0014)()
	struct FLinearColor                           CallFunc_Add_LinearColorLinearColor_ReturnValue;   // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00C0(0x0014)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38DD[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00E8(0x0014)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38DE[0x3];                                     // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0100(0x0014)()
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line) == 0x000008, "Wrong alignment on UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line");
static_assert(sizeof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line) == 0x000118, "Wrong size on UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, EntryPoint) == 0x000000, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, Temp_bool_Variable) == 0x000004, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, K2Node_Event_IsDesignTime) == 0x000005, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, K2Node_MakeStruct_SlateFontInfo) == 0x000008, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, CallFunc_GetColorByID_Color) == 0x000060, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::CallFunc_GetColorByID_Color' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, CallFunc_GetColorByID_Found) == 0x000070, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::CallFunc_GetColorByID_Found' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, CallFunc_GetColorByID_Color_1) == 0x000074, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::CallFunc_GetColorByID_Color_1' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, CallFunc_GetColorByID_Found_1) == 0x000084, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::CallFunc_GetColorByID_Found_1' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, CallFunc_NotEqual_NameName_ReturnValue) == 0x000085, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, CallFunc_GetColorByID_Color_2) == 0x000088, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::CallFunc_GetColorByID_Color_2' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, CallFunc_GetColorByID_Found_2) == 0x000098, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::CallFunc_GetColorByID_Found_2' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, K2Node_MakeStruct_SlateColor) == 0x00009C, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, CallFunc_Add_LinearColorLinearColor_ReturnValue) == 0x0000B0, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::CallFunc_Add_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, K2Node_MakeStruct_SlateColor_1) == 0x0000C0, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000D4, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, K2Node_Select_Default) == 0x0000D8, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, K2Node_MakeStruct_SlateColor_2) == 0x0000E8, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0000FC, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, K2Node_MakeStruct_SlateColor_3) == 0x000100, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, CallFunc_IsHovered_ReturnValue) == 0x000114, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line, CallFunc_BooleanAND_ReturnValue) == 0x000115, "Member 'UI_Button_Line_C_ExecuteUbergraph_UI_Button_Line::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function UI_Button_Line.UI_Button_Line_C.HidePulse
// 0x0001 (0x0001 - 0x0000)
struct UI_Button_Line_C_HidePulse final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Button_Line_C_HidePulse) == 0x000001, "Wrong alignment on UI_Button_Line_C_HidePulse");
static_assert(sizeof(UI_Button_Line_C_HidePulse) == 0x000001, "Wrong size on UI_Button_Line_C_HidePulse");
static_assert(offsetof(UI_Button_Line_C_HidePulse, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'UI_Button_Line_C_HidePulse::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function UI_Button_Line.UI_Button_Line_C.OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Button_Line_C_OnPressed__DelegateSignature final
{
public:
	class UUI_Button_Line_C*                      Param_Button;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Button_Line_C_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on UI_Button_Line_C_OnPressed__DelegateSignature");
static_assert(sizeof(UI_Button_Line_C_OnPressed__DelegateSignature) == 0x000008, "Wrong size on UI_Button_Line_C_OnPressed__DelegateSignature");
static_assert(offsetof(UI_Button_Line_C_OnPressed__DelegateSignature, Param_Button) == 0x000000, "Member 'UI_Button_Line_C_OnPressed__DelegateSignature::Param_Button' has a wrong offset!");

// Function UI_Button_Line.UI_Button_Line_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Button_Line_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Button_Line_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Button_Line_C_PreConstruct");
static_assert(sizeof(UI_Button_Line_C_PreConstruct) == 0x000001, "Wrong size on UI_Button_Line_C_PreConstruct");
static_assert(offsetof(UI_Button_Line_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Button_Line_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_Button_Line.UI_Button_Line_C.SetButtonColor
// 0x01F0 (0x01F0 - 0x0000)
struct UI_Button_Line_C_SetButtonColor final
{
public:
	struct FLinearColor                           CallFunc_GetColorByID_Color;                       // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorByID_Found;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38DF[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Add_LinearColorLinearColor_ReturnValue;   // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0024(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0014)()
	uint8                                         Pad_38E0[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0050(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0120(0x00D0)()
};
static_assert(alignof(UI_Button_Line_C_SetButtonColor) == 0x000010, "Wrong alignment on UI_Button_Line_C_SetButtonColor");
static_assert(sizeof(UI_Button_Line_C_SetButtonColor) == 0x0001F0, "Wrong size on UI_Button_Line_C_SetButtonColor");
static_assert(offsetof(UI_Button_Line_C_SetButtonColor, CallFunc_GetColorByID_Color) == 0x000000, "Member 'UI_Button_Line_C_SetButtonColor::CallFunc_GetColorByID_Color' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_SetButtonColor, CallFunc_GetColorByID_Found) == 0x000010, "Member 'UI_Button_Line_C_SetButtonColor::CallFunc_GetColorByID_Found' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_SetButtonColor, CallFunc_Add_LinearColorLinearColor_ReturnValue) == 0x000014, "Member 'UI_Button_Line_C_SetButtonColor::CallFunc_Add_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_SetButtonColor, K2Node_MakeStruct_SlateColor) == 0x000024, "Member 'UI_Button_Line_C_SetButtonColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_SetButtonColor, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'UI_Button_Line_C_SetButtonColor::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_SetButtonColor, K2Node_MakeStruct_SlateBrush) == 0x000050, "Member 'UI_Button_Line_C_SetButtonColor::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_SetButtonColor, K2Node_MakeStruct_SlateBrush_1) == 0x000120, "Member 'UI_Button_Line_C_SetButtonColor::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");

// Function UI_Button_Line.UI_Button_Line_C.SetSelectButton
// 0x0050 (0x0050 - 0x0000)
struct UI_Button_Line_C_SetSelectButton final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38E1[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38E2[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x003C(0x0014)()
};
static_assert(alignof(UI_Button_Line_C_SetSelectButton) == 0x000004, "Wrong alignment on UI_Button_Line_C_SetSelectButton");
static_assert(sizeof(UI_Button_Line_C_SetSelectButton) == 0x000050, "Wrong size on UI_Button_Line_C_SetSelectButton");
static_assert(offsetof(UI_Button_Line_C_SetSelectButton, Selected) == 0x000000, "Member 'UI_Button_Line_C_SetSelectButton::Selected' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_SetSelectButton, Temp_bool_Variable) == 0x000001, "Member 'UI_Button_Line_C_SetSelectButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_SetSelectButton, Temp_byte_Variable) == 0x000002, "Member 'UI_Button_Line_C_SetSelectButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_SetSelectButton, Temp_byte_Variable_1) == 0x000003, "Member 'UI_Button_Line_C_SetSelectButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_SetSelectButton, Temp_bool_Variable_1) == 0x000004, "Member 'UI_Button_Line_C_SetSelectButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_SetSelectButton, Temp_bool_Variable_2) == 0x000005, "Member 'UI_Button_Line_C_SetSelectButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_SetSelectButton, Temp_struct_Variable) == 0x000008, "Member 'UI_Button_Line_C_SetSelectButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_SetSelectButton, K2Node_Select_Default) == 0x000018, "Member 'UI_Button_Line_C_SetSelectButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_SetSelectButton, K2Node_Select_Default_1) == 0x00001C, "Member 'UI_Button_Line_C_SetSelectButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_SetSelectButton, K2Node_Select_Default_2) == 0x00002C, "Member 'UI_Button_Line_C_SetSelectButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UI_Button_Line_C_SetSelectButton, K2Node_MakeStruct_SlateColor) == 0x00003C, "Member 'UI_Button_Line_C_SetSelectButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function UI_Button_Line.UI_Button_Line_C.ShowPulse
// 0x0008 (0x0008 - 0x0000)
struct UI_Button_Line_C_ShowPulse final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Button_Line_C_ShowPulse) == 0x000008, "Wrong alignment on UI_Button_Line_C_ShowPulse");
static_assert(sizeof(UI_Button_Line_C_ShowPulse) == 0x000008, "Wrong size on UI_Button_Line_C_ShowPulse");
static_assert(offsetof(UI_Button_Line_C_ShowPulse, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'UI_Button_Line_C_ShowPulse::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

