#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CreateServer

#include "Basic.hpp"

#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_CreateServer.UI_CreateServer_C.ExecuteUbergraph_UI_CreateServer
// 0x01D8 (0x01D8 - 0x0000)
struct UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTask_Multiplayer_RequestServer_C*      CallFunc_CreateAction_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351B[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351C[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351D[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_CustomEvent_ModifiedData;                   // 0x0048(0x0010)(ConstParm, ReferenceParm)
	class FString                                 K2Node_CustomEvent_CustomString;                   // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue_1;               // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351E[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsSuccessful)>            K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351F[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0080(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x00B0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3520[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3521[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<EModifiedData>& ModifiedData, const class FString& CustomString)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTask_Multiplayer_RequestServer_C*      CallFunc_CreateAction_ReturnValue_1;               // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_CreateServer_Map_C*                 CallFunc_Create_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3522[0x3];                                     // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0110(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue_1;                        // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsSuccessful;                   // 0x013F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x0140(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_3;                    // 0x0158(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSelectedOption_ReturnValue;            // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3523[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerState_Menu_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Menu;      // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3524[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer) == 0x000008, "Wrong alignment on UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer");
static_assert(sizeof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer) == 0x0001D8, "Wrong size on UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, EntryPoint) == 0x000000, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_CreateAction_ReturnValue) == 0x000008, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_CreateAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, Temp_bool_IsClosed_Variable) == 0x000010, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, Temp_bool_Has_Been_Initd_Variable) == 0x000011, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, K2Node_Event_IsDesignTime) == 0x00001C, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000028, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000030, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_PlayAnimationForward_ReturnValue) == 0x000040, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, K2Node_CustomEvent_ModifiedData) == 0x000048, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::K2Node_CustomEvent_ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, K2Node_CustomEvent_CustomString) == 0x000058, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::K2Node_CustomEvent_CustomString' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_GetIsEnabled_ReturnValue) == 0x000068, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_GetIsEnabled_ReturnValue_1) == 0x000069, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_GetIsEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_GetText_ReturnValue) == 0x000080, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000098, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_Conv_TextToString_ReturnValue) == 0x0000A0, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_GetDataTableRowNames_OutRowNames) == 0x0000B0, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_Len_ReturnValue) == 0x0000C0, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_Array_Get_Item) == 0x0000C4, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_Less_IntInt_ReturnValue) == 0x0000CC, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D4, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D8, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000E8, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_CreateAction_ReturnValue_1) == 0x0000F0, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_CreateAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_Create_ReturnValue) == 0x0000F8, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_AddChild_ReturnValue) == 0x000100, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_GetChildrenCount_ReturnValue) == 0x000108, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00010C, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_GetText_ReturnValue_1) == 0x000110, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000128, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_Len_ReturnValue_1) == 0x000138, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_Len_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_Less_IntInt_ReturnValue_2) == 0x00013C, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_BooleanAND_ReturnValue) == 0x00013D, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_Not_PreBool_ReturnValue) == 0x00013E, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, K2Node_CustomEvent_IsSuccessful) == 0x00013F, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::K2Node_CustomEvent_IsSuccessful' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_GetText_ReturnValue_2) == 0x000140, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_GetText_ReturnValue_3) == 0x000158, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_GetText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000170, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000180, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_GetSelectedOption_ReturnValue) == 0x000190, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_GetSelectedOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_Conv_NameToString_ReturnValue) == 0x0001A0, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_Conv_StringToInt_ReturnValue) == 0x0001B0, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, K2Node_DynamicCast_AsBP_PG_Player_State_Menu) == 0x0001B8, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::K2Node_DynamicCast_AsBP_PG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, K2Node_DynamicCast_bSuccess_1) == 0x0001C0, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x0001C8, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer, CallFunc_IsValid_ReturnValue) == 0x0001D0, "Member 'UI_CreateServer_C_ExecuteUbergraph_UI_CreateServer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UI_CreateServer.UI_CreateServer_C.OnRequestServerFinished_Event
// 0x0001 (0x0001 - 0x0000)
struct UI_CreateServer_C_OnRequestServerFinished_Event final
{
public:
	bool                                          IsSuccessful;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CreateServer_C_OnRequestServerFinished_Event) == 0x000001, "Wrong alignment on UI_CreateServer_C_OnRequestServerFinished_Event");
static_assert(sizeof(UI_CreateServer_C_OnRequestServerFinished_Event) == 0x000001, "Wrong size on UI_CreateServer_C_OnRequestServerFinished_Event");
static_assert(offsetof(UI_CreateServer_C_OnRequestServerFinished_Event, IsSuccessful) == 0x000000, "Member 'UI_CreateServer_C_OnRequestServerFinished_Event::IsSuccessful' has a wrong offset!");

// Function UI_CreateServer.UI_CreateServer_C.OnUpdatePlayerCombinedInfo_Event
// 0x0020 (0x0020 - 0x0000)
struct UI_CreateServer_C_OnUpdatePlayerCombinedInfo_Event final
{
public:
	TArray<EModifiedData>                         ModifiedData;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 CustomString;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CreateServer_C_OnUpdatePlayerCombinedInfo_Event) == 0x000008, "Wrong alignment on UI_CreateServer_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(sizeof(UI_CreateServer_C_OnUpdatePlayerCombinedInfo_Event) == 0x000020, "Wrong size on UI_CreateServer_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(offsetof(UI_CreateServer_C_OnUpdatePlayerCombinedInfo_Event, ModifiedData) == 0x000000, "Member 'UI_CreateServer_C_OnUpdatePlayerCombinedInfo_Event::ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_OnUpdatePlayerCombinedInfo_Event, CustomString) == 0x000010, "Member 'UI_CreateServer_C_OnUpdatePlayerCombinedInfo_Event::CustomString' has a wrong offset!");

// Function UI_CreateServer.UI_CreateServer_C.ParsePlayerCombinedInfo
// 0x0078 (0x0078 - 0x0000)
struct UI_CreateServer_C_ParsePlayerCombinedInfo final
{
public:
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3525[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3526[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3527[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Menu_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Menu;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3528[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue;          // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3529[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352A[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CreateServer_C_ParsePlayerCombinedInfo) == 0x000008, "Wrong alignment on UI_CreateServer_C_ParsePlayerCombinedInfo");
static_assert(sizeof(UI_CreateServer_C_ParsePlayerCombinedInfo) == 0x000078, "Wrong size on UI_CreateServer_C_ParsePlayerCombinedInfo");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, Temp_bool_True_if_break_was_hit_Variable) == 0x000000, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, K2Node_DynamicCast_AsBP_PG_Player_State_Menu) == 0x000020, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::K2Node_DynamicCast_AsBP_PG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000030, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, CallFunc_GetObjectArrayField_ReturnValue) == 0x000038, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::CallFunc_GetObjectArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, CallFunc_Array_Get_Item) == 0x000050, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, CallFunc_GetStringField_ReturnValue) == 0x000060, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, CallFunc_BooleanAND_ReturnValue) == 0x000070, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000071, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000072, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_ParsePlayerCombinedInfo, CallFunc_BooleanOR_ReturnValue) == 0x000073, "Member 'UI_CreateServer_C_ParsePlayerCombinedInfo::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function UI_CreateServer.UI_CreateServer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_CreateServer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CreateServer_C_PreConstruct) == 0x000001, "Wrong alignment on UI_CreateServer_C_PreConstruct");
static_assert(sizeof(UI_CreateServer_C_PreConstruct) == 0x000001, "Wrong size on UI_CreateServer_C_PreConstruct");
static_assert(offsetof(UI_CreateServer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_CreateServer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_CreateServer.UI_CreateServer_C.SetSelectedMap
// 0x00B0 (0x00B0 - 0x0000)
struct UI_CreateServer_C_SetSelectedMap final
{
public:
	class UUI_CreateServer_Map_C*                 NewMap;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_CreateServer_Map_C*                 L_NewMap;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352B[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352C[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352D[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352E[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352F[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_4;           // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CreateServer_C_SetSelectedMap) == 0x000008, "Wrong alignment on UI_CreateServer_C_SetSelectedMap");
static_assert(sizeof(UI_CreateServer_C_SetSelectedMap) == 0x0000B0, "Wrong size on UI_CreateServer_C_SetSelectedMap");
static_assert(offsetof(UI_CreateServer_C_SetSelectedMap, NewMap) == 0x000000, "Member 'UI_CreateServer_C_SetSelectedMap::NewMap' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_SetSelectedMap, L_NewMap) == 0x000008, "Member 'UI_CreateServer_C_SetSelectedMap::L_NewMap' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_C_SetSelectedMap, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'UI_CreateServer_C_SetSelectedMap::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
