#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Chat

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "POLYGON_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_Chat.UI_Chat_C.AddMessage
// 0x0020 (0x0020 - 0x0000)
struct UI_Chat_C_AddMessage final
{
public:
	struct FGameChatMessage                       Message;                                           // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UI_Chat_C_AddMessage) == 0x000008, "Wrong alignment on UI_Chat_C_AddMessage");
static_assert(sizeof(UI_Chat_C_AddMessage) == 0x000020, "Wrong size on UI_Chat_C_AddMessage");
static_assert(offsetof(UI_Chat_C_AddMessage, Message) == 0x000000, "Member 'UI_Chat_C_AddMessage::Message' has a wrong offset!");

// Function UI_Chat.UI_Chat_C.BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct UI_Chat_C_BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Chat_C_BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on UI_Chat_C_BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(UI_Chat_C_BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on UI_Chat_C_BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(UI_Chat_C_BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'UI_Chat_C_BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'UI_Chat_C_BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function UI_Chat.UI_Chat_C.BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_Chat_C_BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UI_Chat_C_BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on UI_Chat_C_BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(UI_Chat_C_BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature) == 0x000018, "Wrong size on UI_Chat_C_BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(UI_Chat_C_BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'UI_Chat_C_BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function UI_Chat.UI_Chat_C.ExecuteUbergraph_UI_Chat
// 0x0248 (0x0248 - 0x0000)
struct UI_Chat_C_ExecuteUbergraph_UI_Chat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342F[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0010(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3430[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0030(0x0018)()
	struct FGameChatMessage                       CallFunc_Array_Get_Item;                           // 0x0048(0x0020)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3431[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3432[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameChatMessage                       K2Node_CustomEvent_Message;                        // 0x00A0(0x0020)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_ChatMessage_C*                      CallFunc_Create_ReturnValue;                       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3433[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3434[0x6];                                     // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x00F0(0x0018)(ConstParm)
	EMessageType                                  K2Node_CustomEvent_MessageType;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3435[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x010C(0x0008)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3436[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3437[0x6];                                     // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3438[0x6];                                     // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_Game_Character*                     K2Node_DynamicCast_AsPG_Game_Character;            // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3439[0x3];                                     // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x018C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_343A[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_343B[0x2];                                     // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_343C[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x01C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x01C8(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_343D[0x3];                                     // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_343E[0x2];                                     // 0x01EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x01F0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_WordFilter_NewParam;                      // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameChatMessage                       K2Node_MakeStruct_GameChatMessage;                 // 0x0228(0x0020)()
};
static_assert(alignof(UI_Chat_C_ExecuteUbergraph_UI_Chat) == 0x000008, "Wrong alignment on UI_Chat_C_ExecuteUbergraph_UI_Chat");
static_assert(sizeof(UI_Chat_C_ExecuteUbergraph_UI_Chat) == 0x000248, "Wrong size on UI_Chat_C_ExecuteUbergraph_UI_Chat");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, EntryPoint) == 0x000000, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, Temp_bool_IsClosed_Variable) == 0x000008, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, Temp_bool_Has_Been_Initd_Variable) == 0x000009, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, K2Node_ComponentBoundEvent_Text_1) == 0x000010, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, K2Node_ComponentBoundEvent_CommitMethod) == 0x000028, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_GetText_ReturnValue) == 0x000030, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_Array_Get_Item) == 0x000048, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_Conv_TextToString_ReturnValue) == 0x000068, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_Len_ReturnValue) == 0x000078, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_GetOwningPlayer_ReturnValue) == 0x000088, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x000090, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, K2Node_CustomEvent_Message) == 0x0000A0, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0000C0, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_Create_ReturnValue) == 0x0000C8, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_AddChild_ReturnValue) == 0x0000D0, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_Not_PreBool_ReturnValue) == 0x0000D8, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000E0, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000E8, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, K2Node_SwitchEnum_CmpSuccess) == 0x0000E9, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, K2Node_ComponentBoundEvent_Text) == 0x0000F0, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, K2Node_CustomEvent_MessageType) == 0x000108, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::K2Node_CustomEvent_MessageType' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, K2Node_Event_InFocusEvent) == 0x00010C, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_Not_PreBool_ReturnValue_2) == 0x000114, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_GetPlayerController_ReturnValue) == 0x000118, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_GetPlayerController_ReturnValue_1) == 0x000120, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_GetPlayerController_ReturnValue_2) == 0x000128, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x000130, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, K2Node_DynamicCast_bSuccess_1) == 0x000138, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, K2Node_SwitchEnum_CmpSuccess_1) == 0x000139, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_GetActiveWidget_ReturnValue) == 0x000140, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_IsValid_ReturnValue) == 0x000148, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_Not_PreBool_ReturnValue_3) == 0x000149, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_GetPlayerController_ReturnValue_3) == 0x000150, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_GetPlayerController_ReturnValue_4) == 0x000158, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000160, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_GetPlayerController_ReturnValue_5) == 0x000168, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_GetPlayerController_ReturnValue_6) == 0x000170, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_GetPlayerController_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_K2_GetPawn_ReturnValue) == 0x000178, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, K2Node_DynamicCast_AsPG_Game_Character) == 0x000180, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::K2Node_DynamicCast_AsPG_Game_Character' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, K2Node_DynamicCast_bSuccess_2) == 0x000188, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, K2Node_CreateDelegate_OutputDelegate) == 0x00018C, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001A0, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_Not_PreBool_ReturnValue_4) == 0x0001A8, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_BooleanOR_ReturnValue) == 0x0001A9, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001AC, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0001C0, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_GetText_ReturnValue_1) == 0x0001C8, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_TextIsEmpty_ReturnValue) == 0x0001E0, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, Temp_int_Loop_Counter_Variable) == 0x0001E4, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_Not_PreBool_ReturnValue_5) == 0x0001E8, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001E9, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_Add_IntInt_ReturnValue) == 0x0001EC, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_GetText_ReturnValue_2) == 0x0001F0, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000208, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, CallFunc_WordFilter_NewParam) == 0x000218, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::CallFunc_WordFilter_NewParam' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_ExecuteUbergraph_UI_Chat, K2Node_MakeStruct_GameChatMessage) == 0x000228, "Member 'UI_Chat_C_ExecuteUbergraph_UI_Chat::K2Node_MakeStruct_GameChatMessage' has a wrong offset!");

// Function UI_Chat.UI_Chat_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UI_Chat_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UI_Chat_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on UI_Chat_C_OnAddedToFocusPath");
static_assert(sizeof(UI_Chat_C_OnAddedToFocusPath) == 0x000008, "Wrong size on UI_Chat_C_OnAddedToFocusPath");
static_assert(offsetof(UI_Chat_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'UI_Chat_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function UI_Chat.UI_Chat_C.OnKeyDown
// 0x02C0 (0x02C0 - 0x0000)
struct UI_Chat_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0148(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_343F[0x6];                                     // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x0208(0x00B8)()
};
static_assert(alignof(UI_Chat_C_OnKeyDown) == 0x000008, "Wrong alignment on UI_Chat_C_OnKeyDown");
static_assert(sizeof(UI_Chat_C_OnKeyDown) == 0x0002C0, "Wrong size on UI_Chat_C_OnKeyDown");
static_assert(offsetof(UI_Chat_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'UI_Chat_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'UI_Chat_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_OnKeyDown, ReturnValue) == 0x000078, "Member 'UI_Chat_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000130, "Member 'UI_Chat_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000148, "Member 'UI_Chat_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000200, "Member 'UI_Chat_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000201, "Member 'UI_Chat_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_OnKeyDown, CallFunc_Handled_ReturnValue_1) == 0x000208, "Member 'UI_Chat_C_OnKeyDown::CallFunc_Handled_ReturnValue_1' has a wrong offset!");

// Function UI_Chat.UI_Chat_C.SelectMessageType
// 0x0001 (0x0001 - 0x0000)
struct UI_Chat_C_SelectMessageType final
{
public:
	EMessageType                                  Param_MessageType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Chat_C_SelectMessageType) == 0x000001, "Wrong alignment on UI_Chat_C_SelectMessageType");
static_assert(sizeof(UI_Chat_C_SelectMessageType) == 0x000001, "Wrong size on UI_Chat_C_SelectMessageType");
static_assert(offsetof(UI_Chat_C_SelectMessageType, Param_MessageType) == 0x000000, "Member 'UI_Chat_C_SelectMessageType::Param_MessageType' has a wrong offset!");

// Function UI_Chat.UI_Chat_C.SortBadWordsList
// 0x0050 (0x0050 - 0x0000)
struct UI_Chat_C_SortBadWordsList final
{
public:
	bool                                          L_Continue;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3440[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3441[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue_1;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Chat_C_SortBadWordsList) == 0x000008, "Wrong alignment on UI_Chat_C_SortBadWordsList");
static_assert(sizeof(UI_Chat_C_SortBadWordsList) == 0x000050, "Wrong size on UI_Chat_C_SortBadWordsList");
static_assert(offsetof(UI_Chat_C_SortBadWordsList, L_Continue) == 0x000000, "Member 'UI_Chat_C_SortBadWordsList::L_Continue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_SortBadWordsList, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UI_Chat_C_SortBadWordsList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_SortBadWordsList, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UI_Chat_C_SortBadWordsList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_SortBadWordsList, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'UI_Chat_C_SortBadWordsList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_SortBadWordsList, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000010, "Member 'UI_Chat_C_SortBadWordsList::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_SortBadWordsList, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'UI_Chat_C_SortBadWordsList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_SortBadWordsList, CallFunc_Array_Get_Item) == 0x000018, "Member 'UI_Chat_C_SortBadWordsList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_SortBadWordsList, CallFunc_Add_IntInt_ReturnValue_2) == 0x000028, "Member 'UI_Chat_C_SortBadWordsList::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_SortBadWordsList, CallFunc_Len_ReturnValue) == 0x00002C, "Member 'UI_Chat_C_SortBadWordsList::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_SortBadWordsList, CallFunc_Array_Get_Item_1) == 0x000030, "Member 'UI_Chat_C_SortBadWordsList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_SortBadWordsList, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'UI_Chat_C_SortBadWordsList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_SortBadWordsList, CallFunc_Len_ReturnValue_1) == 0x000044, "Member 'UI_Chat_C_SortBadWordsList::CallFunc_Len_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_SortBadWordsList, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'UI_Chat_C_SortBadWordsList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_SortBadWordsList, CallFunc_Greater_IntInt_ReturnValue) == 0x000049, "Member 'UI_Chat_C_SortBadWordsList::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function UI_Chat.UI_Chat_C.WordFilter
// 0x0090 (0x0090 - 0x0000)
struct UI_Chat_C_WordFilter final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NewParam;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 L_BadWord;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 L_Message;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3442[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3443[0x1];                                     // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3444[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Chat_C_WordFilter) == 0x000008, "Wrong alignment on UI_Chat_C_WordFilter");
static_assert(sizeof(UI_Chat_C_WordFilter) == 0x000090, "Wrong size on UI_Chat_C_WordFilter");
static_assert(offsetof(UI_Chat_C_WordFilter, Message) == 0x000000, "Member 'UI_Chat_C_WordFilter::Message' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_WordFilter, NewParam) == 0x000010, "Member 'UI_Chat_C_WordFilter::NewParam' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_WordFilter, L_BadWord) == 0x000020, "Member 'UI_Chat_C_WordFilter::L_BadWord' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_WordFilter, L_Message) == 0x000030, "Member 'UI_Chat_C_WordFilter::L_Message' has a wrong offset!");
static_assert(offsetof(UI_Chat_C_WordFilter, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'UI_Chat_C_WordFilter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
