#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CameraTransitions_DarkenScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CameraTransitions_DarkenScreen.UI_CameraTransitions_DarkenScreen_C
// 0x0038 (0x02B8 - 0x0280)
class UUI_CameraTransitions_DarkenScreen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          SmoothStart;                                       // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3E89[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TargetOpacity;                                     // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InterpSpeed;                                       // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          AutoSmoothRemove;                                  // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3E8A[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnDark;                                            // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_UI_CameraTransitions_DarkenScreen(int32 EntryPoint);
	void OnDark__DelegateSignature();
	void SmoothRemove();
	void SmoothStartEvent();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_CameraTransitions_DarkenScreen_C">();
	}
	static class UUI_CameraTransitions_DarkenScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CameraTransitions_DarkenScreen_C>();
	}
};
static_assert(alignof(UUI_CameraTransitions_DarkenScreen_C) == 0x000008, "Wrong alignment on UUI_CameraTransitions_DarkenScreen_C");
static_assert(sizeof(UUI_CameraTransitions_DarkenScreen_C) == 0x0002B8, "Wrong size on UUI_CameraTransitions_DarkenScreen_C");
static_assert(offsetof(UUI_CameraTransitions_DarkenScreen_C, UberGraphFrame) == 0x000280, "Member 'UUI_CameraTransitions_DarkenScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_CameraTransitions_DarkenScreen_C, SmoothStart) == 0x000288, "Member 'UUI_CameraTransitions_DarkenScreen_C::SmoothStart' has a wrong offset!");
static_assert(offsetof(UUI_CameraTransitions_DarkenScreen_C, TargetOpacity) == 0x000290, "Member 'UUI_CameraTransitions_DarkenScreen_C::TargetOpacity' has a wrong offset!");
static_assert(offsetof(UUI_CameraTransitions_DarkenScreen_C, InterpSpeed) == 0x000298, "Member 'UUI_CameraTransitions_DarkenScreen_C::InterpSpeed' has a wrong offset!");
static_assert(offsetof(UUI_CameraTransitions_DarkenScreen_C, AutoSmoothRemove) == 0x0002A0, "Member 'UUI_CameraTransitions_DarkenScreen_C::AutoSmoothRemove' has a wrong offset!");
static_assert(offsetof(UUI_CameraTransitions_DarkenScreen_C, OnDark) == 0x0002A8, "Member 'UUI_CameraTransitions_DarkenScreen_C::OnDark' has a wrong offset!");

}

