#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CreateServer_Map

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_CreateServer_Map.UI_CreateServer_Map_C.ExecuteUbergraph_UI_CreateServer_Map
// 0x0140 (0x0140 - 0x0000)
struct UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMapInfo                               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x00E8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34B4[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34B5[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34B6[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map) == 0x000008, "Wrong alignment on UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map");
static_assert(sizeof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map) == 0x000140, "Wrong size on UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map");
static_assert(offsetof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map, EntryPoint) == 0x000000, "Member 'UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map, Temp_bool_Variable) == 0x000004, "Member 'UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map, Temp_byte_Variable) == 0x000005, "Member 'UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map, Temp_byte_Variable_1) == 0x000006, "Member 'UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map, K2Node_Event_IsDesignTime) == 0x000007, "Member 'UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000F0, "Member 'UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map, K2Node_CreateDelegate_OutputDelegate) == 0x0000F4, "Member 'UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map, CallFunc_GetPlayerController_ReturnValue) == 0x000108, "Member 'UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000110, "Member 'UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map, Temp_object_Variable) == 0x000120, "Member 'UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map, K2Node_CustomEvent_Loaded) == 0x000128, "Member 'UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map, K2Node_DynamicCast_AsTexture_2D) == 0x000130, "Member 'UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map, K2Node_DynamicCast_bSuccess_1) == 0x000138, "Member 'UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map, K2Node_Select_Default) == 0x000139, "Member 'UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map, K2Node_SwitchName_CmpSuccess) == 0x00013A, "Member 'UI_CreateServer_Map_C_ExecuteUbergraph_UI_CreateServer_Map::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function UI_CreateServer_Map.UI_CreateServer_Map_C.OnLoaded_DA5993E345895BD97ADA908C3FAFD98A
// 0x0008 (0x0008 - 0x0000)
struct UI_CreateServer_Map_C_OnLoaded_DA5993E345895BD97ADA908C3FAFD98A final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CreateServer_Map_C_OnLoaded_DA5993E345895BD97ADA908C3FAFD98A) == 0x000008, "Wrong alignment on UI_CreateServer_Map_C_OnLoaded_DA5993E345895BD97ADA908C3FAFD98A");
static_assert(sizeof(UI_CreateServer_Map_C_OnLoaded_DA5993E345895BD97ADA908C3FAFD98A) == 0x000008, "Wrong size on UI_CreateServer_Map_C_OnLoaded_DA5993E345895BD97ADA908C3FAFD98A");
static_assert(offsetof(UI_CreateServer_Map_C_OnLoaded_DA5993E345895BD97ADA908C3FAFD98A, Loaded) == 0x000000, "Member 'UI_CreateServer_Map_C_OnLoaded_DA5993E345895BD97ADA908C3FAFD98A::Loaded' has a wrong offset!");

// Function UI_CreateServer_Map.UI_CreateServer_Map_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_CreateServer_Map_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CreateServer_Map_C_PreConstruct) == 0x000001, "Wrong alignment on UI_CreateServer_Map_C_PreConstruct");
static_assert(sizeof(UI_CreateServer_Map_C_PreConstruct) == 0x000001, "Wrong size on UI_CreateServer_Map_C_PreConstruct");
static_assert(offsetof(UI_CreateServer_Map_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_CreateServer_Map_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_CreateServer_Map.UI_CreateServer_Map_C.SetMapSize
// 0x0002 (0x0002 - 0x0000)
struct UI_CreateServer_Map_C_SetMapSize final
{
public:
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CreateServer_Map_C_SetMapSize) == 0x000001, "Wrong alignment on UI_CreateServer_Map_C_SetMapSize");
static_assert(sizeof(UI_CreateServer_Map_C_SetMapSize) == 0x000002, "Wrong size on UI_CreateServer_Map_C_SetMapSize");
static_assert(offsetof(UI_CreateServer_Map_C_SetMapSize, CallFunc_Less_IntInt_ReturnValue) == 0x000000, "Member 'UI_CreateServer_Map_C_SetMapSize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_SetMapSize, CallFunc_Less_IntInt_ReturnValue_1) == 0x000001, "Member 'UI_CreateServer_Map_C_SetMapSize::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function UI_CreateServer_Map.UI_CreateServer_Map_C.SetSelected
// 0x004C (0x004C - 0x0000)
struct UI_CreateServer_Map_C_SetSelected final
{
public:
	bool                                          Param_IsSelected;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34B7[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0014)()
};
static_assert(alignof(UI_CreateServer_Map_C_SetSelected) == 0x000004, "Wrong alignment on UI_CreateServer_Map_C_SetSelected");
static_assert(sizeof(UI_CreateServer_Map_C_SetSelected) == 0x00004C, "Wrong size on UI_CreateServer_Map_C_SetSelected");
static_assert(offsetof(UI_CreateServer_Map_C_SetSelected, Param_IsSelected) == 0x000000, "Member 'UI_CreateServer_Map_C_SetSelected::Param_IsSelected' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'UI_CreateServer_Map_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_SetSelected, Temp_struct_Variable) == 0x000004, "Member 'UI_CreateServer_Map_C_SetSelected::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_SetSelected, Temp_struct_Variable_1) == 0x000014, "Member 'UI_CreateServer_Map_C_SetSelected::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_SetSelected, Temp_bool_Variable_1) == 0x000024, "Member 'UI_CreateServer_Map_C_SetSelected::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_SetSelected, Temp_byte_Variable) == 0x000025, "Member 'UI_CreateServer_Map_C_SetSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_SetSelected, Temp_byte_Variable_1) == 0x000026, "Member 'UI_CreateServer_Map_C_SetSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_SetSelected, K2Node_Select_Default) == 0x000027, "Member 'UI_CreateServer_Map_C_SetSelected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_SetSelected, K2Node_Select_Default_1) == 0x000028, "Member 'UI_CreateServer_Map_C_SetSelected::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_CreateServer_Map_C_SetSelected, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'UI_CreateServer_Map_C_SetSelected::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

