#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CaptureProcess

#include "Basic.hpp"

#include "POLYGON_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_CaptureProcess.UI_CaptureProcess_C.ExecuteUbergraph_UI_CaptureProcess
// 0x00C8 (0x00C8 - 0x0000)
struct UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ECD[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ECE[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ECF[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCapturePointsByTeam_MyTeam;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCapturePointsByTeam_OpponentTeam;      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED0[0x1];                                     // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCapturePointsByTeam_MyTeam_1;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCapturePointsByTeam_OpponentTeam_1;    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED1[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0054(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED2[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Current_ImplicitCast;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess) == 0x000008, "Wrong alignment on UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess");
static_assert(sizeof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess) == 0x0000C8, "Wrong size on UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, EntryPoint) == 0x000000, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_Max_ReturnValue) == 0x000010, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x000030, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_GetCapturePointsByTeam_MyTeam) == 0x00003C, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_GetCapturePointsByTeam_MyTeam' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_GetCapturePointsByTeam_OpponentTeam) == 0x000040, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_GetCapturePointsByTeam_OpponentTeam' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000044, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000045, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_BooleanAND_ReturnValue) == 0x000046, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_GetCapturePointsByTeam_MyTeam_1) == 0x000048, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_GetCapturePointsByTeam_MyTeam_1' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_GetCapturePointsByTeam_OpponentTeam_1) == 0x00004C, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_GetCapturePointsByTeam_OpponentTeam_1' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_Greater_IntInt_ReturnValue) == 0x000050, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, K2Node_Event_MyGeometry) == 0x000054, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, K2Node_Event_InDeltaTime) == 0x00008C, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000090, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_FInterpTo_ReturnValue) == 0x000098, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_Max_ReturnValue_1) == 0x0000A0, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000A8, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000B0, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_FInterpTo_Current_ImplicitCast) == 0x0000B8, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_FInterpTo_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0000C0, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess, CallFunc_SetPercent_InPercent_ImplicitCast_1) == 0x0000C4, "Member 'UI_CaptureProcess_C_ExecuteUbergraph_UI_CaptureProcess::CallFunc_SetPercent_InPercent_ImplicitCast_1' has a wrong offset!");

// Function UI_CaptureProcess.UI_CaptureProcess_C.GetCapturePointsByTeam
// 0x0010 (0x0010 - 0x0000)
struct UI_CaptureProcess_C_GetCapturePointsByTeam final
{
public:
	ETeam                                         Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED3[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MyTeam;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OpponentTeam;                                      // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CaptureProcess_C_GetCapturePointsByTeam) == 0x000004, "Wrong alignment on UI_CaptureProcess_C_GetCapturePointsByTeam");
static_assert(sizeof(UI_CaptureProcess_C_GetCapturePointsByTeam) == 0x000010, "Wrong size on UI_CaptureProcess_C_GetCapturePointsByTeam");
static_assert(offsetof(UI_CaptureProcess_C_GetCapturePointsByTeam, Team) == 0x000000, "Member 'UI_CaptureProcess_C_GetCapturePointsByTeam::Team' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_GetCapturePointsByTeam, MyTeam) == 0x000004, "Member 'UI_CaptureProcess_C_GetCapturePointsByTeam::MyTeam' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_GetCapturePointsByTeam, OpponentTeam) == 0x000008, "Member 'UI_CaptureProcess_C_GetCapturePointsByTeam::OpponentTeam' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_GetCapturePointsByTeam, K2Node_SwitchEnum_CmpSuccess) == 0x00000C, "Member 'UI_CaptureProcess_C_GetCapturePointsByTeam::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UI_CaptureProcess.UI_CaptureProcess_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_CaptureProcess_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CaptureProcess_C_PreConstruct) == 0x000001, "Wrong alignment on UI_CaptureProcess_C_PreConstruct");
static_assert(sizeof(UI_CaptureProcess_C_PreConstruct) == 0x000001, "Wrong size on UI_CaptureProcess_C_PreConstruct");
static_assert(offsetof(UI_CaptureProcess_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_CaptureProcess_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_CaptureProcess.UI_CaptureProcess_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_CaptureProcess_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CaptureProcess_C_Tick) == 0x000004, "Wrong alignment on UI_CaptureProcess_C_Tick");
static_assert(sizeof(UI_CaptureProcess_C_Tick) == 0x00003C, "Wrong size on UI_CaptureProcess_C_Tick");
static_assert(offsetof(UI_CaptureProcess_C_Tick, MyGeometry) == 0x000000, "Member 'UI_CaptureProcess_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_CaptureProcess_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_CaptureProcess_C_Tick::InDeltaTime' has a wrong offset!");

}

