#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Counter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Counter.UI_Counter_C
// 0x0050 (0x02D0 - 0x0280)
class UUI_Counter_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Image;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hovered;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Plus;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Counter;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsPremium;                                         // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3857[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnClickDelegate;                                   // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_UI_Counter(int32 EntryPoint);
	void OnClickDelegate__DelegateSignature(class UUI_Counter_C* Counter);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Counter_C">();
	}
	static class UUI_Counter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Counter_C>();
	}
};
static_assert(alignof(UUI_Counter_C) == 0x000008, "Wrong alignment on UUI_Counter_C");
static_assert(sizeof(UUI_Counter_C) == 0x0002D0, "Wrong size on UUI_Counter_C");
static_assert(offsetof(UUI_Counter_C, UberGraphFrame) == 0x000280, "Member 'UUI_Counter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Counter_C, Button) == 0x000288, "Member 'UUI_Counter_C::Button' has a wrong offset!");
static_assert(offsetof(UUI_Counter_C, Image) == 0x000290, "Member 'UUI_Counter_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_Counter_C, Image_Hovered) == 0x000298, "Member 'UUI_Counter_C::Image_Hovered' has a wrong offset!");
static_assert(offsetof(UUI_Counter_C, Image_Plus) == 0x0002A0, "Member 'UUI_Counter_C::Image_Plus' has a wrong offset!");
static_assert(offsetof(UUI_Counter_C, TextBlock_Counter) == 0x0002A8, "Member 'UUI_Counter_C::TextBlock_Counter' has a wrong offset!");
static_assert(offsetof(UUI_Counter_C, Icon) == 0x0002B0, "Member 'UUI_Counter_C::Icon' has a wrong offset!");
static_assert(offsetof(UUI_Counter_C, IsPremium) == 0x0002B8, "Member 'UUI_Counter_C::IsPremium' has a wrong offset!");
static_assert(offsetof(UUI_Counter_C, OnClickDelegate) == 0x0002C0, "Member 'UUI_Counter_C::OnClickDelegate' has a wrong offset!");

}

