#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CreateServer_Map

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "POLYGON_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CreateServer_Map.UI_CreateServer_Map_C
// 0x0138 (0x03B8 - 0x0280)
class UUI_CreateServer_Map_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Base;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_IsNew;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Selected;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Name;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Size;                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   ID;                                                // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34B3[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapInfo                               MapInfo;                                           // 0x02D0(0x00E8)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__UI_CreateServer_Map_Button_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__UI_CreateServer_Map_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_CreateServer_Map_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_UI_CreateServer_Map(int32 EntryPoint);
	void OnLoaded_DA5993E345895BD97ADA908C3FAFD98A(class UObject* Loaded);
	void PreConstruct(bool IsDesignTime);
	void SetMapSize();
	void SetSelected(bool Param_IsSelected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_CreateServer_Map_C">();
	}
	static class UUI_CreateServer_Map_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CreateServer_Map_C>();
	}
};
static_assert(alignof(UUI_CreateServer_Map_C) == 0x000008, "Wrong alignment on UUI_CreateServer_Map_C");
static_assert(sizeof(UUI_CreateServer_Map_C) == 0x0003B8, "Wrong size on UUI_CreateServer_Map_C");
static_assert(offsetof(UUI_CreateServer_Map_C, UberGraphFrame) == 0x000280, "Member 'UUI_CreateServer_Map_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_CreateServer_Map_C, Border_Base) == 0x000288, "Member 'UUI_CreateServer_Map_C::Border_Base' has a wrong offset!");
static_assert(offsetof(UUI_CreateServer_Map_C, Border_IsNew) == 0x000290, "Member 'UUI_CreateServer_Map_C::Border_IsNew' has a wrong offset!");
static_assert(offsetof(UUI_CreateServer_Map_C, Button) == 0x000298, "Member 'UUI_CreateServer_Map_C::Button' has a wrong offset!");
static_assert(offsetof(UUI_CreateServer_Map_C, Image) == 0x0002A0, "Member 'UUI_CreateServer_Map_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_CreateServer_Map_C, Overlay_Selected) == 0x0002A8, "Member 'UUI_CreateServer_Map_C::Overlay_Selected' has a wrong offset!");
static_assert(offsetof(UUI_CreateServer_Map_C, TextBlock_Name) == 0x0002B0, "Member 'UUI_CreateServer_Map_C::TextBlock_Name' has a wrong offset!");
static_assert(offsetof(UUI_CreateServer_Map_C, WidgetSwitcher_Size) == 0x0002B8, "Member 'UUI_CreateServer_Map_C::WidgetSwitcher_Size' has a wrong offset!");
static_assert(offsetof(UUI_CreateServer_Map_C, ID) == 0x0002C0, "Member 'UUI_CreateServer_Map_C::ID' has a wrong offset!");
static_assert(offsetof(UUI_CreateServer_Map_C, IsSelected) == 0x0002C8, "Member 'UUI_CreateServer_Map_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UUI_CreateServer_Map_C, MapInfo) == 0x0002D0, "Member 'UUI_CreateServer_Map_C::MapInfo' has a wrong offset!");

}

