#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Chat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "POLYGON_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Chat.UI_Chat_C
// 0x0090 (0x0310 - 0x0280)
class UUI_Chat_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Warning;                                           // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HiddenChat;                                        // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_CloseChat;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_MessageType;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          EditableText_Message;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Chat;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Message;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_MessageType;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Main;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              PlayerState;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ChatIsOpened;                                      // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342D[0x7];                                     // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Timer_PlayAnimation;                               // 0x02E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer_HiddenChat;                                  // 0x02F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EMessageType                                  MessageType;                                       // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShowedMouseCursor;                               // 0x02F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342E[0x6];                                     // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         BadWordsList;                                      // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddMessage(const struct FGameChatMessage& Message);
	void BndEvt__Button_CloseChat_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_MessageType_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__EditableText_Message_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void CloseChat();
	void Construct();
	void ExecuteUbergraph_UI_Chat(int32 EntryPoint);
	void HiddenChatEvent();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OpenChat();
	void PlayAnimationEvent();
	void SelectMessageType(EMessageType Param_MessageType);
	void SendMessage();
	void SortBadWordsList();
	void StartPlayAnimationHiddenChat();
	void WordFilter(const class FString& Message, class FString* NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Chat_C">();
	}
	static class UUI_Chat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Chat_C>();
	}
};
static_assert(alignof(UUI_Chat_C) == 0x000008, "Wrong alignment on UUI_Chat_C");
static_assert(sizeof(UUI_Chat_C) == 0x000310, "Wrong size on UUI_Chat_C");
static_assert(offsetof(UUI_Chat_C, UberGraphFrame) == 0x000280, "Member 'UUI_Chat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Chat_C, Warning) == 0x000288, "Member 'UUI_Chat_C::Warning' has a wrong offset!");
static_assert(offsetof(UUI_Chat_C, HiddenChat) == 0x000290, "Member 'UUI_Chat_C::HiddenChat' has a wrong offset!");
static_assert(offsetof(UUI_Chat_C, Border) == 0x000298, "Member 'UUI_Chat_C::Border' has a wrong offset!");
static_assert(offsetof(UUI_Chat_C, Button_CloseChat) == 0x0002A0, "Member 'UUI_Chat_C::Button_CloseChat' has a wrong offset!");
static_assert(offsetof(UUI_Chat_C, Button_MessageType) == 0x0002A8, "Member 'UUI_Chat_C::Button_MessageType' has a wrong offset!");
static_assert(offsetof(UUI_Chat_C, EditableText_Message) == 0x0002B0, "Member 'UUI_Chat_C::EditableText_Message' has a wrong offset!");
static_assert(offsetof(UUI_Chat_C, ScrollBox_Chat) == 0x0002B8, "Member 'UUI_Chat_C::ScrollBox_Chat' has a wrong offset!");
static_assert(offsetof(UUI_Chat_C, ScrollBox_Message) == 0x0002C0, "Member 'UUI_Chat_C::ScrollBox_Message' has a wrong offset!");
static_assert(offsetof(UUI_Chat_C, TextBlock_MessageType) == 0x0002C8, "Member 'UUI_Chat_C::TextBlock_MessageType' has a wrong offset!");
static_assert(offsetof(UUI_Chat_C, WidgetSwitcher_Main) == 0x0002D0, "Member 'UUI_Chat_C::WidgetSwitcher_Main' has a wrong offset!");
static_assert(offsetof(UUI_Chat_C, PlayerState) == 0x0002D8, "Member 'UUI_Chat_C::PlayerState' has a wrong offset!");
static_assert(offsetof(UUI_Chat_C, ChatIsOpened) == 0x0002E0, "Member 'UUI_Chat_C::ChatIsOpened' has a wrong offset!");
static_assert(offsetof(UUI_Chat_C, Timer_PlayAnimation) == 0x0002E8, "Member 'UUI_Chat_C::Timer_PlayAnimation' has a wrong offset!");
static_assert(offsetof(UUI_Chat_C, Timer_HiddenChat) == 0x0002F0, "Member 'UUI_Chat_C::Timer_HiddenChat' has a wrong offset!");
static_assert(offsetof(UUI_Chat_C, MessageType) == 0x0002F8, "Member 'UUI_Chat_C::MessageType' has a wrong offset!");
static_assert(offsetof(UUI_Chat_C, IsShowedMouseCursor) == 0x0002F9, "Member 'UUI_Chat_C::IsShowedMouseCursor' has a wrong offset!");
static_assert(offsetof(UUI_Chat_C, BadWordsList) == 0x000300, "Member 'UUI_Chat_C::BadWordsList' has a wrong offset!");

}

