#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CaptureProcess

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CaptureProcess.UI_CaptureProcess_C
// 0x0038 (0x02B8 - 0x0280)
class UUI_CaptureProcess_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Process;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Lines;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Process;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ControlPointMarker_C*               UI_ControlPointMarker;                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AControlPoint*                          ControlPointReference;                             // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              PlayerState;                                       // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_CaptureProcess(int32 EntryPoint);
	void GetCapturePointsByTeam(ETeam Team, int32* MyTeam, int32* OpponentTeam);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_CaptureProcess_C">();
	}
	static class UUI_CaptureProcess_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CaptureProcess_C>();
	}
};
static_assert(alignof(UUI_CaptureProcess_C) == 0x000008, "Wrong alignment on UUI_CaptureProcess_C");
static_assert(sizeof(UUI_CaptureProcess_C) == 0x0002B8, "Wrong size on UUI_CaptureProcess_C");
static_assert(offsetof(UUI_CaptureProcess_C, UberGraphFrame) == 0x000280, "Member 'UUI_CaptureProcess_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_CaptureProcess_C, Border_Process) == 0x000288, "Member 'UUI_CaptureProcess_C::Border_Process' has a wrong offset!");
static_assert(offsetof(UUI_CaptureProcess_C, Image_Lines) == 0x000290, "Member 'UUI_CaptureProcess_C::Image_Lines' has a wrong offset!");
static_assert(offsetof(UUI_CaptureProcess_C, ProgressBar_Process) == 0x000298, "Member 'UUI_CaptureProcess_C::ProgressBar_Process' has a wrong offset!");
static_assert(offsetof(UUI_CaptureProcess_C, UI_ControlPointMarker) == 0x0002A0, "Member 'UUI_CaptureProcess_C::UI_ControlPointMarker' has a wrong offset!");
static_assert(offsetof(UUI_CaptureProcess_C, ControlPointReference) == 0x0002A8, "Member 'UUI_CaptureProcess_C::ControlPointReference' has a wrong offset!");
static_assert(offsetof(UUI_CaptureProcess_C, PlayerState) == 0x0002B0, "Member 'UUI_CaptureProcess_C::PlayerState' has a wrong offset!");

}

