#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CurrencyConversion

#include "Basic.hpp"

#include "PlayFab_structs.hpp"
#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_CurrencyConversion.UI_CurrencyConversion_C.BndEvt__UI_CurrencyConversion_EditableTextBox_ConvertiblePC_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_CurrencyConversion_C_BndEvt__UI_CurrencyConversion_EditableTextBox_ConvertiblePC_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UI_CurrencyConversion_C_BndEvt__UI_CurrencyConversion_EditableTextBox_ConvertiblePC_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on UI_CurrencyConversion_C_BndEvt__UI_CurrencyConversion_EditableTextBox_ConvertiblePC_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(UI_CurrencyConversion_C_BndEvt__UI_CurrencyConversion_EditableTextBox_ConvertiblePC_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on UI_CurrencyConversion_C_BndEvt__UI_CurrencyConversion_EditableTextBox_ConvertiblePC_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(UI_CurrencyConversion_C_BndEvt__UI_CurrencyConversion_EditableTextBox_ConvertiblePC_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'UI_CurrencyConversion_C_BndEvt__UI_CurrencyConversion_EditableTextBox_ConvertiblePC_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function UI_CurrencyConversion.UI_CurrencyConversion_C.ConvertCurrency_Failure
// 0x0040 (0x0040 - 0x0000)
struct UI_CurrencyConversion_C_ConvertCurrency_Failure final
{
public:
	struct FPlayFabError                          Error;                                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CurrencyConversion_C_ConvertCurrency_Failure) == 0x000008, "Wrong alignment on UI_CurrencyConversion_C_ConvertCurrency_Failure");
static_assert(sizeof(UI_CurrencyConversion_C_ConvertCurrency_Failure) == 0x000040, "Wrong size on UI_CurrencyConversion_C_ConvertCurrency_Failure");
static_assert(offsetof(UI_CurrencyConversion_C_ConvertCurrency_Failure, Error) == 0x000000, "Member 'UI_CurrencyConversion_C_ConvertCurrency_Failure::Error' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ConvertCurrency_Failure, CustomData) == 0x000038, "Member 'UI_CurrencyConversion_C_ConvertCurrency_Failure::CustomData' has a wrong offset!");

// Function UI_CurrencyConversion.UI_CurrencyConversion_C.ConvertCurrency_Success
// 0x0068 (0x0068 - 0x0000)
struct UI_CurrencyConversion_C_ConvertCurrency_Success final
{
public:
	struct FClientExecuteCloudScriptResult        Result;                                            // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CurrencyConversion_C_ConvertCurrency_Success) == 0x000008, "Wrong alignment on UI_CurrencyConversion_C_ConvertCurrency_Success");
static_assert(sizeof(UI_CurrencyConversion_C_ConvertCurrency_Success) == 0x000068, "Wrong size on UI_CurrencyConversion_C_ConvertCurrency_Success");
static_assert(offsetof(UI_CurrencyConversion_C_ConvertCurrency_Success, Result) == 0x000000, "Member 'UI_CurrencyConversion_C_ConvertCurrency_Success::Result' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ConvertCurrency_Success, CustomData) == 0x000060, "Member 'UI_CurrencyConversion_C_ConvertCurrency_Success::CustomData' has a wrong offset!");

// Function UI_CurrencyConversion.UI_CurrencyConversion_C.ExecuteUbergraph_UI_CurrencyConversion
// 0x0458 (0x0458 - 0x0000)
struct UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3881[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x0010(0x0040)()
	TDelegate<void(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3882[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerState_Menu_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Menu;      // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3883[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3884[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3885[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00A8(0x0018)()
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3886[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00C8(0x0018)()
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x00E0(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3887[0x6];                                     // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0100(0x0018)()
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3888[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0120(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0138(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3889[0x3];                                     // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0168(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue;                    // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_388A[0x1];                                     // 0x0197(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x0198(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_2;           // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_388B[0x3];                                     // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result;                         // 0x01C8(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x0230(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_388C[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0278(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0290(0x0018)()
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x02A8(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_388D[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptRequest       K2Node_MakeStruct_ClientExecuteCloudScriptRequest; // 0x0310(0x0030)()
	class UPlayFabClientAPI*                      CallFunc_ExecuteCloudScript_ReturnValue;           // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0348(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_388E[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_388F[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3890[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_WarningNoPC_C*                 CallFunc_Create_ReturnValue;                       // 0x0388(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3891[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_1;      // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_2;      // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_2;             // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_1;             // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_2;             // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Menu_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Menu_1;    // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3892[0x7];                                     // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_3;      // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x0400(0x0010)(ConstParm, ReferenceParm)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_3;             // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_3;             // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3893[0x3];                                     // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast;       // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3894[0x4];                                     // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast_1;     // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast_2;     // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Round_A_ImplicitCast_1;                   // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion) == 0x000008, "Wrong alignment on UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion");
static_assert(sizeof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion) == 0x000458, "Wrong size on UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, EntryPoint) == 0x000000, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, Temp_bool_Variable) == 0x000004, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, Temp_object_Variable) == 0x000008, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, Temp_struct_Variable) == 0x000010, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, Temp_bool_Has_Been_Initd_Variable) == 0x000070, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_DynamicCast_AsBP_PG_Player_State_Menu) == 0x000078, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_DynamicCast_AsBP_PG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000088, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetObjectField_ReturnValue) == 0x000090, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, Temp_bool_IsClosed_Variable) == 0x000098, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetNumberField_ReturnValue) == 0x00009C, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Round_ReturnValue) == 0x0000A0, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Conv_IntToText_ReturnValue) == 0x0000A8, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Multiply_IntInt_ReturnValue) == 0x0000C0, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000C8, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_ComponentBoundEvent_Text) == 0x0000E0, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_TextIsEmpty_ReturnValue) == 0x0000F8, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Not_PreBool_ReturnValue) == 0x0000F9, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000100, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000118, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000120, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetText_ReturnValue) == 0x000138, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Conv_TextToString_ReturnValue) == 0x000150, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Conv_StringToInt_ReturnValue) == 0x000160, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Greater_IntInt_ReturnValue) == 0x000164, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetText_ReturnValue_1) == 0x000168, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000180, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Conv_StringToInt_ReturnValue_1) == 0x000190, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Conv_StringToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_IsNumeric_ReturnValue) == 0x000194, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_IsNumeric_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Less_IntInt_ReturnValue) == 0x000195, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_BooleanAND_ReturnValue) == 0x000196, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetText_ReturnValue_2) == 0x000198, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0001B0, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Conv_StringToInt_ReturnValue_2) == 0x0001C0, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Conv_StringToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001C4, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_CustomEvent_result) == 0x0001C8, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_CustomEvent_result' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_CustomEvent_customData_1) == 0x000228, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_CustomEvent_customData_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_CustomEvent_error) == 0x000230, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_CustomEvent_error' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_CustomEvent_customData) == 0x000268, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_CustomEvent_customData' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetBoolField_ReturnValue) == 0x000270, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetBoolField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Conv_StringToText_ReturnValue) == 0x000278, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000290, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_CustomEvent_response) == 0x0002A8, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_CustomEvent_customData_2) == 0x0002E8, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_CustomEvent_customData_2' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_CustomEvent_successful) == 0x0002F0, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_ConstructJsonObject_ReturnValue) == 0x0002F8, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000300, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000308, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_MakeStruct_ClientExecuteCloudScriptRequest) == 0x000310, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_MakeStruct_ClientExecuteCloudScriptRequest' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_ExecuteCloudScript_ReturnValue) == 0x000340, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_ExecuteCloudScript_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_CreateDelegate_OutputDelegate_2) == 0x000348, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_IsValid_ReturnValue) == 0x000358, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetPlayerController_ReturnValue) == 0x000360, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000368, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000370, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_DynamicCast_bSuccess_1) == 0x000378, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetPlayerController_ReturnValue_1) == 0x000380, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Create_ReturnValue) == 0x000388, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000390, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_DynamicCast_AsPG_Player_State_Menu) == 0x000398, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_DynamicCast_AsPG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_DynamicCast_bSuccess_2) == 0x0003A0, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0003A8, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetPlayerCombinedInfo_ReturnValue_1) == 0x0003B0, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetPlayerCombinedInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetPlayerCombinedInfo_ReturnValue_2) == 0x0003B8, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetPlayerCombinedInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetObjectField_ReturnValue_1) == 0x0003C0, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetObjectField_ReturnValue_2) == 0x0003C8, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetObjectField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetNumberField_ReturnValue_1) == 0x0003D0, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetNumberField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetNumberField_ReturnValue_2) == 0x0003D4, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetNumberField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0003D8, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0003E0, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_DynamicCast_AsBP_PG_Player_State_Menu_1) == 0x0003E8, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_DynamicCast_AsBP_PG_Player_State_Menu_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_DynamicCast_bSuccess_3) == 0x0003F0, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetPlayerCombinedInfo_ReturnValue_3) == 0x0003F8, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetPlayerCombinedInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, K2Node_MakeArray_Array) == 0x000400, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetObjectField_ReturnValue_3) == 0x000410, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetObjectField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GetNumberField_ReturnValue_3) == 0x000418, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GetNumberField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Round_ReturnValue_1) == 0x00041C, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000420, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Subtract_IntInt_ReturnValue) == 0x000424, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Round_A_ImplicitCast) == 0x000428, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Round_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_SetNumberField_Number_ImplicitCast) == 0x000430, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_SetNumberField_Number_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000438, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000440, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_SetNumberField_Number_ImplicitCast_1) == 0x000448, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_SetNumberField_Number_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_SetNumberField_Number_ImplicitCast_2) == 0x00044C, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_SetNumberField_Number_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion, CallFunc_Round_A_ImplicitCast_1) == 0x000450, "Member 'UI_CurrencyConversion_C_ExecuteUbergraph_UI_CurrencyConversion::CallFunc_Round_A_ImplicitCast_1' has a wrong offset!");

// Function UI_CurrencyConversion.UI_CurrencyConversion_C.OnPlayFabResponse_10DA6E1A47DDAE9E800A5AA5BB90550A
// 0x0050 (0x0050 - 0x0000)
struct UI_CurrencyConversion_C_OnPlayFabResponse_10DA6E1A47DDAE9E800A5AA5BB90550A final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_CurrencyConversion_C_OnPlayFabResponse_10DA6E1A47DDAE9E800A5AA5BB90550A) == 0x000008, "Wrong alignment on UI_CurrencyConversion_C_OnPlayFabResponse_10DA6E1A47DDAE9E800A5AA5BB90550A");
static_assert(sizeof(UI_CurrencyConversion_C_OnPlayFabResponse_10DA6E1A47DDAE9E800A5AA5BB90550A) == 0x000050, "Wrong size on UI_CurrencyConversion_C_OnPlayFabResponse_10DA6E1A47DDAE9E800A5AA5BB90550A");
static_assert(offsetof(UI_CurrencyConversion_C_OnPlayFabResponse_10DA6E1A47DDAE9E800A5AA5BB90550A, Response) == 0x000000, "Member 'UI_CurrencyConversion_C_OnPlayFabResponse_10DA6E1A47DDAE9E800A5AA5BB90550A::Response' has a wrong offset!");
