#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Counter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UI_Counter.UI_Counter_C.ExecuteUbergraph_UI_Counter
// 0x0024 (0x0024 - 0x0000)
struct UI_Counter_C_ExecuteUbergraph_UI_Counter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Add_LinearColorLinearColor_ReturnValue;   // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Subtract_LinearColorLinearColor_ReturnValue; // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Counter_C_ExecuteUbergraph_UI_Counter) == 0x000004, "Wrong alignment on UI_Counter_C_ExecuteUbergraph_UI_Counter");
static_assert(sizeof(UI_Counter_C_ExecuteUbergraph_UI_Counter) == 0x000024, "Wrong size on UI_Counter_C_ExecuteUbergraph_UI_Counter");
static_assert(offsetof(UI_Counter_C_ExecuteUbergraph_UI_Counter, EntryPoint) == 0x000000, "Member 'UI_Counter_C_ExecuteUbergraph_UI_Counter::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Counter_C_ExecuteUbergraph_UI_Counter, CallFunc_Add_LinearColorLinearColor_ReturnValue) == 0x000004, "Member 'UI_Counter_C_ExecuteUbergraph_UI_Counter::CallFunc_Add_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Counter_C_ExecuteUbergraph_UI_Counter, CallFunc_Subtract_LinearColorLinearColor_ReturnValue) == 0x000014, "Member 'UI_Counter_C_ExecuteUbergraph_UI_Counter::CallFunc_Subtract_LinearColorLinearColor_ReturnValue' has a wrong offset!");

// Function UI_Counter.UI_Counter_C.OnClickDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Counter_C_OnClickDelegate__DelegateSignature final
{
public:
	class UUI_Counter_C*                          Counter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Counter_C_OnClickDelegate__DelegateSignature) == 0x000008, "Wrong alignment on UI_Counter_C_OnClickDelegate__DelegateSignature");
static_assert(sizeof(UI_Counter_C_OnClickDelegate__DelegateSignature) == 0x000008, "Wrong size on UI_Counter_C_OnClickDelegate__DelegateSignature");
static_assert(offsetof(UI_Counter_C_OnClickDelegate__DelegateSignature, Counter) == 0x000000, "Member 'UI_Counter_C_OnClickDelegate__DelegateSignature::Counter' has a wrong offset!");

}

