#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ErrorMessage

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_ErrorMessage.UI_ErrorMessage_C.ExecuteUbergraph_UI_ErrorMessage
// 0x0020 (0x0020 - 0x0000)
struct UI_ErrorMessage_C_ExecuteUbergraph_UI_ErrorMessage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_160A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ErrorMessage_C_ExecuteUbergraph_UI_ErrorMessage) == 0x000008, "Wrong alignment on UI_ErrorMessage_C_ExecuteUbergraph_UI_ErrorMessage");
static_assert(sizeof(UI_ErrorMessage_C_ExecuteUbergraph_UI_ErrorMessage) == 0x000020, "Wrong size on UI_ErrorMessage_C_ExecuteUbergraph_UI_ErrorMessage");
static_assert(offsetof(UI_ErrorMessage_C_ExecuteUbergraph_UI_ErrorMessage, EntryPoint) == 0x000000, "Member 'UI_ErrorMessage_C_ExecuteUbergraph_UI_ErrorMessage::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_ErrorMessage_C_ExecuteUbergraph_UI_ErrorMessage, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'UI_ErrorMessage_C_ExecuteUbergraph_UI_ErrorMessage::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ErrorMessage_C_ExecuteUbergraph_UI_ErrorMessage, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000010, "Member 'UI_ErrorMessage_C_ExecuteUbergraph_UI_ErrorMessage::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ErrorMessage_C_ExecuteUbergraph_UI_ErrorMessage, CallFunc_TextIsEmpty_ReturnValue) == 0x000018, "Member 'UI_ErrorMessage_C_ExecuteUbergraph_UI_ErrorMessage::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ErrorMessage_C_ExecuteUbergraph_UI_ErrorMessage, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000019, "Member 'UI_ErrorMessage_C_ExecuteUbergraph_UI_ErrorMessage::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");

}

