#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_EscapeMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_EscapeMenu.UI_EscapeMenu_C
// 0x0050 (0x02D0 - 0x0280)
class UUI_EscapeMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 LinesBackground;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           UI_Button_Options;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           UI_Button_Quit;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           UI_Button_Redeploy;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           UI_Button_Resume;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           UI_Button_TeamSetup;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Options_C*                          UI_Options;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Buttons;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Main;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Back();
	void BndEvt__UI_Button_Quit_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature(class UUI_Button_C* Button);
	void BndEvt__UI_Button_Resume_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature(class UUI_Button_C* Button);
	void BndEvt__UI_Button_Settings_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature(class UUI_Button_C* Button);
	void BndEvt__UI_EscapeMenu_UI_Button_Redeploy_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature(class UUI_Button_C* Button);
	void BndEvt__UI_Options_K2Node_ComponentBoundEvent_0_ClickBackDelegate__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_EscapeMenu(int32 EntryPoint);
	void OnIsAlive_Event();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnPossessedPawnChanged_Event(class APawn* OldPawn, class APawn* NewPawn);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_EscapeMenu_C">();
	}
	static class UUI_EscapeMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_EscapeMenu_C>();
	}
};
static_assert(alignof(UUI_EscapeMenu_C) == 0x000008, "Wrong alignment on UUI_EscapeMenu_C");
static_assert(sizeof(UUI_EscapeMenu_C) == 0x0002D0, "Wrong size on UUI_EscapeMenu_C");
static_assert(offsetof(UUI_EscapeMenu_C, UberGraphFrame) == 0x000280, "Member 'UUI_EscapeMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_EscapeMenu_C, LinesBackground) == 0x000288, "Member 'UUI_EscapeMenu_C::LinesBackground' has a wrong offset!");
static_assert(offsetof(UUI_EscapeMenu_C, UI_Button_Options) == 0x000290, "Member 'UUI_EscapeMenu_C::UI_Button_Options' has a wrong offset!");
static_assert(offsetof(UUI_EscapeMenu_C, UI_Button_Quit) == 0x000298, "Member 'UUI_EscapeMenu_C::UI_Button_Quit' has a wrong offset!");
static_assert(offsetof(UUI_EscapeMenu_C, UI_Button_Redeploy) == 0x0002A0, "Member 'UUI_EscapeMenu_C::UI_Button_Redeploy' has a wrong offset!");
static_assert(offsetof(UUI_EscapeMenu_C, UI_Button_Resume) == 0x0002A8, "Member 'UUI_EscapeMenu_C::UI_Button_Resume' has a wrong offset!");
static_assert(offsetof(UUI_EscapeMenu_C, UI_Button_TeamSetup) == 0x0002B0, "Member 'UUI_EscapeMenu_C::UI_Button_TeamSetup' has a wrong offset!");
static_assert(offsetof(UUI_EscapeMenu_C, UI_Options) == 0x0002B8, "Member 'UUI_EscapeMenu_C::UI_Options' has a wrong offset!");
static_assert(offsetof(UUI_EscapeMenu_C, VerticalBox_Buttons) == 0x0002C0, "Member 'UUI_EscapeMenu_C::VerticalBox_Buttons' has a wrong offset!");
static_assert(offsetof(UUI_EscapeMenu_C, WidgetSwitcher_Main) == 0x0002C8, "Member 'UUI_EscapeMenu_C::WidgetSwitcher_Main' has a wrong offset!");

}

