#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ExitGame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_ExitGame.UI_ExitGame_C
// 0x0018 (0x0298 - 0x0280)
class UUI_ExitGame_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_No;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Yes;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__Button_No_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Yes_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_UI_ExitGame(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_ExitGame_C">();
	}
	static class UUI_ExitGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_ExitGame_C>();
	}
};
static_assert(alignof(UUI_ExitGame_C) == 0x000008, "Wrong alignment on UUI_ExitGame_C");
static_assert(sizeof(UUI_ExitGame_C) == 0x000298, "Wrong size on UUI_ExitGame_C");
static_assert(offsetof(UUI_ExitGame_C, UberGraphFrame) == 0x000280, "Member 'UUI_ExitGame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_ExitGame_C, Button_No) == 0x000288, "Member 'UUI_ExitGame_C::Button_No' has a wrong offset!");
static_assert(offsetof(UUI_ExitGame_C, Button_Yes) == 0x000290, "Member 'UUI_ExitGame_C::Button_Yes' has a wrong offset!");

}

