#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_EscapeMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function UI_EscapeMenu.UI_EscapeMenu_C.BndEvt__UI_Button_Quit_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_EscapeMenu_C_BndEvt__UI_Button_Quit_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_EscapeMenu_C_BndEvt__UI_Button_Quit_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_EscapeMenu_C_BndEvt__UI_Button_Quit_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature");
static_assert(sizeof(UI_EscapeMenu_C_BndEvt__UI_Button_Quit_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_EscapeMenu_C_BndEvt__UI_Button_Quit_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature");
static_assert(offsetof(UI_EscapeMenu_C_BndEvt__UI_Button_Quit_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_EscapeMenu_C_BndEvt__UI_Button_Quit_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_EscapeMenu.UI_EscapeMenu_C.BndEvt__UI_Button_Resume_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_EscapeMenu_C_BndEvt__UI_Button_Resume_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_EscapeMenu_C_BndEvt__UI_Button_Resume_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_EscapeMenu_C_BndEvt__UI_Button_Resume_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature");
static_assert(sizeof(UI_EscapeMenu_C_BndEvt__UI_Button_Resume_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_EscapeMenu_C_BndEvt__UI_Button_Resume_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature");
static_assert(offsetof(UI_EscapeMenu_C_BndEvt__UI_Button_Resume_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_EscapeMenu_C_BndEvt__UI_Button_Resume_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_EscapeMenu.UI_EscapeMenu_C.BndEvt__UI_Button_Settings_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_EscapeMenu_C_BndEvt__UI_Button_Settings_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_EscapeMenu_C_BndEvt__UI_Button_Settings_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_EscapeMenu_C_BndEvt__UI_Button_Settings_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature");
static_assert(sizeof(UI_EscapeMenu_C_BndEvt__UI_Button_Settings_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_EscapeMenu_C_BndEvt__UI_Button_Settings_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature");
static_assert(offsetof(UI_EscapeMenu_C_BndEvt__UI_Button_Settings_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_EscapeMenu_C_BndEvt__UI_Button_Settings_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_EscapeMenu.UI_EscapeMenu_C.BndEvt__UI_EscapeMenu_UI_Button_Redeploy_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_EscapeMenu_C_BndEvt__UI_EscapeMenu_UI_Button_Redeploy_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_EscapeMenu_C_BndEvt__UI_EscapeMenu_UI_Button_Redeploy_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_EscapeMenu_C_BndEvt__UI_EscapeMenu_UI_Button_Redeploy_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature");
static_assert(sizeof(UI_EscapeMenu_C_BndEvt__UI_EscapeMenu_UI_Button_Redeploy_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_EscapeMenu_C_BndEvt__UI_EscapeMenu_UI_Button_Redeploy_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature");
static_assert(offsetof(UI_EscapeMenu_C_BndEvt__UI_EscapeMenu_UI_Button_Redeploy_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_EscapeMenu_C_BndEvt__UI_EscapeMenu_UI_Button_Redeploy_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_EscapeMenu.UI_EscapeMenu_C.ExecuteUbergraph_UI_EscapeMenu
// 0x00C8 (0x00C8 - 0x0000)
struct UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APawn* OldPawn, class APawn* NewPawn)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DD9[0x1];                                     // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_3;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_2;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_1;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_QuitMatch_C*                        CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DDA[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_Game_Character*                     K2Node_DynamicCast_AsPG_Game_Character;            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DDB[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_CustomEvent_OldPawn;                        // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_NewPawn;                        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_Game_Character*                     K2Node_DynamicCast_AsPG_Game_Character_1;          // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu) == 0x000008, "Wrong alignment on UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu");
static_assert(sizeof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu) == 0x0000C8, "Wrong size on UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, EntryPoint) == 0x000000, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, Temp_bool_Has_Been_Initd_Variable) == 0x000024, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, Temp_bool_IsClosed_Variable) == 0x000025, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, K2Node_Event_IsDesignTime) == 0x000026, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, K2Node_ComponentBoundEvent_Button_3) == 0x000030, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, K2Node_ComponentBoundEvent_Button_2) == 0x000038, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, K2Node_ComponentBoundEvent_Button_1) == 0x000040, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, CallFunc_Create_ReturnValue) == 0x000050, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000058, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x000060, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, K2Node_ComponentBoundEvent_Button) == 0x000070, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000078, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x000080, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, K2Node_DynamicCast_AsPG_Game_Character) == 0x000088, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::K2Node_DynamicCast_AsPG_Game_Character' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, K2Node_CustomEvent_OldPawn) == 0x000098, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::K2Node_CustomEvent_OldPawn' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, K2Node_CustomEvent_NewPawn) == 0x0000A0, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::K2Node_CustomEvent_NewPawn' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000A8, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, CallFunc_K2_GetPawn_ReturnValue) == 0x0000B0, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, K2Node_DynamicCast_AsPG_Game_Character_1) == 0x0000B8, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::K2Node_DynamicCast_AsPG_Game_Character_1' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'UI_EscapeMenu_C_ExecuteUbergraph_UI_EscapeMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function UI_EscapeMenu.UI_EscapeMenu_C.OnKeyDown
// 0x0208 (0x0208 - 0x0000)
struct UI_EscapeMenu_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0130(0x00B8)()
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x01E8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_EscapeMenu_C_OnKeyDown) == 0x000008, "Wrong alignment on UI_EscapeMenu_C_OnKeyDown");
static_assert(sizeof(UI_EscapeMenu_C_OnKeyDown) == 0x000208, "Wrong size on UI_EscapeMenu_C_OnKeyDown");
static_assert(offsetof(UI_EscapeMenu_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'UI_EscapeMenu_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'UI_EscapeMenu_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_OnKeyDown, ReturnValue) == 0x000078, "Member 'UI_EscapeMenu_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000130, "Member 'UI_EscapeMenu_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x0001E8, "Member 'UI_EscapeMenu_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000200, "Member 'UI_EscapeMenu_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");

// Function UI_EscapeMenu.UI_EscapeMenu_C.OnPossessedPawnChanged_Event
// 0x0010 (0x0010 - 0x0000)
struct UI_EscapeMenu_C_OnPossessedPawnChanged_Event final
{
public:
	class APawn*                                  OldPawn;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_EscapeMenu_C_OnPossessedPawnChanged_Event) == 0x000008, "Wrong alignment on UI_EscapeMenu_C_OnPossessedPawnChanged_Event");
static_assert(sizeof(UI_EscapeMenu_C_OnPossessedPawnChanged_Event) == 0x000010, "Wrong size on UI_EscapeMenu_C_OnPossessedPawnChanged_Event");
static_assert(offsetof(UI_EscapeMenu_C_OnPossessedPawnChanged_Event, OldPawn) == 0x000000, "Member 'UI_EscapeMenu_C_OnPossessedPawnChanged_Event::OldPawn' has a wrong offset!");
static_assert(offsetof(UI_EscapeMenu_C_OnPossessedPawnChanged_Event, NewPawn) == 0x000008, "Member 'UI_EscapeMenu_C_OnPossessedPawnChanged_Event::NewPawn' has a wrong offset!");

// Function UI_EscapeMenu.UI_EscapeMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_EscapeMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_EscapeMenu_C_PreConstruct) == 0x000001, "Wrong alignment on UI_EscapeMenu_C_PreConstruct");
static_assert(sizeof(UI_EscapeMenu_C_PreConstruct) == 0x000001, "Wrong size on UI_EscapeMenu_C_PreConstruct");
static_assert(offsetof(UI_EscapeMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_EscapeMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

