#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_Notifications

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_Game_Notifications.UI_Game_Notifications_C.AddNotification
// 0x0018 (0x0018 - 0x0000)
struct UI_Game_Notifications_C_AddNotification final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UI_Game_Notifications_C_AddNotification) == 0x000008, "Wrong alignment on UI_Game_Notifications_C_AddNotification");
static_assert(sizeof(UI_Game_Notifications_C_AddNotification) == 0x000018, "Wrong size on UI_Game_Notifications_C_AddNotification");
static_assert(offsetof(UI_Game_Notifications_C_AddNotification, Text) == 0x000000, "Member 'UI_Game_Notifications_C_AddNotification::Text' has a wrong offset!");

// Function UI_Game_Notifications.UI_Game_Notifications_C.ExecuteUbergraph_UI_Game_Notifications
// 0x0110 (0x0110 - 0x0000)
struct UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B61[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B62[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AControlPoint* ControlPoint)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B63[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_GameState_Game_C*                CallFunc_GetGameStateBP_MyGameState;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AControlPoint*                          K2Node_CustomEvent_ControlPoint_1;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B64[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AControlPoint*                          K2Node_CustomEvent_ControlPoint;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B65[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0050(0x0018)()
	class AControlPoint*                          CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B66[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AControlPoint*                          K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B67[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_Notifications_Entry_C*         CallFunc_Create_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B68[0x2];                                     // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B69[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B6A[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetRealTimeSeconds_ReturnValue_1;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B6B[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AControlPoint* ControlPoint)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications) == 0x000008, "Wrong alignment on UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications");
static_assert(sizeof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications) == 0x000110, "Wrong size on UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, EntryPoint) == 0x000000, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, Temp_bool_IsClosed_Variable) == 0x000008, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, Temp_bool_IsClosed_Variable_1) == 0x000011, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, Temp_bool_Has_Been_Initd_Variable_1) == 0x000024, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_GetGameStateBP_MyGameState) == 0x000028, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_GetGameStateBP_MyGameState' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, K2Node_CustomEvent_ControlPoint_1) == 0x000030, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::K2Node_CustomEvent_ControlPoint_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, K2Node_CustomEvent_ControlPoint) == 0x000040, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::K2Node_CustomEvent_ControlPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, K2Node_CustomEvent_Text) == 0x000050, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_Array_Get_Item) == 0x000068, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_TextIsEmpty_ReturnValue) == 0x000070, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000078, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_Not_PreBool_ReturnValue) == 0x000080, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_GetPlayerController_ReturnValue) == 0x000088, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_Create_ReturnValue) == 0x000090, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_Array_AddUnique_ReturnValue) == 0x000098, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_IsValid_ReturnValue) == 0x00009C, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_Not_PreBool_ReturnValue_1) == 0x00009D, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A4, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x0000A8, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_GetRealTimeSeconds_ReturnValue_1) == 0x0000C0, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_GetRealTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000C8, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x0000D0, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D8, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_AddChildToOverlay_ReturnValue) == 0x0000E8, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_Array_Length_ReturnValue_2) == 0x0000F0, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000F4, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000F8, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications, CallFunc_Delay_Duration_ImplicitCast) == 0x000108, "Member 'UI_Game_Notifications_C_ExecuteUbergraph_UI_Game_Notifications::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function UI_Game_Notifications.UI_Game_Notifications_C.OnCaptured
// 0x0210 (0x0210 - 0x0000)
struct UI_Game_Notifications_C_OnCaptured final
{
public:
	class AControlPoint*                          ControlPoint;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AControlPoint*                          L_ControlPoint;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B6C[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B6D[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0040(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0058(0x0018)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B6E[0x5];                                     // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetControlPointNameAsString_ReturnValue;  // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A8(0x0050)(HasGetValueTypeHash)
	class APG_PlayerState_Game*                   K2Node_DynamicCast_AsPG_Player_State_Game;         // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B6F[0x6];                                     // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0108(0x0018)()
	class FString                                 K2Node_Select_Default_1;                           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0130(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0180(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0198(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01F8(0x0018)()
};
static_assert(alignof(UI_Game_Notifications_C_OnCaptured) == 0x000008, "Wrong alignment on UI_Game_Notifications_C_OnCaptured");
static_assert(sizeof(UI_Game_Notifications_C_OnCaptured) == 0x000210, "Wrong size on UI_Game_Notifications_C_OnCaptured");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, ControlPoint) == 0x000000, "Member 'UI_Game_Notifications_C_OnCaptured::ControlPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, L_ControlPoint) == 0x000008, "Member 'UI_Game_Notifications_C_OnCaptured::L_ControlPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, Temp_bool_Variable) == 0x000010, "Member 'UI_Game_Notifications_C_OnCaptured::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, Temp_string_Variable) == 0x000018, "Member 'UI_Game_Notifications_C_OnCaptured::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, Temp_string_Variable_1) == 0x000028, "Member 'UI_Game_Notifications_C_OnCaptured::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, Temp_bool_Variable_1) == 0x000038, "Member 'UI_Game_Notifications_C_OnCaptured::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, Temp_text_Variable) == 0x000040, "Member 'UI_Game_Notifications_C_OnCaptured::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, Temp_text_Variable_1) == 0x000058, "Member 'UI_Game_Notifications_C_OnCaptured::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000070, "Member 'UI_Game_Notifications_C_OnCaptured::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000071, "Member 'UI_Game_Notifications_C_OnCaptured::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, CallFunc_BooleanAND_ReturnValue) == 0x000072, "Member 'UI_Game_Notifications_C_OnCaptured::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, CallFunc_GetControlPointNameAsString_ReturnValue) == 0x000078, "Member 'UI_Game_Notifications_C_OnCaptured::CallFunc_GetControlPointNameAsString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'UI_Game_Notifications_C_OnCaptured::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, CallFunc_GetPlayerController_ReturnValue) == 0x0000A0, "Member 'UI_Game_Notifications_C_OnCaptured::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, K2Node_MakeStruct_FormatArgumentData) == 0x0000A8, "Member 'UI_Game_Notifications_C_OnCaptured::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, K2Node_DynamicCast_AsPG_Player_State_Game) == 0x0000F8, "Member 'UI_Game_Notifications_C_OnCaptured::K2Node_DynamicCast_AsPG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'UI_Game_Notifications_C_OnCaptured::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000101, "Member 'UI_Game_Notifications_C_OnCaptured::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, K2Node_Select_Default) == 0x000108, "Member 'UI_Game_Notifications_C_OnCaptured::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, K2Node_Select_Default_1) == 0x000120, "Member 'UI_Game_Notifications_C_OnCaptured::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, K2Node_MakeStruct_FormatArgumentData_1) == 0x000130, "Member 'UI_Game_Notifications_C_OnCaptured::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000180, "Member 'UI_Game_Notifications_C_OnCaptured::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, K2Node_MakeStruct_FormatArgumentData_2) == 0x000198, "Member 'UI_Game_Notifications_C_OnCaptured::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, K2Node_MakeArray_Array) == 0x0001E8, "Member 'UI_Game_Notifications_C_OnCaptured::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnCaptured, CallFunc_Format_ReturnValue) == 0x0001F8, "Member 'UI_Game_Notifications_C_OnCaptured::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function UI_Game_Notifications.UI_Game_Notifications_C.OnCapturedTeam_Event
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_Notifications_C_OnCapturedTeam_Event final
{
public:
	class AControlPoint*                          ControlPoint;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Notifications_C_OnCapturedTeam_Event) == 0x000008, "Wrong alignment on UI_Game_Notifications_C_OnCapturedTeam_Event");
static_assert(sizeof(UI_Game_Notifications_C_OnCapturedTeam_Event) == 0x000008, "Wrong size on UI_Game_Notifications_C_OnCapturedTeam_Event");
static_assert(offsetof(UI_Game_Notifications_C_OnCapturedTeam_Event, ControlPoint) == 0x000000, "Member 'UI_Game_Notifications_C_OnCapturedTeam_Event::ControlPoint' has a wrong offset!");

// Function UI_Game_Notifications.UI_Game_Notifications_C.OnIsCapture
// 0x0240 (0x0240 - 0x0000)
struct UI_Game_Notifications_C_OnIsCapture final
{
public:
	class AControlPoint*                          ControlPoint;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Game*                   L_PlayerState;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          L_IsCapturingByAllies;                             // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B70[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AControlPoint*                          L_ControlPoint;                                    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B71[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0040(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0058(0x0018)()
	class FString                                 Temp_string_Variable_1;                            // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B72[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_1;                           // 0x0098(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0118(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetControlPointNameAsString_ReturnValue;  // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0178(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B73[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0198(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01E8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B74[0x4];                                     // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0200(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B75[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Game*                   K2Node_DynamicCast_AsPG_Player_State_Game;         // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B76[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Notifications_C_OnIsCapture) == 0x000008, "Wrong alignment on UI_Game_Notifications_C_OnIsCapture");
static_assert(sizeof(UI_Game_Notifications_C_OnIsCapture) == 0x000240, "Wrong size on UI_Game_Notifications_C_OnIsCapture");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, ControlPoint) == 0x000000, "Member 'UI_Game_Notifications_C_OnIsCapture::ControlPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, L_PlayerState) == 0x000008, "Member 'UI_Game_Notifications_C_OnIsCapture::L_PlayerState' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, L_IsCapturingByAllies) == 0x000010, "Member 'UI_Game_Notifications_C_OnIsCapture::L_IsCapturingByAllies' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, L_ControlPoint) == 0x000018, "Member 'UI_Game_Notifications_C_OnIsCapture::L_ControlPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, Temp_string_Variable) == 0x000020, "Member 'UI_Game_Notifications_C_OnIsCapture::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'UI_Game_Notifications_C_OnIsCapture::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, CallFunc_Greater_IntInt_ReturnValue) == 0x000034, "Member 'UI_Game_Notifications_C_OnIsCapture::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'UI_Game_Notifications_C_OnIsCapture::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00003C, "Member 'UI_Game_Notifications_C_OnIsCapture::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, CallFunc_BooleanOR_ReturnValue) == 0x00003D, "Member 'UI_Game_Notifications_C_OnIsCapture::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, Temp_bool_Variable) == 0x00003E, "Member 'UI_Game_Notifications_C_OnIsCapture::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, K2Node_SwitchEnum_CmpSuccess) == 0x00003F, "Member 'UI_Game_Notifications_C_OnIsCapture::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, Temp_text_Variable) == 0x000040, "Member 'UI_Game_Notifications_C_OnIsCapture::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, Temp_text_Variable_1) == 0x000058, "Member 'UI_Game_Notifications_C_OnIsCapture::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, Temp_string_Variable_1) == 0x000070, "Member 'UI_Game_Notifications_C_OnIsCapture::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, CallFunc_BooleanAND_ReturnValue) == 0x000080, "Member 'UI_Game_Notifications_C_OnIsCapture::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, Temp_bool_Variable_1) == 0x000081, "Member 'UI_Game_Notifications_C_OnIsCapture::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, K2Node_Select_Default) == 0x000088, "Member 'UI_Game_Notifications_C_OnIsCapture::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, K2Node_Select_Default_1) == 0x000098, "Member 'UI_Game_Notifications_C_OnIsCapture::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B0, "Member 'UI_Game_Notifications_C_OnIsCapture::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, K2Node_MakeStruct_FormatArgumentData) == 0x0000C8, "Member 'UI_Game_Notifications_C_OnIsCapture::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, K2Node_MakeStruct_FormatArgumentData_1) == 0x000118, "Member 'UI_Game_Notifications_C_OnIsCapture::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, CallFunc_GetControlPointNameAsString_ReturnValue) == 0x000168, "Member 'UI_Game_Notifications_C_OnIsCapture::CallFunc_GetControlPointNameAsString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000178, "Member 'UI_Game_Notifications_C_OnIsCapture::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, CallFunc_Array_Length_ReturnValue_2) == 0x000190, "Member 'UI_Game_Notifications_C_OnIsCapture::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, K2Node_MakeStruct_FormatArgumentData_2) == 0x000198, "Member 'UI_Game_Notifications_C_OnIsCapture::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, K2Node_MakeArray_Array) == 0x0001E8, "Member 'UI_Game_Notifications_C_OnIsCapture::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, CallFunc_Array_Length_ReturnValue_3) == 0x0001F8, "Member 'UI_Game_Notifications_C_OnIsCapture::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, CallFunc_Format_ReturnValue) == 0x000200, "Member 'UI_Game_Notifications_C_OnIsCapture::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000218, "Member 'UI_Game_Notifications_C_OnIsCapture::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, CallFunc_GetPlayerController_ReturnValue) == 0x000220, "Member 'UI_Game_Notifications_C_OnIsCapture::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, K2Node_DynamicCast_AsPG_Player_State_Game) == 0x000228, "Member 'UI_Game_Notifications_C_OnIsCapture::K2Node_DynamicCast_AsPG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, K2Node_DynamicCast_bSuccess) == 0x000230, "Member 'UI_Game_Notifications_C_OnIsCapture::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, CallFunc_Array_Length_ReturnValue_4) == 0x000234, "Member 'UI_Game_Notifications_C_OnIsCapture::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, CallFunc_Array_Length_ReturnValue_5) == 0x000238, "Member 'UI_Game_Notifications_C_OnIsCapture::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture, CallFunc_Greater_IntInt_ReturnValue_3) == 0x00023C, "Member 'UI_Game_Notifications_C_OnIsCapture::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");

// Function UI_Game_Notifications.UI_Game_Notifications_C.OnIsCapture_Event
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_Notifications_C_OnIsCapture_Event final
{
public:
	class AControlPoint*                          ControlPoint;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Notifications_C_OnIsCapture_Event) == 0x000008, "Wrong alignment on UI_Game_Notifications_C_OnIsCapture_Event");
static_assert(sizeof(UI_Game_Notifications_C_OnIsCapture_Event) == 0x000008, "Wrong size on UI_Game_Notifications_C_OnIsCapture_Event");
static_assert(offsetof(UI_Game_Notifications_C_OnIsCapture_Event, ControlPoint) == 0x000000, "Member 'UI_Game_Notifications_C_OnIsCapture_Event::ControlPoint' has a wrong offset!");

}

