#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen_Loadout_Full_Weapon

#include "Basic.hpp"

#include "POLYGON_structs.hpp"
#include "ST_ItemInfo_structs.hpp"


namespace SDK::Params
{

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon.UI_Game_SpawnScreen_Loadout_Full_Weapon_C.AttachGunsToCrate
// 0x0058 (0x0058 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate final
{
public:
	TArray<class ATargetPoint*>                   L_LoadoutTargets;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D50[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATargetPoint*                           CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D51[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D52[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATargetPoint*>                   CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0038(0x0010)(ReferenceParm)
	class AActor*                                 K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate) == 0x000058, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate, L_LoadoutTargets) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate::L_LoadoutTargets' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate, Temp_int_Array_Index_Variable) == 0x000010, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate, CallFunc_Array_Get_Item) == 0x000020, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate, CallFunc_ActorHasTag_ReturnValue) == 0x000028, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate, Temp_bool_Variable) == 0x000031, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000038, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate, K2Node_Select_Default) == 0x000048, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate, CallFunc_K2_AttachToActor_ReturnValue) == 0x000050, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_AttachGunsToCrate::CallFunc_K2_AttachToActor_ReturnValue' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon.UI_Game_SpawnScreen_Loadout_Full_Weapon_C.BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Primary_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_C_BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Primary_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature final
{
public:
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_C* Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Primary_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Primary_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Primary_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature) == 0x000008, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Primary_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Primary_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature, Param_Slot) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Primary_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature::Param_Slot' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon.UI_Game_SpawnScreen_Loadout_Full_Weapon_C.BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Secondary_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_C_BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Secondary_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature final
{
public:
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_C* Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Secondary_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Secondary_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Secondary_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature) == 0x000008, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Secondary_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Secondary_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature, Param_Slot) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Secondary_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature::Param_Slot' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon.UI_Game_SpawnScreen_Loadout_Full_Weapon_C.ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon
// 0x00D0 (0x00D0 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<EModifiedData>& ModifiedData, const class FString& CustomString)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D53[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_CustomEvent_ModifiedData;                   // 0x0030(0x0010)(ConstParm, ReferenceParm)
	class FString                                 K2Node_CustomEvent_CustomString;                   // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D54[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D55[0x5];                                     // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D56[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_CameraTransitions_DarkenScreen_C*   CallFunc_Create_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_C* K2Node_ComponentBoundEvent_Slot_1;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_C* K2Node_ComponentBoundEvent_Slot;                   // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ConstParm, ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D57[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_1; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EModifiedData                                 Temp_byte_Variable;                                // 0x00C9(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon) == 0x0000D0, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, EntryPoint) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, Temp_bool_Has_Been_Initd_Variable) == 0x000024, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, Temp_bool_IsClosed_Variable) == 0x000025, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, K2Node_CustomEvent_ModifiedData) == 0x000030, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::K2Node_CustomEvent_ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, K2Node_CustomEvent_CustomString) == 0x000040, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::K2Node_CustomEvent_CustomString' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x000058, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000061, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, K2Node_Event_IsDesignTime) == 0x000062, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000068, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, CallFunc_Create_ReturnValue) == 0x000078, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, K2Node_ComponentBoundEvent_Slot_1) == 0x000080, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::K2Node_ComponentBoundEvent_Slot_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, K2Node_ComponentBoundEvent_Slot) == 0x000088, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::K2Node_ComponentBoundEvent_Slot' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, K2Node_MakeArray_Array) == 0x000090, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, CallFunc_GetPlayerController_ReturnValue) == 0x0000A0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000A8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x0000B0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_1) == 0x0000C0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, K2Node_DynamicCast_bSuccess_2) == 0x0000C8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, Temp_byte_Variable) == 0x0000C9, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon, CallFunc_Array_Contains_ReturnValue) == 0x0000CA, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon.UI_Game_SpawnScreen_Loadout_Full_Weapon_C.GetSlotByItemClass
// 0x0038 (0x0038 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass final
{
public:
	class UClass*                                 ItemClass;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Param_Slot;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 L_ItemClass;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGunSlot                                      Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D58[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Gun_General;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D59[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass) == 0x000038, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass, ItemClass) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass::ItemClass' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass, Param_Slot) == 0x000008, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass::Param_Slot' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass, L_ItemClass) == 0x000010, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass::L_ItemClass' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass, Temp_byte_Variable) == 0x000018, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass, K2Node_ClassDynamicCast_AsItem_Gun_General) == 0x000020, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass::K2Node_ClassDynamicCast_AsItem_Gun_General' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass, K2Node_ClassDynamicCast_bSuccess) == 0x000028, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass, K2Node_Select_Default) == 0x000030, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_GetSlotByItemClass::K2Node_Select_Default' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon.UI_Game_SpawnScreen_Loadout_Full_Weapon_C.OnUpdatePlayerCombinedInfo_Event
// 0x0020 (0x0020 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_C_OnUpdatePlayerCombinedInfo_Event final
{
public:
	TArray<EModifiedData>                         ModifiedData;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 CustomString;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_OnUpdatePlayerCombinedInfo_Event) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_OnUpdatePlayerCombinedInfo_Event) == 0x000020, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_OnUpdatePlayerCombinedInfo_Event, ModifiedData) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_OnUpdatePlayerCombinedInfo_Event::ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_OnUpdatePlayerCombinedInfo_Event, CustomString) == 0x000010, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_OnUpdatePlayerCombinedInfo_Event::CustomString' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon.UI_Game_SpawnScreen_Loadout_Full_Weapon_C.ParsePlayerInventory
// 0x0088 (0x0088 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory final
{
public:
	struct FST_ItemInfo                           L_ItemInfo;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     L_ItemJson;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D5A[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue;          // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D5B[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D5C[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemEntry                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0070(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory) == 0x000088, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory, L_ItemInfo) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory::L_ItemInfo' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory, L_ItemJson) == 0x000010, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory::L_ItemJson' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory, Temp_int_Array_Index_Variable) == 0x000018, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000028, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory, CallFunc_GetObjectArrayField_ReturnValue) == 0x000030, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory::CallFunc_GetObjectArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory, CallFunc_Array_Get_Item) == 0x000048, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory, CallFunc_GetStringField_ReturnValue) == 0x000058, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory, CallFunc_Conv_StringToName_ReturnValue) == 0x000068, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory, CallFunc_GetDataTableRowFromName_OutRow) == 0x000070, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000080, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_ParsePlayerInventory::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon.UI_Game_SpawnScreen_Loadout_Full_Weapon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_PreConstruct");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_PreConstruct) == 0x000001, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_PreConstruct");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon.UI_Game_SpawnScreen_Loadout_Full_Weapon_C.SetActiveMenu
// 0x0004 (0x0004 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_C_SetActiveMenu final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_SetActiveMenu) == 0x000004, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_SetActiveMenu");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_SetActiveMenu) == 0x000004, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_C_SetActiveMenu");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_C_SetActiveMenu, Param_Index) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_C_SetActiveMenu::Param_Index' has a wrong offset!");

}

