#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_GamePoints_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "POLYGON_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_GamePoints_Entry.UI_GamePoints_Entry_C
// 0x0068 (0x02E8 - 0x0280)
class UUI_GamePoints_Entry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Blinking;                                     // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ShowCustomString;                             // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ShowWidget;                                   // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Message;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Points;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         AddPoint;                                          // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EAccrualTypeGameScore                         GameScoreType;                                     // 0x02B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3BD3[0x3];                                     // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CustomString;                                      // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         CurrentDisplayCharacters;                          // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BD4[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Message;                                           // 0x02D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_UI_GamePoints_Entry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_GamePoints_Entry_C">();
	}
	static class UUI_GamePoints_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_GamePoints_Entry_C>();
	}
};
static_assert(alignof(UUI_GamePoints_Entry_C) == 0x000008, "Wrong alignment on UUI_GamePoints_Entry_C");
static_assert(sizeof(UUI_GamePoints_Entry_C) == 0x0002E8, "Wrong size on UUI_GamePoints_Entry_C");
static_assert(offsetof(UUI_GamePoints_Entry_C, UberGraphFrame) == 0x000280, "Member 'UUI_GamePoints_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_GamePoints_Entry_C, Anim_Blinking) == 0x000288, "Member 'UUI_GamePoints_Entry_C::Anim_Blinking' has a wrong offset!");
static_assert(offsetof(UUI_GamePoints_Entry_C, Anim_ShowCustomString) == 0x000290, "Member 'UUI_GamePoints_Entry_C::Anim_ShowCustomString' has a wrong offset!");
static_assert(offsetof(UUI_GamePoints_Entry_C, Anim_ShowWidget) == 0x000298, "Member 'UUI_GamePoints_Entry_C::Anim_ShowWidget' has a wrong offset!");
static_assert(offsetof(UUI_GamePoints_Entry_C, TextBlock_Message) == 0x0002A0, "Member 'UUI_GamePoints_Entry_C::TextBlock_Message' has a wrong offset!");
static_assert(offsetof(UUI_GamePoints_Entry_C, TextBlock_Points) == 0x0002A8, "Member 'UUI_GamePoints_Entry_C::TextBlock_Points' has a wrong offset!");
static_assert(offsetof(UUI_GamePoints_Entry_C, AddPoint) == 0x0002B0, "Member 'UUI_GamePoints_Entry_C::AddPoint' has a wrong offset!");
static_assert(offsetof(UUI_GamePoints_Entry_C, GameScoreType) == 0x0002B4, "Member 'UUI_GamePoints_Entry_C::GameScoreType' has a wrong offset!");
static_assert(offsetof(UUI_GamePoints_Entry_C, CustomString) == 0x0002B8, "Member 'UUI_GamePoints_Entry_C::CustomString' has a wrong offset!");
static_assert(offsetof(UUI_GamePoints_Entry_C, CurrentDisplayCharacters) == 0x0002C8, "Member 'UUI_GamePoints_Entry_C::CurrentDisplayCharacters' has a wrong offset!");
static_assert(offsetof(UUI_GamePoints_Entry_C, Message) == 0x0002D0, "Member 'UUI_GamePoints_Entry_C::Message' has a wrong offset!");

}

