#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_Hotkey_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Game_Hotkey_Entry.UI_Game_Hotkey_Entry_C
// 0x0030 (0x02B0 - 0x0280)
class UUI_Game_Hotkey_Entry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Action;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Key;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Enable;                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   Input;                                             // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_Game_Hotkey_Entry(int32 EntryPoint);
	void OnEnable_Event();
	void OnMappingsChanged_Event(class APlayerController* Player);
	void OnSetCurrentGun_Event(class AItem_Gun_General* OldCurrentGun);
	void OnSetGunModules_Event();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Game_Hotkey_Entry_C">();
	}
	static class UUI_Game_Hotkey_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Game_Hotkey_Entry_C>();
	}
};
static_assert(alignof(UUI_Game_Hotkey_Entry_C) == 0x000008, "Wrong alignment on UUI_Game_Hotkey_Entry_C");
static_assert(sizeof(UUI_Game_Hotkey_Entry_C) == 0x0002B0, "Wrong size on UUI_Game_Hotkey_Entry_C");
static_assert(offsetof(UUI_Game_Hotkey_Entry_C, UberGraphFrame) == 0x000280, "Member 'UUI_Game_Hotkey_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Game_Hotkey_Entry_C, Image_Action) == 0x000288, "Member 'UUI_Game_Hotkey_Entry_C::Image_Action' has a wrong offset!");
static_assert(offsetof(UUI_Game_Hotkey_Entry_C, TextBlock_Key) == 0x000290, "Member 'UUI_Game_Hotkey_Entry_C::TextBlock_Key' has a wrong offset!");
static_assert(offsetof(UUI_Game_Hotkey_Entry_C, WidgetSwitcher_Enable) == 0x000298, "Member 'UUI_Game_Hotkey_Entry_C::WidgetSwitcher_Enable' has a wrong offset!");
static_assert(offsetof(UUI_Game_Hotkey_Entry_C, Input) == 0x0002A0, "Member 'UUI_Game_Hotkey_Entry_C::Input' has a wrong offset!");
static_assert(offsetof(UUI_Game_Hotkey_Entry_C, Icon) == 0x0002A8, "Member 'UUI_Game_Hotkey_Entry_C::Icon' has a wrong offset!");

}

