#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen_Loadout_Compact_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Game_SpawnScreen_Loadout_Compact_Slot.UI_Game_SpawnScreen_Loadout_Compact_Slot_C
// 0x0090 (0x0310 - 0x0280)
class UUI_Game_SpawnScreen_Loadout_Compact_Slot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Accessory;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Barrel;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Optic;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Underbarrel;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Name;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Type;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Type;                                              // 0x02D0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UPlayFabJsonObject*                     GunJson;                                           // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GunClass;                                          // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsSelected;                                        // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AsyncLoadIcon(TSoftObjectPtr<class UTexture2D> Icon);
	void BndEvt__UI_SpawnScreen_Loadout_Compact_Slot_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_SpawnScreen_Loadout_Compact_Slot_Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_SpawnScreen_Loadout_ItemSlot_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot(int32 EntryPoint);
	void OnClicked__DelegateSignature();
	void OnLoaded_FF6FB6ED43BE833837F94184A6F34782(class UObject* Loaded);
	void Parse_Modules();
	void PreConstruct(bool IsDesignTime);
	void Reset();
	void SetIsSelected(bool Param_IsSelected);
	void SetItemInfo(class UPlayFabJsonObject* ItemInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Game_SpawnScreen_Loadout_Compact_Slot_C">();
	}
	static class UUI_Game_SpawnScreen_Loadout_Compact_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Game_SpawnScreen_Loadout_Compact_Slot_C>();
	}
};
static_assert(alignof(UUI_Game_SpawnScreen_Loadout_Compact_Slot_C) == 0x000008, "Wrong alignment on UUI_Game_SpawnScreen_Loadout_Compact_Slot_C");
static_assert(sizeof(UUI_Game_SpawnScreen_Loadout_Compact_Slot_C) == 0x000310, "Wrong size on UUI_Game_SpawnScreen_Loadout_Compact_Slot_C");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Slot_C, UberGraphFrame) == 0x000280, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Slot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Slot_C, Button) == 0x000288, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Slot_C::Button' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Slot_C, Image_Accessory) == 0x000290, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Slot_C::Image_Accessory' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Slot_C, Image_Background) == 0x000298, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Slot_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Slot_C, Image_Barrel) == 0x0002A0, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Slot_C::Image_Barrel' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Slot_C, Image_Icon) == 0x0002A8, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Slot_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Slot_C, Image_Optic) == 0x0002B0, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Slot_C::Image_Optic' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Slot_C, Image_Underbarrel) == 0x0002B8, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Slot_C::Image_Underbarrel' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Slot_C, TextBlock_Name) == 0x0002C0, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Slot_C::TextBlock_Name' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Slot_C, TextBlock_Type) == 0x0002C8, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Slot_C::TextBlock_Type' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Slot_C, Type) == 0x0002D0, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Slot_C::Type' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Slot_C, GunJson) == 0x0002E8, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Slot_C::GunJson' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Slot_C, GunClass) == 0x0002F0, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Slot_C::GunClass' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Slot_C, OnClicked) == 0x0002F8, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Slot_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Slot_C, IsSelected) == 0x000308, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Slot_C::IsSelected' has a wrong offset!");

}

