#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_Minimap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Game_Minimap.UI_Game_Minimap_C
// 0x0078 (0x02F8 - 0x0280)
class UUI_Game_Minimap_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Background_Red;                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ControlPoints;                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lines;                                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LinesRainbow;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_CaptureProcessMyTeam;                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_CaptureProcessOpponentTeam;            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Map;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CapturePointsMyTeam;                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CapturePointsOpponentTeam;               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_GameTimer;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_GameTimer_CA_01;                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_GameTimer_CA_02;                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_Minimap_Map_C*                 UI_Map;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              PlayerState;                                       // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void Construct();
	void CreateControlPointMarkers();
	void ExecuteUbergraph_UI_Game_Minimap(int32 EntryPoint);
	void OnChangeTotalScore_Event();
	void OnGameTimer_Event();
	void OnSetTeam_Event();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Game_Minimap_C">();
	}
	static class UUI_Game_Minimap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Game_Minimap_C>();
	}
};
static_assert(alignof(UUI_Game_Minimap_C) == 0x000008, "Wrong alignment on UUI_Game_Minimap_C");
static_assert(sizeof(UUI_Game_Minimap_C) == 0x0002F8, "Wrong size on UUI_Game_Minimap_C");
static_assert(offsetof(UUI_Game_Minimap_C, UberGraphFrame) == 0x000280, "Member 'UUI_Game_Minimap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_C, Border_Background_Red) == 0x000288, "Member 'UUI_Game_Minimap_C::Border_Background_Red' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_C, HorizontalBox_ControlPoints) == 0x000290, "Member 'UUI_Game_Minimap_C::HorizontalBox_ControlPoints' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_C, Lines) == 0x000298, "Member 'UUI_Game_Minimap_C::Lines' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_C, LinesRainbow) == 0x0002A0, "Member 'UUI_Game_Minimap_C::LinesRainbow' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_C, ProgressBar_CaptureProcessMyTeam) == 0x0002A8, "Member 'UUI_Game_Minimap_C::ProgressBar_CaptureProcessMyTeam' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_C, ProgressBar_CaptureProcessOpponentTeam) == 0x0002B0, "Member 'UUI_Game_Minimap_C::ProgressBar_CaptureProcessOpponentTeam' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_C, SizeBox_Map) == 0x0002B8, "Member 'UUI_Game_Minimap_C::SizeBox_Map' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_C, TextBlock_CapturePointsMyTeam) == 0x0002C0, "Member 'UUI_Game_Minimap_C::TextBlock_CapturePointsMyTeam' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_C, TextBlock_CapturePointsOpponentTeam) == 0x0002C8, "Member 'UUI_Game_Minimap_C::TextBlock_CapturePointsOpponentTeam' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_C, TextBlock_GameTimer) == 0x0002D0, "Member 'UUI_Game_Minimap_C::TextBlock_GameTimer' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_C, TextBlock_GameTimer_CA_01) == 0x0002D8, "Member 'UUI_Game_Minimap_C::TextBlock_GameTimer_CA_01' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_C, TextBlock_GameTimer_CA_02) == 0x0002E0, "Member 'UUI_Game_Minimap_C::TextBlock_GameTimer_CA_02' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_C, UI_Map) == 0x0002E8, "Member 'UUI_Game_Minimap_C::UI_Map' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_C, PlayerState) == 0x0002F0, "Member 'UUI_Game_Minimap_C::PlayerState' has a wrong offset!");

}

