#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen_Loadout_Compact

#include "Basic.hpp"

#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_Game_SpawnScreen_Loadout_Compact.UI_Game_SpawnScreen_Loadout_Compact_C.AddNewItem
// 0x0050 (0x0050 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem final
{
public:
	class UPlayFabJsonObject*                     Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Compact_Item_C* CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemEntry                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0038(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem) == 0x000050, "Wrong size on UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem, Item) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem::Item' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000010, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem, CallFunc_Create_ReturnValue) == 0x000018, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem, CallFunc_GetStringField_ReturnValue) == 0x000020, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem, CallFunc_Conv_StringToName_ReturnValue) == 0x000030, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem, CallFunc_GetDataTableRowFromName_OutRow) == 0x000038, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000048, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_AddNewItem::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Compact.UI_Game_SpawnScreen_Loadout_Compact_C.ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact
// 0x0168 (0x0168 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_328A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_CameraTransitions_DarkenScreen_C*   CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_328B[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_328C[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_2;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_328D[0x5];                                     // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTask_General_CameraTransition_C*       CallFunc_CreateAction_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_328E[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Game_SpawnScreen_Loadout_Compact_Slot_C* K2Node_Select_Default;                             // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_328F[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3290[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ConstParm, ReferenceParm)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3291[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EModifiedData>                         K2Node_CustomEvent_ModifiedData;                   // 0x00F0(0x0010)(ConstParm, ReferenceParm)
	class FString                                 K2Node_CustomEvent_CustomString;                   // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EModifiedData                                 Temp_byte_Variable;                                // 0x0114(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3292[0x1];                                     // 0x0117(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0120(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_1; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadLevelInstanceBySoftObjectPtr_bOutSuccess; // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3293[0x6];                                     // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 CallFunc_LoadLevelInstanceBySoftObjectPtr_ReturnValue; // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_2; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3294[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<EModifiedData>& ModifiedData, const class FString& CustomString)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0154(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact) == 0x000168, "Wrong size on UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, EntryPoint) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_Create_ReturnValue) == 0x000010, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, Temp_bool_Has_Been_Initd_Variable) == 0x000038, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, Temp_int_Variable) == 0x00003C, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, K2Node_Event_IsDesignTime) == 0x000040, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000050, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_PlayAnimation_ReturnValue_1) == 0x000060, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000068, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_IsVisible_ReturnValue) == 0x00006C, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_Not_PreBool_ReturnValue) == 0x00006D, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_IsVisible_ReturnValue_1) == 0x00006E, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_Not_PreBool_ReturnValue_1) == 0x00006F, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_GetPlayerController_ReturnValue_1) == 0x000070, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x000078, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_IsVisible_ReturnValue_2) == 0x000081, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_IsVisible_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_Not_PreBool_ReturnValue_2) == 0x000082, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_PlayAnimation_ReturnValue_2) == 0x000088, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_PlayAnimation_ReturnValue_3) == 0x000090, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_CreateAction_ReturnValue) == 0x000098, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_CreateAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x0000A0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, K2Node_Select_Default) == 0x0000A8, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, Temp_bool_IsClosed_Variable) == 0x0000B0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000B8, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x0000C0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, K2Node_MakeArray_Array) == 0x0000D0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x0000E0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, K2Node_CustomEvent_ModifiedData) == 0x0000F0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::K2Node_CustomEvent_ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, K2Node_CustomEvent_CustomString) == 0x000100, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::K2Node_CustomEvent_CustomString' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, Temp_byte_Variable) == 0x000114, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000115, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_Array_Contains_ReturnValue) == 0x000116, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_GetPlayerController_ReturnValue_2) == 0x000118, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, Temp_name_Variable) == 0x000120, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_1) == 0x000128, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, K2Node_DynamicCast_bSuccess_2) == 0x000130, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_LoadLevelInstanceBySoftObjectPtr_bOutSuccess) == 0x000131, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_LoadLevelInstanceBySoftObjectPtr_bOutSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_LoadLevelInstanceBySoftObjectPtr_ReturnValue) == 0x000138, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_LoadLevelInstanceBySoftObjectPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, CallFunc_GetPlayerController_ReturnValue_3) == 0x000140, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_2) == 0x000148, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, K2Node_DynamicCast_bSuccess_3) == 0x000150, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact, K2Node_CreateDelegate_OutputDelegate_2) == 0x000154, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Compact.UI_Game_SpawnScreen_Loadout_Compact_C.Get_Image_Info_ToolTipWidget
// 0x0010 (0x0010 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Compact_C_Get_Image_Info_ToolTipWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Compact_ToolTipInfo_C* CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Compact_C_Get_Image_Info_ToolTipWidget) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Compact_C_Get_Image_Info_ToolTipWidget");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Compact_C_Get_Image_Info_ToolTipWidget) == 0x000010, "Wrong size on UI_Game_SpawnScreen_Loadout_Compact_C_Get_Image_Info_ToolTipWidget");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_Get_Image_Info_ToolTipWidget, ReturnValue) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_Get_Image_Info_ToolTipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_Get_Image_Info_ToolTipWidget, CallFunc_Create_ReturnValue) == 0x000008, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_Get_Image_Info_ToolTipWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Compact.UI_Game_SpawnScreen_Loadout_Compact_C.GetSlotByItemClass
// 0x0038 (0x0038 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass final
{
public:
	class UClass*                                 ItemClass;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Compact_Slot_C* ItemSlot;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 L_ItemClass;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGunSlot                                      Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3295[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Gun_General;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3296[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Game_SpawnScreen_Loadout_Compact_Slot_C* K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass) == 0x000038, "Wrong size on UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass, ItemClass) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass::ItemClass' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass, ItemSlot) == 0x000008, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass::ItemSlot' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass, L_ItemClass) == 0x000010, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass::L_ItemClass' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass, Temp_byte_Variable) == 0x000018, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass, K2Node_ClassDynamicCast_AsItem_Gun_General) == 0x000020, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass::K2Node_ClassDynamicCast_AsItem_Gun_General' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass, K2Node_ClassDynamicCast_bSuccess) == 0x000028, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass, K2Node_Select_Default) == 0x000030, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_GetSlotByItemClass::K2Node_Select_Default' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Compact.UI_Game_SpawnScreen_Loadout_Compact_C.OnUpdatePlayerCombinedInfo
// 0x0058 (0x0058 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3297[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3298[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue;          // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3299[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo) == 0x000058, "Wrong size on UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x000018, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000028, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo, CallFunc_GetObjectArrayField_ReturnValue) == 0x000030, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo::CallFunc_GetObjectArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo, CallFunc_Array_Get_Item) == 0x000048, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Compact.UI_Game_SpawnScreen_Loadout_Compact_C.OnUpdatePlayerCombinedInfo_Event
// 0x0020 (0x0020 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo_Event final
{
public:
	TArray<EModifiedData>                         ModifiedData;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 CustomString;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo_Event) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo_Event) == 0x000020, "Wrong size on UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo_Event, ModifiedData) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo_Event::ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo_Event, CustomString) == 0x000010, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_OnUpdatePlayerCombinedInfo_Event::CustomString' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Compact.UI_Game_SpawnScreen_Loadout_Compact_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Compact_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Compact_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Compact_C_PreConstruct");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Compact_C_PreConstruct) == 0x000001, "Wrong size on UI_Game_SpawnScreen_Loadout_Compact_C_PreConstruct");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Compact_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

