#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_Minimap_OtherIcon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_Game_Minimap_OtherIcon.UI_Game_Minimap_OtherIcon_C.ExecuteUbergraph_UI_Game_Minimap_OtherIcon
// 0x0130 (0x0130 - 0x0000)
struct UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DE9[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DEA[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FindAngle_Degrees;                        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize2D_ReturnValue;                      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_FindCoord_NewVector;                      // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DEB[0x6];                                     // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon) == 0x000008, "Wrong alignment on UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon");
static_assert(sizeof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon) == 0x000130, "Wrong size on UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, EntryPoint) == 0x000000, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000028, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x000030, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_BreakVector_X) == 0x000058, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_BreakVector_Y) == 0x000060, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_BreakVector_Z) == 0x000068, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000070, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_BreakVector_X_1) == 0x000088, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_BreakVector_Y_1) == 0x000090, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_BreakVector_Z_1) == 0x000098, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000A8, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000C0, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000C8, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000D0, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x0000D8, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_MakeVector2D_ReturnValue) == 0x0000E0, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_FindAngle_Degrees) == 0x0000F0, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_FindAngle_Degrees' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_VSize2D_ReturnValue) == 0x0000F8, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000100, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_FindCoord_NewVector) == 0x000108, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_FindCoord_NewVector' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_IsValid_ReturnValue_1) == 0x000119, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000120, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000128, "Member 'UI_Game_Minimap_OtherIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherIcon::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function UI_Game_Minimap_OtherIcon.UI_Game_Minimap_OtherIcon_C.FindAngle
// 0x0040 (0x0040 - 0x0000)
struct UI_Game_Minimap_OtherIcon_C_FindAngle final
{
public:
	struct FVector2D                              A;                                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Degrees;                                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAtan2_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Minimap_OtherIcon_C_FindAngle) == 0x000008, "Wrong alignment on UI_Game_Minimap_OtherIcon_C_FindAngle");
static_assert(sizeof(UI_Game_Minimap_OtherIcon_C_FindAngle) == 0x000040, "Wrong size on UI_Game_Minimap_OtherIcon_C_FindAngle");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_FindAngle, A) == 0x000000, "Member 'UI_Game_Minimap_OtherIcon_C_FindAngle::A' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_FindAngle, Degrees) == 0x000010, "Member 'UI_Game_Minimap_OtherIcon_C_FindAngle::Degrees' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_FindAngle, CallFunc_BreakVector2D_X) == 0x000018, "Member 'UI_Game_Minimap_OtherIcon_C_FindAngle::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_FindAngle, CallFunc_BreakVector2D_Y) == 0x000020, "Member 'UI_Game_Minimap_OtherIcon_C_FindAngle::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_FindAngle, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'UI_Game_Minimap_OtherIcon_C_FindAngle::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_FindAngle, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'UI_Game_Minimap_OtherIcon_C_FindAngle::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_FindAngle, CallFunc_DegAtan2_ReturnValue) == 0x000038, "Member 'UI_Game_Minimap_OtherIcon_C_FindAngle::CallFunc_DegAtan2_ReturnValue' has a wrong offset!");

// Function UI_Game_Minimap_OtherIcon.UI_Game_Minimap_OtherIcon_C.FindCoord
// 0x0060 (0x0060 - 0x0000)
struct UI_Game_Minimap_OtherIcon_C_FindCoord final
{
public:
	double                                        Distance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Degrees;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              NewVector;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegSin_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegCos_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Minimap_OtherIcon_C_FindCoord) == 0x000008, "Wrong alignment on UI_Game_Minimap_OtherIcon_C_FindCoord");
static_assert(sizeof(UI_Game_Minimap_OtherIcon_C_FindCoord) == 0x000060, "Wrong size on UI_Game_Minimap_OtherIcon_C_FindCoord");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_FindCoord, Distance) == 0x000000, "Member 'UI_Game_Minimap_OtherIcon_C_FindCoord::Distance' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_FindCoord, Degrees) == 0x000008, "Member 'UI_Game_Minimap_OtherIcon_C_FindCoord::Degrees' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_FindCoord, NewVector) == 0x000010, "Member 'UI_Game_Minimap_OtherIcon_C_FindCoord::NewVector' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_FindCoord, CallFunc_DegSin_ReturnValue) == 0x000020, "Member 'UI_Game_Minimap_OtherIcon_C_FindCoord::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_FindCoord, CallFunc_DegCos_ReturnValue) == 0x000028, "Member 'UI_Game_Minimap_OtherIcon_C_FindCoord::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_FindCoord, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'UI_Game_Minimap_OtherIcon_C_FindCoord::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_FindCoord, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'UI_Game_Minimap_OtherIcon_C_FindCoord::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_FindCoord, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000040, "Member 'UI_Game_Minimap_OtherIcon_C_FindCoord::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_FindCoord, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000048, "Member 'UI_Game_Minimap_OtherIcon_C_FindCoord::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherIcon_C_FindCoord, CallFunc_MakeVector2D_ReturnValue) == 0x000050, "Member 'UI_Game_Minimap_OtherIcon_C_FindCoord::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

}

