#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen_Player_ToolTip

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_Game_SpawnScreen_Player_ToolTip.UI_Game_SpawnScreen_Player_ToolTip_C.ExecuteUbergraph_UI_Game_SpawnScreen_Player_ToolTip
// 0x0038 (0x0038 - 0x0000)
struct UI_Game_SpawnScreen_Player_ToolTip_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_ToolTip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D5E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Player_ToolTip_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_ToolTip) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Player_ToolTip_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_ToolTip");
static_assert(sizeof(UI_Game_SpawnScreen_Player_ToolTip_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_ToolTip) == 0x000038, "Wrong size on UI_Game_SpawnScreen_Player_ToolTip_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_ToolTip");
static_assert(offsetof(UI_Game_SpawnScreen_Player_ToolTip_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_ToolTip, EntryPoint) == 0x000000, "Member 'UI_Game_SpawnScreen_Player_ToolTip_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_ToolTip::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_ToolTip_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_ToolTip, CallFunc_GetPlayerName_ReturnValue) == 0x000008, "Member 'UI_Game_SpawnScreen_Player_ToolTip_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_ToolTip::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_ToolTip_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_ToolTip, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'UI_Game_SpawnScreen_Player_ToolTip_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_ToolTip::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_ToolTip_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_ToolTip, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'UI_Game_SpawnScreen_Player_ToolTip_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_ToolTip::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

