#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen_Player_SquadMember

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "POLYGON_structs.hpp"
#include "E_SpawnTargetPermission_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_Game_SpawnScreen_Player_SquadMember.UI_Game_SpawnScreen_Player_SquadMember_C.CheckAllowSpawnOn
// 0x0138 (0x0138 - 0x0000)
struct UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D8B[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_GameState_Game_C*                CallFunc_GetGameStateBP_MyGameState;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AControlPoint*                          CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsCharacter_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D8C[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeam                                         CallFunc_GetTeam_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D8D[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_GameState_Game_C*                CallFunc_GetGameStateBP_MyGameState_1;             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ETeam                                         CallFunc_GetTeam_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D8E[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APG_PlayerState_Game*>           K2Node_Select_Default;                             // 0x0078(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D8F[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APG_PlayerState_Game*>           K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0090(0x0010)(ReferenceParm)
	class APG_PlayerState_Game*                   CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D90[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_Game_Character_C*                K2Node_DynamicCast_AsBP_PG_Game_Character;         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D91[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeam                                         CallFunc_GetTeam_ReturnValue_2;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D92[0x3];                                     // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D93[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D94[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D95[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn");
static_assert(sizeof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn) == 0x000138, "Wrong size on UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_GetTimeSeconds_ReturnValue) == 0x000010, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x000018, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_GetGameStateBP_MyGameState) == 0x000028, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_GetGameStateBP_MyGameState' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000030, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_Array_Get_Item) == 0x000038, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000040, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_ContainsCharacter_ReturnValue) == 0x000041, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_ContainsCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_GetTeam_ReturnValue) == 0x000060, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, Temp_bool_Variable) == 0x000061, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_GetGameStateBP_MyGameState_1) == 0x000068, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_GetGameStateBP_MyGameState_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_GetTeam_ReturnValue_1) == 0x000070, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_GetTeam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000071, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, K2Node_Select_Default) == 0x000078, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, Temp_int_Loop_Counter_Variable_1) == 0x000088, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000090, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_Array_Length_ReturnValue_1) == 0x0000A8, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, K2Node_DynamicCast_AsBP_PG_Game_Character) == 0x0000B0, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::K2Node_DynamicCast_AsBP_PG_Game_Character' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000C0, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000D8, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_VSize_ReturnValue) == 0x0000F0, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_GetTeam_ReturnValue_2) == 0x0000F8, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_GetTeam_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x0000F9, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000FA, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_BooleanAND_ReturnValue) == 0x0000FB, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000FC, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_Add_IntInt_ReturnValue_1) == 0x000100, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000108, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000110, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000118, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000120, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000128, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000130, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_CheckAllowSpawnOn::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function UI_Game_SpawnScreen_Player_SquadMember.UI_Game_SpawnScreen_Player_SquadMember_C.ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember
// 0x0270 (0x0270 - 0x0000)
struct UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D96[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D97[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D98[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsSpawnTarget;                        // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D99[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry_1;                         // 0x0054(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9A[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0090(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0108(0x0078)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9B[0x6];                                     // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0198(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9C[0x2];                                     // 0x01D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9D[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9E[0x5];                                     // 0x021B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0240(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember");
static_assert(sizeof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember) == 0x000270, "Wrong size on UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, EntryPoint) == 0x000000, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, Temp_struct_Variable) == 0x000010, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x000020, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, Temp_struct_Variable_1) == 0x00002C, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x00003C, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_Not_PreBool_ReturnValue) == 0x000050, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, K2Node_Event_IsSpawnTarget) == 0x000051, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::K2Node_Event_IsSpawnTarget' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, K2Node_Event_MyGeometry_1) == 0x000054, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::K2Node_Event_MyGeometry_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, K2Node_Event_MouseEvent_1) == 0x000090, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, K2Node_Event_MouseEvent) == 0x000108, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_IsValid_ReturnValue_1) == 0x000181, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_K2_SetTimer_ReturnValue) == 0x000188, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000190, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, K2Node_Event_MyGeometry) == 0x000198, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, K2Node_Event_InDeltaTime) == 0x0001D0, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001D4, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_BooleanAND_ReturnValue) == 0x0001D5, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0001D8, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0001E0, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_PlayAnimation_ReturnValue) == 0x0001E8, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_GetTimeSeconds_ReturnValue) == 0x0001F0, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x0001F8, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, K2Node_DynamicCast_bSuccess_1) == 0x000200, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000208, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000210, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000218, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000219, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, Temp_bool_Variable) == 0x00021A, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000220, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, K2Node_Select_Default) == 0x000228, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000238, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, K2Node_CreateDelegate_OutputDelegate_1) == 0x000240, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000250, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000258, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000260, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x000268, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_ExecuteUbergraph_UI_Game_SpawnScreen_Player_SquadMember::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function UI_Game_SpawnScreen_Player_SquadMember.UI_Game_SpawnScreen_Player_SquadMember_C.Get Player Icon Tool Tip Widget
// 0x0018 (0x0018 - 0x0000)
struct UI_Game_SpawnScreen_Player_SquadMember_C_Get_Player_Icon_Tool_Tip_Widget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Player_ToolTip_C*  CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Player_SquadMember_C_Get_Player_Icon_Tool_Tip_Widget) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Player_SquadMember_C_Get_Player_Icon_Tool_Tip_Widget");
static_assert(sizeof(UI_Game_SpawnScreen_Player_SquadMember_C_Get_Player_Icon_Tool_Tip_Widget) == 0x000018, "Wrong size on UI_Game_SpawnScreen_Player_SquadMember_C_Get_Player_Icon_Tool_Tip_Widget");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_Get_Player_Icon_Tool_Tip_Widget, ReturnValue) == 0x000000, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_Get_Player_Icon_Tool_Tip_Widget::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_Get_Player_Icon_Tool_Tip_Widget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_Get_Player_Icon_Tool_Tip_Widget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_Get_Player_Icon_Tool_Tip_Widget, CallFunc_Create_ReturnValue) == 0x000010, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_Get_Player_Icon_Tool_Tip_Widget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function UI_Game_SpawnScreen_Player_SquadMember.UI_Game_SpawnScreen_Player_SquadMember_C.GetTargetReference
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_SpawnScreen_Player_SquadMember_C_GetTargetReference final
{
public:
	class AActor*                                 Reference;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Player_SquadMember_C_GetTargetReference) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Player_SquadMember_C_GetTargetReference");
static_assert(sizeof(UI_Game_SpawnScreen_Player_SquadMember_C_GetTargetReference) == 0x000008, "Wrong size on UI_Game_SpawnScreen_Player_SquadMember_C_GetTargetReference");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_GetTargetReference, Reference) == 0x000000, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_GetTargetReference::Reference' has a wrong offset!");

// Function UI_Game_SpawnScreen_Player_SquadMember.UI_Game_SpawnScreen_Player_SquadMember_C.OnMouseButtonDown
// 0x0220 (0x0220 - 0x0000)
struct UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
};
static_assert(alignof(UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseButtonDown");
static_assert(sizeof(UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseButtonDown) == 0x000220, "Wrong size on UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseButtonDown");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UI_Game_SpawnScreen_Player_SquadMember.UI_Game_SpawnScreen_Player_SquadMember_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseEnter) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseEnter");
static_assert(sizeof(UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseEnter) == 0x0000B0, "Wrong size on UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseEnter");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UI_Game_SpawnScreen_Player_SquadMember.UI_Game_SpawnScreen_Player_SquadMember_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseLeave) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseLeave");
static_assert(sizeof(UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseLeave) == 0x000078, "Wrong size on UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseLeave");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UI_Game_SpawnScreen_Player_SquadMember.UI_Game_SpawnScreen_Player_SquadMember_C.SelectPlayerAsSpawnTarget
// 0x0040 (0x0040 - 0x0000)
struct UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9F[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHealth_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA0[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA1[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APG_Game_Character*                     K2Node_DynamicCast_AsPG_Game_Character;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA2[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_SpawnTarget_C>     CallFunc_SetNewSpawnTarget_SpawnTarget_CastInput;  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget");
static_assert(sizeof(UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget) == 0x000040, "Wrong size on UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget, CallFunc_GetHealth_ReturnValue) == 0x000004, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget, CallFunc_BooleanAND_ReturnValue) == 0x000018, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget, K2Node_DynamicCast_AsPG_Game_Character) == 0x000020, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget::K2Node_DynamicCast_AsPG_Game_Character' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget, CallFunc_SetNewSpawnTarget_SpawnTarget_CastInput) == 0x000030, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_SelectPlayerAsSpawnTarget::CallFunc_SetNewSpawnTarget_SpawnTarget_CastInput' has a wrong offset!");

// Function UI_Game_SpawnScreen_Player_SquadMember.UI_Game_SpawnScreen_Player_SquadMember_C.SetAsSpawnTarget
// 0x0001 (0x0001 - 0x0000)
struct UI_Game_SpawnScreen_Player_SquadMember_C_SetAsSpawnTarget final
{
public:
	bool                                          IsSpawnTarget;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Player_SquadMember_C_SetAsSpawnTarget) == 0x000001, "Wrong alignment on UI_Game_SpawnScreen_Player_SquadMember_C_SetAsSpawnTarget");
static_assert(sizeof(UI_Game_SpawnScreen_Player_SquadMember_C_SetAsSpawnTarget) == 0x000001, "Wrong size on UI_Game_SpawnScreen_Player_SquadMember_C_SetAsSpawnTarget");
static_assert(offsetof(UI_Game_SpawnScreen_Player_SquadMember_C_SetAsSpawnTarget, IsSpawnTarget) == 0x000000, "Member 'UI_Game_SpawnScreen_Player_SquadMember_C_SetAsSpawnTarget::IsSpawnTarget' has a wrong offset!");

// Function UI_Game_SpawnScreen_Player_SquadMember.UI_Game_SpawnScreen_Player_SquadMember_C.SetMarkerPosition
// 0x0060 (0x0060 - 0x0000)
struct UI_Game_SpawnScreen_Player_SquadMember_C_SetMarkerPosition final
{
public:
	struct FVector2D                              CallFunc_ConvertWorldPositionToMap_Position;       // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA3[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA4[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
