#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen_TeamBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_Game_SpawnScreen_TeamBase.UI_Game_SpawnScreen_TeamBase_C.ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase
// 0x0030 (0x0030 - 0x0000)
struct UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsSpawnTarget;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D76[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D77[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase");
static_assert(sizeof(UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase) == 0x000030, "Wrong size on UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase, EntryPoint) == 0x000000, "Member 'UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase, K2Node_Event_IsSpawnTarget) == 0x000004, "Member 'UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase::K2Node_Event_IsSpawnTarget' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x000010, "Member 'UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00001A, "Member 'UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00001B, "Member 'UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase, CallFunc_BooleanOR_ReturnValue) == 0x00001C, "Member 'UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'UI_Game_SpawnScreen_TeamBase_C_ExecuteUbergraph_UI_Game_SpawnScreen_TeamBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function UI_Game_SpawnScreen_TeamBase.UI_Game_SpawnScreen_TeamBase_C.FindAngle
// 0x0080 (0x0080 - 0x0000)
struct UI_Game_SpawnScreen_TeamBase_C_FindAngle final
{
public:
	struct FVector2D                              A;                                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Degrees;                                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D78[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAtan2_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_TeamBase_C_FindAngle) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_TeamBase_C_FindAngle");
static_assert(sizeof(UI_Game_SpawnScreen_TeamBase_C_FindAngle) == 0x000080, "Wrong size on UI_Game_SpawnScreen_TeamBase_C_FindAngle");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindAngle, A) == 0x000000, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindAngle::A' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindAngle, Degrees) == 0x000010, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindAngle::Degrees' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindAngle, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000018, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindAngle::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindAngle, CallFunc_BreakVector2D_X) == 0x000020, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindAngle::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindAngle, CallFunc_BreakVector2D_Y) == 0x000028, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindAngle::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindAngle, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000030, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindAngle::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindAngle, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindAngle::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindAngle, CallFunc_BreakRotator_Roll) == 0x000050, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindAngle::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindAngle, CallFunc_BreakRotator_Pitch) == 0x000054, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindAngle::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindAngle, CallFunc_BreakRotator_Yaw) == 0x000058, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindAngle::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindAngle, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindAngle::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindAngle, CallFunc_DegAtan2_ReturnValue) == 0x000068, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindAngle::CallFunc_DegAtan2_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindAngle, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000070, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindAngle::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindAngle, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000078, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindAngle::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function UI_Game_SpawnScreen_TeamBase.UI_Game_SpawnScreen_TeamBase_C.FindCoord
// 0x0060 (0x0060 - 0x0000)
struct UI_Game_SpawnScreen_TeamBase_C_FindCoord final
{
public:
	double                                        Distance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Degrees;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              NewVector;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegSin_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegCos_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_TeamBase_C_FindCoord) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_TeamBase_C_FindCoord");
static_assert(sizeof(UI_Game_SpawnScreen_TeamBase_C_FindCoord) == 0x000060, "Wrong size on UI_Game_SpawnScreen_TeamBase_C_FindCoord");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindCoord, Distance) == 0x000000, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindCoord::Distance' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindCoord, Degrees) == 0x000008, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindCoord::Degrees' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindCoord, NewVector) == 0x000010, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindCoord::NewVector' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindCoord, CallFunc_DegSin_ReturnValue) == 0x000020, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindCoord::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindCoord, CallFunc_DegCos_ReturnValue) == 0x000028, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindCoord::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindCoord, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindCoord::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindCoord, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindCoord::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindCoord, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000040, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindCoord::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindCoord, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000048, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindCoord::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_FindCoord, CallFunc_MakeVector2D_ReturnValue) == 0x000050, "Member 'UI_Game_SpawnScreen_TeamBase_C_FindCoord::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function UI_Game_SpawnScreen_TeamBase.UI_Game_SpawnScreen_TeamBase_C.GetTargetReference
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_SpawnScreen_TeamBase_C_GetTargetReference final
{
public:
	class AActor*                                 Reference;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_TeamBase_C_GetTargetReference) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_TeamBase_C_GetTargetReference");
static_assert(sizeof(UI_Game_SpawnScreen_TeamBase_C_GetTargetReference) == 0x000008, "Wrong size on UI_Game_SpawnScreen_TeamBase_C_GetTargetReference");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_GetTargetReference, Reference) == 0x000000, "Member 'UI_Game_SpawnScreen_TeamBase_C_GetTargetReference::Reference' has a wrong offset!");

// Function UI_Game_SpawnScreen_TeamBase.UI_Game_SpawnScreen_TeamBase_C.OnMouseButtonDown
// 0x0278 (0x0278 - 0x0000)
struct UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D79[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D7A[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APG_Game_Character*                     K2Node_DynamicCast_AsPG_Game_Character;            // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D7B[0x5];                                     // 0x01AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x01B0(0x00B8)()
	TScriptInterface<class IBI_SpawnTarget_C>     CallFunc_SetNewSpawnTarget_SpawnTarget_CastInput;  // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown");
static_assert(sizeof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown) == 0x000278, "Wrong size on UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown, CallFunc_GetPlayerController_ReturnValue) == 0x000168, "Member 'UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x000170, "Member 'UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown, CallFunc_GetPlayerController_ReturnValue_1) == 0x000180, "Member 'UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000188, "Member 'UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x000190, "Member 'UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown, K2Node_DynamicCast_bSuccess_1) == 0x000198, "Member 'UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown, K2Node_DynamicCast_AsPG_Game_Character) == 0x0001A0, "Member 'UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown::K2Node_DynamicCast_AsPG_Game_Character' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown, K2Node_DynamicCast_bSuccess_2) == 0x0001A8, "Member 'UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001A9, "Member 'UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown, CallFunc_Not_PreBool_ReturnValue) == 0x0001AA, "Member 'UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x0001B0, "Member 'UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown, CallFunc_SetNewSpawnTarget_SpawnTarget_CastInput) == 0x000268, "Member 'UI_Game_SpawnScreen_TeamBase_C_OnMouseButtonDown::CallFunc_SetNewSpawnTarget_SpawnTarget_CastInput' has a wrong offset!");

// Function UI_Game_SpawnScreen_TeamBase.UI_Game_SpawnScreen_TeamBase_C.SetAsSpawnTarget
// 0x0001 (0x0001 - 0x0000)
struct UI_Game_SpawnScreen_TeamBase_C_SetAsSpawnTarget final
{
public:
	bool                                          IsSpawnTarget;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_TeamBase_C_SetAsSpawnTarget) == 0x000001, "Wrong alignment on UI_Game_SpawnScreen_TeamBase_C_SetAsSpawnTarget");
static_assert(sizeof(UI_Game_SpawnScreen_TeamBase_C_SetAsSpawnTarget) == 0x000001, "Wrong size on UI_Game_SpawnScreen_TeamBase_C_SetAsSpawnTarget");
static_assert(offsetof(UI_Game_SpawnScreen_TeamBase_C_SetAsSpawnTarget, IsSpawnTarget) == 0x000000, "Member 'UI_Game_SpawnScreen_TeamBase_C_SetAsSpawnTarget::IsSpawnTarget' has a wrong offset!");

}

