#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_GamePoints

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_GamePoints.UI_GamePoints_C
// 0x0040 (0x02C0 - 0x0280)
class UUI_GamePoints_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AddNewPoint;                                       // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridPanel*                             GridPanel;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_AllGamePoints;                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_AllGamePoints;                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Points;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         AllGamePoint;                                      // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D9[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InterpolatedGamePoints;                            // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddNewPointMessage(int32 AddPoint, EAccrualTypeGameScore AddGameScoreType, class UObject* Instigator);
	void CreateGamePointEntryWidget(int32 AddPoint, EAccrualTypeGameScore AddGameScopeType, class UObject* Instigator);
	void ExecuteUbergraph_UI_GamePoints(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_GamePoints_C">();
	}
	static class UUI_GamePoints_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_GamePoints_C>();
	}
};
static_assert(alignof(UUI_GamePoints_C) == 0x000008, "Wrong alignment on UUI_GamePoints_C");
static_assert(sizeof(UUI_GamePoints_C) == 0x0002C0, "Wrong size on UUI_GamePoints_C");
static_assert(offsetof(UUI_GamePoints_C, UberGraphFrame) == 0x000280, "Member 'UUI_GamePoints_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_GamePoints_C, AddNewPoint) == 0x000288, "Member 'UUI_GamePoints_C::AddNewPoint' has a wrong offset!");
static_assert(offsetof(UUI_GamePoints_C, GridPanel) == 0x000290, "Member 'UUI_GamePoints_C::GridPanel' has a wrong offset!");
static_assert(offsetof(UUI_GamePoints_C, Overlay_AllGamePoints) == 0x000298, "Member 'UUI_GamePoints_C::Overlay_AllGamePoints' has a wrong offset!");
static_assert(offsetof(UUI_GamePoints_C, TextBlock_AllGamePoints) == 0x0002A0, "Member 'UUI_GamePoints_C::TextBlock_AllGamePoints' has a wrong offset!");
static_assert(offsetof(UUI_GamePoints_C, TextBlock_Points) == 0x0002A8, "Member 'UUI_GamePoints_C::TextBlock_Points' has a wrong offset!");
static_assert(offsetof(UUI_GamePoints_C, AllGamePoint) == 0x0002B0, "Member 'UUI_GamePoints_C::AllGamePoint' has a wrong offset!");
static_assert(offsetof(UUI_GamePoints_C, InterpolatedGamePoints) == 0x0002B8, "Member 'UUI_GamePoints_C::InterpolatedGamePoints' has a wrong offset!");

}

