#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_GunCharacteristics_Module

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "POLYGON_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_GunCharacteristics_Module.UI_GunCharacteristics_Module_C
// 0x0020 (0x02A0 - 0x0280)
class UUI_GunCharacteristics_Module_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Icon;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ModuleType;                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EGunModuleType                                ModuleType;                                        // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_GunCharacteristics_Module(int32 EntryPoint);
	void OnLoaded_28ADFBD243DD2DEB1FF81BA8F1B6A864(class UObject* Loaded);
	void PreConstruct(bool IsDesignTime);
	void Reset();
	void SetModule(class UClass* ModuleClass);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_GunCharacteristics_Module_C">();
	}
	static class UUI_GunCharacteristics_Module_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_GunCharacteristics_Module_C>();
	}
};
static_assert(alignof(UUI_GunCharacteristics_Module_C) == 0x000008, "Wrong alignment on UUI_GunCharacteristics_Module_C");
static_assert(sizeof(UUI_GunCharacteristics_Module_C) == 0x0002A0, "Wrong size on UUI_GunCharacteristics_Module_C");
static_assert(offsetof(UUI_GunCharacteristics_Module_C, UberGraphFrame) == 0x000280, "Member 'UUI_GunCharacteristics_Module_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_GunCharacteristics_Module_C, Image_Icon) == 0x000288, "Member 'UUI_GunCharacteristics_Module_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UUI_GunCharacteristics_Module_C, TextBlock_ModuleType) == 0x000290, "Member 'UUI_GunCharacteristics_Module_C::TextBlock_ModuleType' has a wrong offset!");
static_assert(offsetof(UUI_GunCharacteristics_Module_C, ModuleType) == 0x000298, "Member 'UUI_GunCharacteristics_Module_C::ModuleType' has a wrong offset!");

}

