#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_Notifications_CountdownTimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Game_Notifications_CountdownTimer.UI_Game_Notifications_CountdownTimer_C
// 0x0058 (0x02D8 - 0x0280)
class UUI_Game_Notifications_CountdownTimer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Timer;                                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Countdown;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_TextInfo_01;                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_TextInfo_02;                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_TextInfo_03;                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Timer_01;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Timer_02;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Timer_03;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Timer_Anim;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_PG_GameState_Game_C*                GameState;                                         // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_Game_Notifications_CountdownTimer(int32 EntryPoint);
	void OnChangeGameState_Event();
	void OnGameTimer_Event();
	void SetupByGameState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Game_Notifications_CountdownTimer_C">();
	}
	static class UUI_Game_Notifications_CountdownTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Game_Notifications_CountdownTimer_C>();
	}
};
static_assert(alignof(UUI_Game_Notifications_CountdownTimer_C) == 0x000008, "Wrong alignment on UUI_Game_Notifications_CountdownTimer_C");
static_assert(sizeof(UUI_Game_Notifications_CountdownTimer_C) == 0x0002D8, "Wrong size on UUI_Game_Notifications_CountdownTimer_C");
static_assert(offsetof(UUI_Game_Notifications_CountdownTimer_C, UberGraphFrame) == 0x000280, "Member 'UUI_Game_Notifications_CountdownTimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Game_Notifications_CountdownTimer_C, Timer) == 0x000288, "Member 'UUI_Game_Notifications_CountdownTimer_C::Timer' has a wrong offset!");
static_assert(offsetof(UUI_Game_Notifications_CountdownTimer_C, Overlay_Countdown) == 0x000290, "Member 'UUI_Game_Notifications_CountdownTimer_C::Overlay_Countdown' has a wrong offset!");
static_assert(offsetof(UUI_Game_Notifications_CountdownTimer_C, TextBlock_TextInfo_01) == 0x000298, "Member 'UUI_Game_Notifications_CountdownTimer_C::TextBlock_TextInfo_01' has a wrong offset!");
static_assert(offsetof(UUI_Game_Notifications_CountdownTimer_C, TextBlock_TextInfo_02) == 0x0002A0, "Member 'UUI_Game_Notifications_CountdownTimer_C::TextBlock_TextInfo_02' has a wrong offset!");
static_assert(offsetof(UUI_Game_Notifications_CountdownTimer_C, TextBlock_TextInfo_03) == 0x0002A8, "Member 'UUI_Game_Notifications_CountdownTimer_C::TextBlock_TextInfo_03' has a wrong offset!");
static_assert(offsetof(UUI_Game_Notifications_CountdownTimer_C, TextBlock_Timer_01) == 0x0002B0, "Member 'UUI_Game_Notifications_CountdownTimer_C::TextBlock_Timer_01' has a wrong offset!");
static_assert(offsetof(UUI_Game_Notifications_CountdownTimer_C, TextBlock_Timer_02) == 0x0002B8, "Member 'UUI_Game_Notifications_CountdownTimer_C::TextBlock_Timer_02' has a wrong offset!");
static_assert(offsetof(UUI_Game_Notifications_CountdownTimer_C, TextBlock_Timer_03) == 0x0002C0, "Member 'UUI_Game_Notifications_CountdownTimer_C::TextBlock_Timer_03' has a wrong offset!");
static_assert(offsetof(UUI_Game_Notifications_CountdownTimer_C, TextBlock_Timer_Anim) == 0x0002C8, "Member 'UUI_Game_Notifications_CountdownTimer_C::TextBlock_Timer_Anim' has a wrong offset!");
static_assert(offsetof(UUI_Game_Notifications_CountdownTimer_C, GameState) == 0x0002D0, "Member 'UUI_Game_Notifications_CountdownTimer_C::GameState' has a wrong offset!");

}

