#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen_Loadout

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Game_SpawnScreen_Loadout.UI_Game_SpawnScreen_Loadout_C
// 0x0020 (0x02A0 - 0x0280)
class UUI_Game_SpawnScreen_Loadout_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       SwitchingWindows;                                  // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Compact_C* UI_SpawnScreen_Loadout_Compact;                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_C*    UI_SpawnScreen_Loadout_Full;                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_LoadoutType;                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Game_SpawnScreen_Loadout_C">();
	}
	static class UUI_Game_SpawnScreen_Loadout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Game_SpawnScreen_Loadout_C>();
	}
};
static_assert(alignof(UUI_Game_SpawnScreen_Loadout_C) == 0x000008, "Wrong alignment on UUI_Game_SpawnScreen_Loadout_C");
static_assert(sizeof(UUI_Game_SpawnScreen_Loadout_C) == 0x0002A0, "Wrong size on UUI_Game_SpawnScreen_Loadout_C");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_C, SwitchingWindows) == 0x000280, "Member 'UUI_Game_SpawnScreen_Loadout_C::SwitchingWindows' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_C, UI_SpawnScreen_Loadout_Compact) == 0x000288, "Member 'UUI_Game_SpawnScreen_Loadout_C::UI_SpawnScreen_Loadout_Compact' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_C, UI_SpawnScreen_Loadout_Full) == 0x000290, "Member 'UUI_Game_SpawnScreen_Loadout_C::UI_SpawnScreen_Loadout_Full' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_C, WidgetSwitcher_LoadoutType) == 0x000298, "Member 'UUI_Game_SpawnScreen_Loadout_C::WidgetSwitcher_LoadoutType' has a wrong offset!");

}

