#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C
// 0x0090 (0x0310 - 0x0280)
class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ProgressInMenuHovered;                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ProgressInMenuAnimation;                           // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Back;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_ProgressInMenu;                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_List_C* UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_List; // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_C* UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Accessory; // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_C* UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Barrel; // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_C* UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Magazine; // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_C* UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Optic; // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_C* UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Skin; // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_C* UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Strap; // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_C* UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Underbarrel; // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_C* UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith; // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClickBack;                                       // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Button_Back_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Button_OldModulesInfo_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Button_OldModulesInfo_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Button_OldModulesInfo_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector(int32 EntryPoint);
	void GetAllModuleSlots(TArray<class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_C*>* Slots);
	void GetSlotByModuleType(EGunModuleType ModuleType, class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_C** Param_Slot);
	void HideIncompatibleModuleSlots();
	void OnClickBack__DelegateSignature();
	void OnUpdateGunData();
	void OnUpdatePlayerCombinedInfo_Event(const TArray<EModifiedData>& ModifiedData, const class FString& CustomString);
	void PreConstruct(bool IsDesignTime);
	void Reset();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C">();
	}
	static class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C>();
	}
};
static_assert(alignof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C) == 0x000008, "Wrong alignment on UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C");
static_assert(sizeof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C) == 0x000310, "Wrong size on UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C, UberGraphFrame) == 0x000280, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C, ProgressInMenuHovered) == 0x000288, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C::ProgressInMenuHovered' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C, ProgressInMenuAnimation) == 0x000290, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C::ProgressInMenuAnimation' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C, Button_Back) == 0x000298, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C, Button_ProgressInMenu) == 0x0002A0, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C::Button_ProgressInMenu' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C, CanvasPanel) == 0x0002A8, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C, UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_List) == 0x0002B0, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C::UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_List' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C, UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Accessory) == 0x0002B8, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C::UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Accessory' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C, UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Barrel) == 0x0002C0, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C::UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Barrel' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C, UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Magazine) == 0x0002C8, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C::UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Magazine' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C, UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Optic) == 0x0002D0, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C::UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Optic' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C, UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Skin) == 0x0002D8, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C::UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Skin' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C, UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Strap) == 0x0002E0, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C::UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Strap' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C, UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Underbarrel) == 0x0002E8, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C::UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_Slot_Underbarrel' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C, WidgetSwitcher) == 0x0002F0, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C, UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith) == 0x0002F8, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C::UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C, OnClickBack) == 0x000300, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_Selector_C::OnClickBack' has a wrong offset!");

}

