#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ST_ItemInfo_structs.hpp"
#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C.AddGun
// 0x00F0 (0x00F0 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun final
{
public:
	struct FST_ItemInfo                           GunInfo;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FST_ItemInfo                           L_GunInfo;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D0A[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGunSlot                                      Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D0B[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D0C[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D0D[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D0E[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_1;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D0F[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Gun_General;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D10[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_Entry_C* CallFunc_SpawnObject_ReturnValue;                  // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_C* K2Node_Select_Default;                             // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UListView*                              CallFunc_GetGunListByGunClass_List;                // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UListView*                              K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	TArray<class UObject*>                        K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x00B0(0x0010)(ConstParm, ReferenceParm)
	EGunSlot                                      Temp_byte_Variable_1;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D11[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_Entry_C* K2Node_DynamicCast_AsBP_Game_Spawn_Screen_Loadout_Full_Weapon_Gun_Selector_Item_Entry; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D12[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_EquippedGun_C* K2Node_Select_Default_1;                           // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun) == 0x0000F0, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, GunInfo) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::GunInfo' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, L_GunInfo) == 0x000010, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::L_GunInfo' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, Temp_bool_True_if_break_was_hit_Variable) == 0x000020, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, Temp_int_Array_Index_Variable) == 0x000024, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, Temp_byte_Variable) == 0x000029, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x000040, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_GetObjectField_ReturnValue) == 0x000050, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_HasField_ReturnValue) == 0x000058, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_HasField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_GetObjectField_ReturnValue_1) == 0x000060, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_GetBoolField_ReturnValue) == 0x000068, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_GetBoolField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_HasField_ReturnValue_1) == 0x000069, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_HasField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_BooleanAND_ReturnValue) == 0x00006A, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_BooleanAND_ReturnValue_1) == 0x00006B, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, K2Node_ClassDynamicCast_AsItem_Gun_General) == 0x000070, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::K2Node_ClassDynamicCast_AsItem_Gun_General' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, K2Node_ClassDynamicCast_bSuccess) == 0x000078, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_SpawnObject_ReturnValue) == 0x000080, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, K2Node_Select_Default) == 0x000088, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_GetGunListByGunClass_List) == 0x000090, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_GetGunListByGunClass_List' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000098, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_GetListItems_ReturnValue) == 0x0000A0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, K2Node_LowEntry_LocalVariable_Value__1_Object) == 0x0000B0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::K2Node_LowEntry_LocalVariable_Value__1_Object' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, Temp_byte_Variable_1) == 0x0000C0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, K2Node_DynamicCast_AsBP_Game_Spawn_Screen_Loadout_Full_Weapon_Gun_Selector_Item_Entry) == 0x0000D0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::K2Node_DynamicCast_AsBP_Game_Spawn_Screen_Loadout_Full_Weapon_Gun_Selector_Item_Entry' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, K2Node_Select_Default_1) == 0x0000E0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_Less_IntInt_ReturnValue) == 0x0000EC, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_BooleanAND_ReturnValue_2) == 0x0000ED, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0000EE, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AddGun::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C.AttachActiveGunToTarget
// 0x01C8 (0x01C8 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget final
{
public:
	class ATargetPoint*                           L_TargetPoint;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D13[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D14[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult; // 0x0080(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D15[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0170(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D16[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0188(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D17[0x3];                                     // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATargetPoint*>                   CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x01A8(0x0010)(ReferenceParm)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue;             // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D18[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATargetPoint*                           CallFunc_Array_Get_Item_1;                         // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget) == 0x0001C8, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, L_TargetPoint) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::L_TargetPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, Temp_int_Array_Index_Variable) == 0x000008, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000010, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000028, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, CallFunc_GetComponentBounds_Origin) == 0x000030, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, CallFunc_GetComponentBounds_BoxExtent) == 0x000048, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, CallFunc_GetComponentBounds_SphereRadius) == 0x000060, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, CallFunc_IsValid_ReturnValue) == 0x000064, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, CallFunc_Divide_VectorVector_ReturnValue) == 0x000068, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, CallFunc_K2_SetActorRelativeLocation_SweepHitResult) == 0x000080, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::CallFunc_K2_SetActorRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, Temp_int_Loop_Counter_Variable) == 0x000168, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, CallFunc_GetAttachedActors_OutActors) == 0x000170, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, CallFunc_Add_IntInt_ReturnValue) == 0x000180, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000188, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, CallFunc_Array_Get_Item) == 0x000198, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, CallFunc_Array_Length_ReturnValue) == 0x0001A0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, CallFunc_Less_IntInt_ReturnValue) == 0x0001A4, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x0001A8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, CallFunc_K2_AttachToActor_ReturnValue) == 0x0001B8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::CallFunc_K2_AttachToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget, CallFunc_Array_Get_Item_1) == 0x0001C0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_AttachActiveGunToTarget::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C.BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Assault_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Assault_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Assault_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Assault_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Assault_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Assault_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Assault_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Assault_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C.BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_LMG_K2Node_ComponentBoundEvent_6_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_LMG_K2Node_ComponentBoundEvent_6_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_LMG_K2Node_ComponentBoundEvent_6_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_LMG_K2Node_ComponentBoundEvent_6_OnClick__DelegateSignature");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_LMG_K2Node_ComponentBoundEvent_6_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_LMG_K2Node_ComponentBoundEvent_6_OnClick__DelegateSignature");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_LMG_K2Node_ComponentBoundEvent_6_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_LMG_K2Node_ComponentBoundEvent_6_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C.BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Marksman_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Marksman_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Marksman_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Marksman_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Marksman_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Marksman_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Marksman_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Marksman_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C.BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Pistol_K2Node_ComponentBoundEvent_7_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Pistol_K2Node_ComponentBoundEvent_7_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Pistol_K2Node_ComponentBoundEvent_7_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Pistol_K2Node_ComponentBoundEvent_7_OnClick__DelegateSignature");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Pistol_K2Node_ComponentBoundEvent_7_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Pistol_K2Node_ComponentBoundEvent_7_OnClick__DelegateSignature");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Pistol_K2Node_ComponentBoundEvent_7_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Pistol_K2Node_ComponentBoundEvent_7_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C.BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Shotgun_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Shotgun_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Shotgun_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Shotgun_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Shotgun_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Shotgun_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Shotgun_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Shotgun_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C.BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_SMG_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_SMG_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_SMG_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_SMG_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_SMG_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_SMG_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_SMG_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_SMG_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C.BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Sniper_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Sniper_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Sniper_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Sniper_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Sniper_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Sniper_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Sniper_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_UI_Button_Sniper_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C.ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector
// 0x0108 (0x0108 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D19[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTask_General_CameraTransition_C*       CallFunc_CreateAction_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTask_General_CameraTransition_C*       CallFunc_CreateAction_ReturnValue_1;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1A[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<EModifiedData>& ModifiedData, const class FString& CustomString)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x002C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1B[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_6;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1C[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_5;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_4;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_3;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_2;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_1;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1D[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x008C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00C8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Game*                   K2Node_DynamicCast_AsPG_Player_State_Game;         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1E[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EModifiedData>                         K2Node_CustomEvent_ModifiedData;                   // 0x00E8(0x0010)(ConstParm, ReferenceParm)
	class FString                                 K2Node_CustomEvent_CustomString;                   // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector) == 0x000108, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, EntryPoint) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, CallFunc_CreateAction_ReturnValue) == 0x000008, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::CallFunc_CreateAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, CallFunc_CreateAction_ReturnValue_1) == 0x000010, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::CallFunc_CreateAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, Temp_bool_Has_Been_Initd_Variable) == 0x000018, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, Temp_name_Variable) == 0x00002C, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, Temp_bool_IsClosed_Variable) == 0x000034, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, K2Node_ComponentBoundEvent_Button_6) == 0x000040, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x000048, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, K2Node_ComponentBoundEvent_Button_5) == 0x000058, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, K2Node_ComponentBoundEvent_Button_4) == 0x000060, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, K2Node_ComponentBoundEvent_Button_3) == 0x000068, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, K2Node_ComponentBoundEvent_Button_2) == 0x000070, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, K2Node_ComponentBoundEvent_Button_1) == 0x000078, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, K2Node_ComponentBoundEvent_Button) == 0x000080, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, K2Node_Event_IsDesignTime) == 0x000088, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, K2Node_Event_MyGeometry) == 0x00008C, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, K2Node_Event_InDeltaTime) == 0x0000C4, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, Temp_name_Variable_1) == 0x0000C8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000D0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, K2Node_DynamicCast_AsPG_Player_State_Game) == 0x0000D8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::K2Node_DynamicCast_AsPG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, K2Node_CustomEvent_ModifiedData) == 0x0000E8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::K2Node_CustomEvent_ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector, K2Node_CustomEvent_CustomString) == 0x0000F8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector::K2Node_CustomEvent_CustomString' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C.GetEquippedGunByItemClass
// 0x0030 (0x0030 - 0x0000)
