#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_Notifications_CountdownTimer

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_Game_Notifications_CountdownTimer.UI_Game_Notifications_CountdownTimer_C.ExecuteUbergraph_UI_Game_Notifications_CountdownTimer
// 0x0068 (0x0068 - 0x0000)
struct UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2B[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_GameState_Game_C*                CallFunc_GetGameStateBP_MyGameState;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameTimer_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2C[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0018)()
	int32                                         CallFunc_GetGameTimer_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer) == 0x000008, "Wrong alignment on UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer");
static_assert(sizeof(UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer) == 0x000068, "Wrong size on UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer");
static_assert(offsetof(UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer, EntryPoint) == 0x000000, "Member 'UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer, Temp_bool_Has_Been_Initd_Variable) == 0x000020, "Member 'UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer, Temp_bool_IsClosed_Variable) == 0x000021, "Member 'UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer, CallFunc_GetGameStateBP_MyGameState) == 0x000028, "Member 'UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer::CallFunc_GetGameStateBP_MyGameState' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer, CallFunc_GetGameTimer_ReturnValue) == 0x000030, "Member 'UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer::CallFunc_GetGameTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer, CallFunc_Conv_IntToText_ReturnValue) == 0x000038, "Member 'UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer, CallFunc_GetGameTimer_ReturnValue_1) == 0x000050, "Member 'UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer::CallFunc_GetGameTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000054, "Member 'UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000055, "Member 'UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000056, "Member 'UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer, CallFunc_BooleanAND_ReturnValue) == 0x000057, "Member 'UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'UI_Game_Notifications_CountdownTimer_C_ExecuteUbergraph_UI_Game_Notifications_CountdownTimer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function UI_Game_Notifications_CountdownTimer.UI_Game_Notifications_CountdownTimer_C.SetupByGameState
// 0x0002 (0x0002 - 0x0000)
struct UI_Game_Notifications_CountdownTimer_C_SetupByGameState final
{
public:
	bool                                          CallFunc_WithEditor_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Notifications_CountdownTimer_C_SetupByGameState) == 0x000001, "Wrong alignment on UI_Game_Notifications_CountdownTimer_C_SetupByGameState");
static_assert(sizeof(UI_Game_Notifications_CountdownTimer_C_SetupByGameState) == 0x000002, "Wrong size on UI_Game_Notifications_CountdownTimer_C_SetupByGameState");
static_assert(offsetof(UI_Game_Notifications_CountdownTimer_C_SetupByGameState, CallFunc_WithEditor_ReturnValue) == 0x000000, "Member 'UI_Game_Notifications_CountdownTimer_C_SetupByGameState::CallFunc_WithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_CountdownTimer_C_SetupByGameState, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'UI_Game_Notifications_CountdownTimer_C_SetupByGameState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

