#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_Minimap_OtherPlayerIcon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_Game_Minimap_OtherPlayerIcon.UI_Game_Minimap_OtherPlayerIcon_C.CalculateMarkerPosition
// 0x0160 (0x0160 - 0x0000)
struct UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition final
{
public:
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BE8[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_2;         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BE9[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BEA[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FindAngle_Degrees;                        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize2D_ReturnValue;                      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_FindCoord_NewVector;                      // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderTransformAngle_Angle_ImplicitCast; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition) == 0x000008, "Wrong alignment on UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition");
static_assert(sizeof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition) == 0x000160, "Wrong size on UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000000, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000008, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000020, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_BreakRotator_Roll) == 0x000038, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_BreakRotator_Pitch) == 0x00003C, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_BreakRotator_Yaw) == 0x000040, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_BreakRotator_Roll_1) == 0x000044, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_BreakRotator_Pitch_1) == 0x000048, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_BreakRotator_Yaw_1) == 0x00004C, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000050, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000058, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_BreakVector_X) == 0x000080, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_BreakVector_Y) == 0x000088, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_BreakVector_Z) == 0x000090, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_GetPlayerCharacter_ReturnValue_2) == 0x000098, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_GetPlayerCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000A8, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_BreakVector_X_1) == 0x0000C0, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_BreakVector_Y_1) == 0x0000C8, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_BreakVector_Z_1) == 0x0000D0, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_IsValid_ReturnValue_1) == 0x0000D8, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000E0, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000E8, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x0000F0, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000100, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_GetParent_ReturnValue) == 0x000108, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_MakeVector2D_ReturnValue) == 0x000110, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_IsValid_ReturnValue_2) == 0x000120, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_FindAngle_Degrees) == 0x000128, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_FindAngle_Degrees' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_VSize2D_ReturnValue) == 0x000130, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_FindCoord_NewVector) == 0x000138, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_FindCoord_NewVector' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000148, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000150, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition, CallFunc_SetRenderTransformAngle_Angle_ImplicitCast) == 0x000158, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_CalculateMarkerPosition::CallFunc_SetRenderTransformAngle_Angle_ImplicitCast' has a wrong offset!");

// Function UI_Game_Minimap_OtherPlayerIcon.UI_Game_Minimap_OtherPlayerIcon_C.ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon
// 0x0128 (0x0128 - 0x0000)
struct UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BEB[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BEC[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BED[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BEE[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BEF[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_Game_Character_C*                K2Node_DynamicCast_AsBP_PG_Game_Character;         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BF0[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BF1[0x2];                                     // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BF2[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon) == 0x000008, "Wrong alignment on UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon");
static_assert(sizeof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon) == 0x000128, "Wrong size on UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, EntryPoint) == 0x000000, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, Temp_bool_Variable) == 0x000024, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, Temp_struct_Variable) == 0x000028, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, Temp_struct_Variable_1) == 0x000038, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, Temp_bool_Variable_1) == 0x000048, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, Temp_struct_Variable_2) == 0x000050, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, Temp_struct_Variable_3) == 0x000060, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, K2Node_CreateDelegate_OutputDelegate_2) == 0x000070, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000080, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, CallFunc_GetOwningPlayer_ReturnValue) == 0x000088, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x000090, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, CallFunc_GetParent_ReturnValue) == 0x0000B8, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, K2Node_DynamicCast_AsBP_PG_Game_Character) == 0x0000C8, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::K2Node_DynamicCast_AsBP_PG_Game_Character' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x0000D8, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, K2Node_DynamicCast_bSuccess_2) == 0x0000E0, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, CallFunc_IsValid_ReturnValue_2) == 0x0000E1, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, K2Node_Select_Default) == 0x0000E4, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, K2Node_Select_Default_1) == 0x0000F8, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, K2Node_CreateDelegate_OutputDelegate_3) == 0x000108, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000118, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000120, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function UI_Game_Minimap_OtherPlayerIcon.UI_Game_Minimap_OtherPlayerIcon_C.FindAngle
// 0x0080 (0x0080 - 0x0000)
struct UI_Game_Minimap_OtherPlayerIcon_C_FindAngle final
{
public:
	struct FVector2D                              In;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Degrees;                                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BF3[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAtan2_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Minimap_OtherPlayerIcon_C_FindAngle) == 0x000008, "Wrong alignment on UI_Game_Minimap_OtherPlayerIcon_C_FindAngle");
static_assert(sizeof(UI_Game_Minimap_OtherPlayerIcon_C_FindAngle) == 0x000080, "Wrong size on UI_Game_Minimap_OtherPlayerIcon_C_FindAngle");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_FindAngle, In) == 0x000000, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_FindAngle::In' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_FindAngle, Degrees) == 0x000010, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_FindAngle::Degrees' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_FindAngle, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000018, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_FindAngle::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_FindAngle, CallFunc_BreakVector2D_X) == 0x000020, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_FindAngle::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_FindAngle, CallFunc_BreakVector2D_Y) == 0x000028, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_FindAngle::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_FindAngle, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000030, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_FindAngle::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_FindAngle, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_FindAngle::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_FindAngle, CallFunc_BreakRotator_Roll) == 0x000050, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_FindAngle::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_FindAngle, CallFunc_BreakRotator_Pitch) == 0x000054, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_FindAngle::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_FindAngle, CallFunc_BreakRotator_Yaw) == 0x000058, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_FindAngle::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_FindAngle, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_FindAngle::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_FindAngle, CallFunc_DegAtan2_ReturnValue) == 0x000068, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_FindAngle::CallFunc_DegAtan2_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_FindAngle, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000070, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_FindAngle::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_FindAngle, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000078, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_FindAngle::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function UI_Game_Minimap_OtherPlayerIcon.UI_Game_Minimap_OtherPlayerIcon_C.FindCoord
// 0x0060 (0x0060 - 0x0000)
struct UI_Game_Minimap_OtherPlayerIcon_C_FindCoord final
{
public:
	double                                        Distance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Degrees;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              NewVector;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegSin_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegCos_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Minimap_OtherPlayerIcon_C_FindCoord) == 0x000008, "Wrong alignment on UI_Game_Minimap_OtherPlayerIcon_C_FindCoord");
static_assert(sizeof(UI_Game_Minimap_OtherPlayerIcon_C_FindCoord) == 0x000060, "Wrong size on UI_Game_Minimap_OtherPlayerIcon_C_FindCoord");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_FindCoord, Distance) == 0x000000, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_FindCoord::Distance' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_FindCoord, Degrees) == 0x000008, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_FindCoord::Degrees' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_OtherPlayerIcon_C_FindCoord, NewVector) == 0x000010, "Member 'UI_Game_Minimap_OtherPlayerIcon_C_FindCoord::NewVector' has a wrong offset!");
