#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C.AsyncLoadIcon
// 0x0030 (0x0030 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_AsyncLoadIcon final
{
public:
	TSoftObjectPtr<class UObject>                 ItemIcon;                                          // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_AsyncLoadIcon) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_AsyncLoadIcon");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_AsyncLoadIcon) == 0x000030, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_AsyncLoadIcon");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_AsyncLoadIcon, ItemIcon) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_AsyncLoadIcon::ItemIcon' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C.ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item
// 0x01B8 (0x01B8 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AItem_Gun_General* OldGun)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CCB[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CCC[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CCD[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_Entry_C* K2Node_DynamicCast_AsBP_Game_Spawn_Screen_Loadout_Full_Weapon_Gun_Selector_Item_Entry; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CCE[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_EquippedGun_C* CallFunc_GetEquippedGunByItemClass_Gun;            // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_EquippedGun_C* CallFunc_GetEquippedGunByItemClass_Gun_1;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CCF[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 K2Node_CustomEvent_ItemIcon;                       // 0x00A8(0x0030)(HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ClassClass_ReturnValue;          // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD0[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_1; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD1[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetSlotByItemClass_Slot;                  // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_C* K2Node_DynamicCast_AsUI_Game_Spawn_Screen_Loadout_Full_Weapon_Gun_Slot; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD2[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Game*                   K2Node_DynamicCast_AsPG_Player_State_Game;         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD3[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AItem_Gun_General*                      K2Node_CustomEvent_oldGun;                         // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0158(0x0010)(ConstParm, ReferenceParm)
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x0168(0x0010)(ConstParm, ReferenceParm)
	TArray<class FString>                         CallFunc_EquipItems_ReturnValue;                   // 0x0178(0x0010)(ReferenceParm)
	class UObject*                                Temp_object_Variable;                              // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD4[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetSlotByItemClass_Slot_1;                // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_C* K2Node_DynamicCast_AsUI_Game_Spawn_Screen_Loadout_Full_Weapon_Gun_Slot_1; // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item) == 0x0001B8, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, EntryPoint) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_Event_bIsExpanded) == 0x000034, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_Event_bIsSelected) == 0x000040, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_PlayAnimationForward_ReturnValue) == 0x000048, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000050, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_GetPlayerController_ReturnValue) == 0x000058, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_Event_ListItemObject) == 0x000060, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x000068, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_DynamicCast_AsBP_Game_Spawn_Screen_Loadout_Full_Weapon_Gun_Selector_Item_Entry) == 0x000078, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_DynamicCast_AsBP_Game_Spawn_Screen_Loadout_Full_Weapon_Gun_Selector_Item_Entry' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_IsValid_ReturnValue) == 0x000081, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_GetEquippedGunByItemClass_Gun) == 0x000088, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_GetEquippedGunByItemClass_Gun' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_GetEquippedGunByItemClass_Gun_1) == 0x000090, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_GetEquippedGunByItemClass_Gun_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_IsValid_ReturnValue_1) == 0x000098, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_CustomEvent_Loaded) == 0x0000A0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_CustomEvent_ItemIcon) == 0x0000A8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_CustomEvent_ItemIcon' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0000D8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_IsValid_ReturnValue_2) == 0x0000E0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_NotEqual_ClassClass_ReturnValue) == 0x0000E1, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_NotEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000E8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_1) == 0x0000F0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_DynamicCast_bSuccess_2) == 0x0000F8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_GetSlotByItemClass_Slot) == 0x000100, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_GetSlotByItemClass_Slot' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_DynamicCast_AsUI_Game_Spawn_Screen_Loadout_Full_Weapon_Gun_Slot) == 0x000108, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_DynamicCast_AsUI_Game_Spawn_Screen_Loadout_Full_Weapon_Gun_Slot' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_DynamicCast_bSuccess_3) == 0x000110, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_GetPlayerController_ReturnValue_2) == 0x000118, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_DynamicCast_AsPG_Player_State_Game) == 0x000120, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_DynamicCast_AsPG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_DynamicCast_bSuccess_4) == 0x000128, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_CustomEvent_oldGun) == 0x000130, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_CustomEvent_oldGun' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_GetStringField_ReturnValue) == 0x000138, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_GetStringField_ReturnValue_1) == 0x000148, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_MakeArray_Array) == 0x000158, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_MakeArray_Array_1) == 0x000168, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_EquipItems_ReturnValue) == 0x000178, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_EquipItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, Temp_object_Variable) == 0x000188, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_DynamicCast_AsTexture_2D) == 0x000190, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_DynamicCast_bSuccess_5) == 0x000198, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, CallFunc_GetSlotByItemClass_Slot_1) == 0x0001A0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::CallFunc_GetSlotByItemClass_Slot_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_DynamicCast_AsUI_Game_Spawn_Screen_Loadout_Full_Weapon_Gun_Slot_1) == 0x0001A8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_DynamicCast_AsUI_Game_Spawn_Screen_Loadout_Full_Weapon_Gun_Slot_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item, K2Node_DynamicCast_bSuccess_6) == 0x0001B0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnListItemObjectSet");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnListItemObjectSet) == 0x000008, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnListItemObjectSet");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C.OnLoaded_75C8BEAF244F2E22BC7986BEF934A56B
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnLoaded_75C8BEAF244F2E22BC7986BEF934A56B final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnLoaded_75C8BEAF244F2E22BC7986BEF934A56B) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnLoaded_75C8BEAF244F2E22BC7986BEF934A56B");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnLoaded_75C8BEAF244F2E22BC7986BEF934A56B) == 0x000008, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnLoaded_75C8BEAF244F2E22BC7986BEF934A56B");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnLoaded_75C8BEAF244F2E22BC7986BEF934A56B, Loaded) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnLoaded_75C8BEAF244F2E22BC7986BEF934A56B::Loaded' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C.OnSetPrimaryGun_Event
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnSetPrimaryGun_Event final
{
public:
	class AItem_Gun_General*                      OldGun;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnSetPrimaryGun_Event) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnSetPrimaryGun_Event");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnSetPrimaryGun_Event) == 0x000008, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnSetPrimaryGun_Event");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnSetPrimaryGun_Event, OldGun) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_OnSetPrimaryGun_Event::OldGun' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C.ParseItemnfo
// 0x0100 (0x0100 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo final
{
public:
	class UPlayFabJsonObject*                     L_ProgressCustomData;                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 L_GunClass;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                L_GeneralItemData;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD5[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD6[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Temp_int_Variable;                                 // 0x0030(0x0010)(ReferenceParm)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_2;             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD7[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Temp_int_Variable_1;                               // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD8[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD9[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CDA[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Temp_int_Variable_2;                               // 0x0098(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00A8(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CDB[0x2];                                     // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CDC[0x5];                                     // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_3;             // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_1;                   // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CDD[0x5];                                     // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Gun_General;        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CDE[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo) == 0x000100, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, L_ProgressCustomData) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::L_ProgressCustomData' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, L_GunClass) == 0x000008, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::L_GunClass' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, L_GeneralItemData) == 0x000010, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::L_GeneralItemData' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, Temp_bool_True_if_break_was_hit_Variable) == 0x000018, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000020, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, Temp_int_Variable) == 0x000030, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_GetObjectField_ReturnValue) == 0x000040, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_GetObjectField_ReturnValue_1) == 0x000048, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_GetObjectField_ReturnValue_2) == 0x000050, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_GetObjectField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_HasField_ReturnValue) == 0x000058, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_HasField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, Temp_int_Variable_1) == 0x000060, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_Array_Get_Item) == 0x000070, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000078, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_GetNumberField_ReturnValue) == 0x000084, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000088, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_Array_Length_ReturnValue_1) == 0x00008C, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_Max_ReturnValue) == 0x000090, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, Temp_int_Variable_2) == 0x000098, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_Conv_IntToText_ReturnValue) == 0x0000A8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_Array_Length_ReturnValue_2) == 0x0000C0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, Temp_int_Loop_Counter_Variable) == 0x0000C4, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_Less_IntInt_ReturnValue) == 0x0000C9, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000CC, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_BooleanAND_ReturnValue) == 0x0000D0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_IsValid_ReturnValue) == 0x0000D1, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_IsValid_ReturnValue_1) == 0x0000D2, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_GetObjectField_ReturnValue_3) == 0x0000D8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_GetObjectField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_GetBoolField_ReturnValue) == 0x0000E0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_GetBoolField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_HasField_ReturnValue_1) == 0x0000E1, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_HasField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_BooleanAND_ReturnValue_1) == 0x0000E2, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, K2Node_ClassDynamicCast_AsItem_Gun_General) == 0x0000E8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::K2Node_ClassDynamicCast_AsItem_Gun_General' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, K2Node_ClassDynamicCast_bSuccess) == 0x0000F0, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x0000F8, "Member 'UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_ParseItemnfo::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item.UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C.SetGunCurrentLevel
// 0x00B0 (0x00B0 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_Item_C_SetGunCurrentLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_XpForNextLevel;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 L_Class;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_2;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CDF[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Gun_General;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CE0[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Temp_int_Variable;                                 // 0x0060(0x0010)(ReferenceParm)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
