#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen_Loadout_Full_Weapon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Game_SpawnScreen_Loadout_Full_Weapon.UI_Game_SpawnScreen_Loadout_Full_Weapon_C
// 0x0048 (0x02C8 - 0x0280)
class UUI_Game_SpawnScreen_Loadout_Full_Weapon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Back;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith_C* UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith; // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector_C* UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector; // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_C* UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Primary; // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_C* UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Secondary; // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Equipped;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              PlayerState;                                       // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AttachGunsToCrate();
	void BndEvt__UI_Game_SpawnScreen_Loadout_Full_Button_Back_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Primary_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature(class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_C* Param_Slot);
	void BndEvt__UI_Game_SpawnScreen_Loadout_Full_Weapon_UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Secondary_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature(class UUI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_C* Param_Slot);
	void Construct();
	void ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full_Weapon(int32 EntryPoint);
	void GetSlotByItemClass(class UClass* ItemClass, class UUserWidget** Param_Slot);
	void OnDark_Event();
	void OnUpdatePlayerCombinedInfo_Event(const TArray<EModifiedData>& ModifiedData, const class FString& CustomString);
	void ParsePlayerInventory();
	void PreConstruct(bool IsDesignTime);
	void SetActiveMenu(int32 Param_Index);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Game_SpawnScreen_Loadout_Full_Weapon_C">();
	}
	static class UUI_Game_SpawnScreen_Loadout_Full_Weapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Game_SpawnScreen_Loadout_Full_Weapon_C>();
	}
};
static_assert(alignof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_C) == 0x000008, "Wrong alignment on UUI_Game_SpawnScreen_Loadout_Full_Weapon_C");
static_assert(sizeof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_C) == 0x0002C8, "Wrong size on UUI_Game_SpawnScreen_Loadout_Full_Weapon_C");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_C, UberGraphFrame) == 0x000280, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_C, Button_Back) == 0x000288, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_C, UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith) == 0x000290, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_C::UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Gunsmith' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_C, UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector) == 0x000298, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_C::UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Selector' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_C, UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Primary) == 0x0002A0, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_C::UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Primary' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_C, UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Secondary) == 0x0002A8, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_C::UI_Game_SpawnScreen_Loadout_Full_Weapon_Gun_Slot_Secondary' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_C, VerticalBox_Equipped) == 0x0002B0, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_C::VerticalBox_Equipped' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_C, WidgetSwitcher) == 0x0002B8, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Full_Weapon_C, PlayerState) == 0x0002C0, "Member 'UUI_Game_SpawnScreen_Loadout_Full_Weapon_C::PlayerState' has a wrong offset!");

}

