#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_GeneralGameScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_GeneralGameScreen.UI_GeneralGameScreen_C
// 0x0068 (0x02E8 - 0x0280)
class UUI_GeneralGameScreen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_Main;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Chat_C*                             UI_Chat;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_EscapeMenu_C*                       UI_EscapeMenu;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_GamePoints_C*                       UI_GamePointsWindow;                               // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_GameScreen_C*                       UI_GameScreen;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_KillLog_C*                          UI_KillLog;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Scoreboard_C*                       UI_Scoreboard;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SoftLoadingScreen_C*                UI_SoftLoadingScreen;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_C*                 UI_SpawnScreen;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Main;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ActiveScreenIndex;                                 // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E8E[0x4];                                     // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_MatchResult_C*                      UI_MatchResult;                                    // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void DeveloperLogin_Failure(const struct FPlayFabError& Error);
	void ExecuteUbergraph_UI_GeneralGameScreen(int32 EntryPoint);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnNewLevelReceived_Event();
	void OnSuccess_687E902B488342B2BAC8458BD7DE2584();
	void OnTeamWon_Event();
	void OnUpdatePlayerCombinedInfo_Event(const TArray<EModifiedData>& ModifiedData, const class FString& CustomString);
	void SetActiveScreenIndex(int32 Param_Index);
	void ToggleMenu();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_GeneralGameScreen_C">();
	}
	static class UUI_GeneralGameScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_GeneralGameScreen_C>();
	}
};
static_assert(alignof(UUI_GeneralGameScreen_C) == 0x000008, "Wrong alignment on UUI_GeneralGameScreen_C");
static_assert(sizeof(UUI_GeneralGameScreen_C) == 0x0002E8, "Wrong size on UUI_GeneralGameScreen_C");
static_assert(offsetof(UUI_GeneralGameScreen_C, UberGraphFrame) == 0x000280, "Member 'UUI_GeneralGameScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_GeneralGameScreen_C, CanvasPanel_Main) == 0x000288, "Member 'UUI_GeneralGameScreen_C::CanvasPanel_Main' has a wrong offset!");
static_assert(offsetof(UUI_GeneralGameScreen_C, UI_Chat) == 0x000290, "Member 'UUI_GeneralGameScreen_C::UI_Chat' has a wrong offset!");
static_assert(offsetof(UUI_GeneralGameScreen_C, UI_EscapeMenu) == 0x000298, "Member 'UUI_GeneralGameScreen_C::UI_EscapeMenu' has a wrong offset!");
static_assert(offsetof(UUI_GeneralGameScreen_C, UI_GamePointsWindow) == 0x0002A0, "Member 'UUI_GeneralGameScreen_C::UI_GamePointsWindow' has a wrong offset!");
static_assert(offsetof(UUI_GeneralGameScreen_C, UI_GameScreen) == 0x0002A8, "Member 'UUI_GeneralGameScreen_C::UI_GameScreen' has a wrong offset!");
static_assert(offsetof(UUI_GeneralGameScreen_C, UI_KillLog) == 0x0002B0, "Member 'UUI_GeneralGameScreen_C::UI_KillLog' has a wrong offset!");
static_assert(offsetof(UUI_GeneralGameScreen_C, UI_Scoreboard) == 0x0002B8, "Member 'UUI_GeneralGameScreen_C::UI_Scoreboard' has a wrong offset!");
static_assert(offsetof(UUI_GeneralGameScreen_C, UI_SoftLoadingScreen) == 0x0002C0, "Member 'UUI_GeneralGameScreen_C::UI_SoftLoadingScreen' has a wrong offset!");
static_assert(offsetof(UUI_GeneralGameScreen_C, UI_SpawnScreen) == 0x0002C8, "Member 'UUI_GeneralGameScreen_C::UI_SpawnScreen' has a wrong offset!");
static_assert(offsetof(UUI_GeneralGameScreen_C, WidgetSwitcher_Main) == 0x0002D0, "Member 'UUI_GeneralGameScreen_C::WidgetSwitcher_Main' has a wrong offset!");
static_assert(offsetof(UUI_GeneralGameScreen_C, ActiveScreenIndex) == 0x0002D8, "Member 'UUI_GeneralGameScreen_C::ActiveScreenIndex' has a wrong offset!");
static_assert(offsetof(UUI_GeneralGameScreen_C, UI_MatchResult) == 0x0002E0, "Member 'UUI_GeneralGameScreen_C::UI_MatchResult' has a wrong offset!");

}

