#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_GeneralGameScreen

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "POLYGON_structs.hpp"
#include "PlayFab_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function UI_GeneralGameScreen.UI_GeneralGameScreen_C.DeveloperLogin_Failure
// 0x0038 (0x0038 - 0x0000)
struct UI_GeneralGameScreen_C_DeveloperLogin_Failure final
{
public:
	struct FPlayFabError                          Error;                                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UI_GeneralGameScreen_C_DeveloperLogin_Failure) == 0x000008, "Wrong alignment on UI_GeneralGameScreen_C_DeveloperLogin_Failure");
static_assert(sizeof(UI_GeneralGameScreen_C_DeveloperLogin_Failure) == 0x000038, "Wrong size on UI_GeneralGameScreen_C_DeveloperLogin_Failure");
static_assert(offsetof(UI_GeneralGameScreen_C_DeveloperLogin_Failure, Error) == 0x000000, "Member 'UI_GeneralGameScreen_C_DeveloperLogin_Failure::Error' has a wrong offset!");

// Function UI_GeneralGameScreen.UI_GeneralGameScreen_C.ExecuteUbergraph_UI_GeneralGameScreen
// 0x0180 (0x0180 - 0x0000)
struct UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClientLoggedIn_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E8F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTask_DevepolerLogin_C*                 CallFunc_CreateAction_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E90[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayFabError& Error)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E91[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E92[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E93[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_UpgradeLevelOfPlayer_C*             CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E94[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_GameState_Game_C*                CallFunc_GetGameStateBP_MyGameState;               // 0x0080(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E95[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_MatchResult_C*                      CallFunc_Create_ReturnValue_1;                     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x00C0(0x0020)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E96[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ConstParm, ReferenceParm)
	TArray<EModifiedData>                         K2Node_CustomEvent_ModifiedData;                   // 0x0108(0x0010)(ConstParm, ReferenceParm)
	class FString                                 K2Node_CustomEvent_CustomString;                   // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(TArray<EModifiedData>& ModifiedData, const class FString& CustomString)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WithEditor_ReturnValue;                   // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E97[0x6];                                     // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x0148(0x0038)()
};
static_assert(alignof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen) == 0x000008, "Wrong alignment on UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen");
static_assert(sizeof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen) == 0x000180, "Wrong size on UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, EntryPoint) == 0x000000, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_IsClientLoggedIn_ReturnValue) == 0x000004, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_IsClientLoggedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_CreateAction_ReturnValue) == 0x000008, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_CreateAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, Temp_bool_Has_Been_Initd_Variable) == 0x000024, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000040, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x000048, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x000058, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_Create_ReturnValue) == 0x000068, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000070, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_GetGameStateBP_MyGameState) == 0x000080, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_GetGameStateBP_MyGameState' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000088, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x000090, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x000098, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_Create_ReturnValue_1) == 0x0000A8, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, K2Node_MakeStruct_Margin) == 0x0000B0, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, K2Node_MakeStruct_Anchors) == 0x0000C0, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000E0, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_IsValid_ReturnValue_1) == 0x0000F0, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000F1, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, Temp_bool_IsClosed_Variable) == 0x0000F2, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_BooleanAND_ReturnValue) == 0x0000F3, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, K2Node_MakeArray_Array) == 0x0000F8, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, K2Node_CustomEvent_ModifiedData) == 0x000108, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::K2Node_CustomEvent_ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, K2Node_CustomEvent_CustomString) == 0x000118, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::K2Node_CustomEvent_CustomString' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, K2Node_CreateDelegate_OutputDelegate_4) == 0x000128, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_AddChildToCanvas_ReturnValue) == 0x000138, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_WithEditor_ReturnValue) == 0x000140, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_WithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, CallFunc_BooleanAND_ReturnValue_1) == 0x000141, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen, K2Node_CustomEvent_error) == 0x000148, "Member 'UI_GeneralGameScreen_C_ExecuteUbergraph_UI_GeneralGameScreen::K2Node_CustomEvent_error' has a wrong offset!");

// Function UI_GeneralGameScreen.UI_GeneralGameScreen_C.OnKeyDown
// 0x0208 (0x0208 - 0x0000)
struct UI_GeneralGameScreen_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0148(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GeneralGameScreen_C_OnKeyDown) == 0x000008, "Wrong alignment on UI_GeneralGameScreen_C_OnKeyDown");
static_assert(sizeof(UI_GeneralGameScreen_C_OnKeyDown) == 0x000208, "Wrong size on UI_GeneralGameScreen_C_OnKeyDown");
static_assert(offsetof(UI_GeneralGameScreen_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'UI_GeneralGameScreen_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'UI_GeneralGameScreen_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_OnKeyDown, ReturnValue) == 0x000078, "Member 'UI_GeneralGameScreen_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000130, "Member 'UI_GeneralGameScreen_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000148, "Member 'UI_GeneralGameScreen_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000200, "Member 'UI_GeneralGameScreen_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");

// Function UI_GeneralGameScreen.UI_GeneralGameScreen_C.OnUpdatePlayerCombinedInfo_Event
// 0x0020 (0x0020 - 0x0000)
struct UI_GeneralGameScreen_C_OnUpdatePlayerCombinedInfo_Event final
{
public:
	TArray<EModifiedData>                         ModifiedData;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 CustomString;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GeneralGameScreen_C_OnUpdatePlayerCombinedInfo_Event) == 0x000008, "Wrong alignment on UI_GeneralGameScreen_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(sizeof(UI_GeneralGameScreen_C_OnUpdatePlayerCombinedInfo_Event) == 0x000020, "Wrong size on UI_GeneralGameScreen_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(offsetof(UI_GeneralGameScreen_C_OnUpdatePlayerCombinedInfo_Event, ModifiedData) == 0x000000, "Member 'UI_GeneralGameScreen_C_OnUpdatePlayerCombinedInfo_Event::ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_OnUpdatePlayerCombinedInfo_Event, CustomString) == 0x000010, "Member 'UI_GeneralGameScreen_C_OnUpdatePlayerCombinedInfo_Event::CustomString' has a wrong offset!");

// Function UI_GeneralGameScreen.UI_GeneralGameScreen_C.SetActiveScreenIndex
// 0x0028 (0x0028 - 0x0000)
struct UI_GeneralGameScreen_C_SetActiveScreenIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E98[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E99[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GeneralGameScreen_C_SetActiveScreenIndex) == 0x000008, "Wrong alignment on UI_GeneralGameScreen_C_SetActiveScreenIndex");
static_assert(sizeof(UI_GeneralGameScreen_C_SetActiveScreenIndex) == 0x000028, "Wrong size on UI_GeneralGameScreen_C_SetActiveScreenIndex");
static_assert(offsetof(UI_GeneralGameScreen_C_SetActiveScreenIndex, Param_Index) == 0x000000, "Member 'UI_GeneralGameScreen_C_SetActiveScreenIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_SetActiveScreenIndex, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'UI_GeneralGameScreen_C_SetActiveScreenIndex::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_SetActiveScreenIndex, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000010, "Member 'UI_GeneralGameScreen_C_SetActiveScreenIndex::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_SetActiveScreenIndex, K2Node_SwitchInteger_CmpSuccess) == 0x000014, "Member 'UI_GeneralGameScreen_C_SetActiveScreenIndex::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_SetActiveScreenIndex, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'UI_GeneralGameScreen_C_SetActiveScreenIndex::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_SetActiveScreenIndex, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000020, "Member 'UI_GeneralGameScreen_C_SetActiveScreenIndex::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");

// Function UI_GeneralGameScreen.UI_GeneralGameScreen_C.ToggleMenu
// 0x0048 (0x0048 - 0x0000)
struct UI_GeneralGameScreen_C_ToggleMenu final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9A[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9B[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GeneralGameScreen_C_ToggleMenu) == 0x000008, "Wrong alignment on UI_GeneralGameScreen_C_ToggleMenu");
static_assert(sizeof(UI_GeneralGameScreen_C_ToggleMenu) == 0x000048, "Wrong size on UI_GeneralGameScreen_C_ToggleMenu");
static_assert(offsetof(UI_GeneralGameScreen_C_ToggleMenu, Temp_bool_Variable) == 0x000000, "Member 'UI_GeneralGameScreen_C_ToggleMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ToggleMenu, Temp_byte_Variable) == 0x000001, "Member 'UI_GeneralGameScreen_C_ToggleMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_GeneralGameScreen_C_ToggleMenu, Temp_byte_Variable_1) == 0x000002, "Member 'UI_GeneralGameScreen_C_ToggleMenu::Temp_byte_Variable_1' has a wrong offset!");
