#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen_Spectator

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_Game_SpawnScreen_Spectator.UI_Game_SpawnScreen_Spectator_C.ExecuteUbergraph_UI_Game_SpawnScreen_Spectator
// 0x0010 (0x0010 - 0x0000)
struct UI_Game_SpawnScreen_Spectator_C_ExecuteUbergraph_UI_Game_SpawnScreen_Spectator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D6B[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_Game_Character_C*                K2Node_CustomEvent_Character;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Spectator_C_ExecuteUbergraph_UI_Game_SpawnScreen_Spectator) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Spectator_C_ExecuteUbergraph_UI_Game_SpawnScreen_Spectator");
static_assert(sizeof(UI_Game_SpawnScreen_Spectator_C_ExecuteUbergraph_UI_Game_SpawnScreen_Spectator) == 0x000010, "Wrong size on UI_Game_SpawnScreen_Spectator_C_ExecuteUbergraph_UI_Game_SpawnScreen_Spectator");
static_assert(offsetof(UI_Game_SpawnScreen_Spectator_C_ExecuteUbergraph_UI_Game_SpawnScreen_Spectator, EntryPoint) == 0x000000, "Member 'UI_Game_SpawnScreen_Spectator_C_ExecuteUbergraph_UI_Game_SpawnScreen_Spectator::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Spectator_C_ExecuteUbergraph_UI_Game_SpawnScreen_Spectator, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'UI_Game_SpawnScreen_Spectator_C_ExecuteUbergraph_UI_Game_SpawnScreen_Spectator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Spectator_C_ExecuteUbergraph_UI_Game_SpawnScreen_Spectator, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'UI_Game_SpawnScreen_Spectator_C_ExecuteUbergraph_UI_Game_SpawnScreen_Spectator::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Spectator_C_ExecuteUbergraph_UI_Game_SpawnScreen_Spectator, K2Node_CustomEvent_Character) == 0x000008, "Member 'UI_Game_SpawnScreen_Spectator_C_ExecuteUbergraph_UI_Game_SpawnScreen_Spectator::K2Node_CustomEvent_Character' has a wrong offset!");

// Function UI_Game_SpawnScreen_Spectator.UI_Game_SpawnScreen_Spectator_C.SetNewSpectate
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_SpawnScreen_Spectator_C_SetNewSpectate final
{
public:
	class ABP_PG_Game_Character_C*                Param_Character;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Spectator_C_SetNewSpectate) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Spectator_C_SetNewSpectate");
static_assert(sizeof(UI_Game_SpawnScreen_Spectator_C_SetNewSpectate) == 0x000008, "Wrong size on UI_Game_SpawnScreen_Spectator_C_SetNewSpectate");
static_assert(offsetof(UI_Game_SpawnScreen_Spectator_C_SetNewSpectate, Param_Character) == 0x000000, "Member 'UI_Game_SpawnScreen_Spectator_C_SetNewSpectate::Param_Character' has a wrong offset!");

// Function UI_Game_SpawnScreen_Spectator.UI_Game_SpawnScreen_Spectator_C.ToggleSpectatorScale
// 0x0018 (0x0018 - 0x0000)
struct UI_Game_SpawnScreen_Spectator_C_ToggleSpectatorScale final
{
public:
	bool                                          ForceSmall;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_ForceSmall;                                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D6C[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Spectator_C_ToggleSpectatorScale) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Spectator_C_ToggleSpectatorScale");
static_assert(sizeof(UI_Game_SpawnScreen_Spectator_C_ToggleSpectatorScale) == 0x000018, "Wrong size on UI_Game_SpawnScreen_Spectator_C_ToggleSpectatorScale");
static_assert(offsetof(UI_Game_SpawnScreen_Spectator_C_ToggleSpectatorScale, ForceSmall) == 0x000000, "Member 'UI_Game_SpawnScreen_Spectator_C_ToggleSpectatorScale::ForceSmall' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Spectator_C_ToggleSpectatorScale, L_ForceSmall) == 0x000001, "Member 'UI_Game_SpawnScreen_Spectator_C_ToggleSpectatorScale::L_ForceSmall' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Spectator_C_ToggleSpectatorScale, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'UI_Game_SpawnScreen_Spectator_C_ToggleSpectatorScale::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Spectator_C_ToggleSpectatorScale, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'UI_Game_SpawnScreen_Spectator_C_ToggleSpectatorScale::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

