#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen_Loadout_Compact_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Game_SpawnScreen_Loadout_Compact_Item.UI_Game_SpawnScreen_Loadout_Compact_Item_C
// 0x0040 (0x02C0 - 0x0280)
class UUI_Game_SpawnScreen_Loadout_Compact_Item_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_IsEquipped;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Loading;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Name;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     ItemJson;                                          // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 ItemClass;                                         // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_SpawnScreen_Loadout_Item_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item(int32 EntryPoint);
	void Initialize();
	void OnLoaded_135F2D0D451E0AF6D263CBA52274D8BD(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Game_SpawnScreen_Loadout_Compact_Item_C">();
	}
	static class UUI_Game_SpawnScreen_Loadout_Compact_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Game_SpawnScreen_Loadout_Compact_Item_C>();
	}
};
static_assert(alignof(UUI_Game_SpawnScreen_Loadout_Compact_Item_C) == 0x000008, "Wrong alignment on UUI_Game_SpawnScreen_Loadout_Compact_Item_C");
static_assert(sizeof(UUI_Game_SpawnScreen_Loadout_Compact_Item_C) == 0x0002C0, "Wrong size on UUI_Game_SpawnScreen_Loadout_Compact_Item_C");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Item_C, UberGraphFrame) == 0x000280, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Item_C, Border_IsEquipped) == 0x000288, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Item_C::Border_IsEquipped' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Item_C, Button) == 0x000290, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Item_C::Button' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Item_C, Image_Icon) == 0x000298, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Item_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Item_C, Overlay_Loading) == 0x0002A0, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Item_C::Overlay_Loading' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Item_C, TextBlock_Name) == 0x0002A8, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Item_C::TextBlock_Name' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Item_C, ItemJson) == 0x0002B0, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Item_C::ItemJson' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_Item_C, ItemClass) == 0x0002B8, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_Item_C::ItemClass' has a wrong offset!");

}

