#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen_Loadout_Compact

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Game_SpawnScreen_Loadout_Compact.UI_Game_SpawnScreen_Loadout_Compact_C
// 0x00A8 (0x0328 - 0x0280)
class UUI_Game_SpawnScreen_Loadout_Compact_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FullLoadoutHover;                                  // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OpenChangeWeaponWindow;                            // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Close;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Close_2;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_FullLoadout;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Open;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Info;                                        // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lines_Map;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LinesRainbow_Map;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_ChangeWeapon;                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Loading;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Assault;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Marksman;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Pistol;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_SMG;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Sniper;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_LoadingIcon_C*                      UI_LoadingIcon;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Compact_Slot_C* UI_SpawnScreen_Loadout_ItemSlot_Primary;           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Loadout_Compact_Slot_C* UI_SpawnScreen_Loadout_ItemSlot_Secondary;         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_WeaponSlot;                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void AddNewItem(class UPlayFabJsonObject* Item);
	void BndEvt__UI_SpawnScreen_Loadout_Button_Close_2_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_SpawnScreen_Loadout_Button_Close_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_SpawnScreen_Loadout_Button_Loadout_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_SpawnScreen_Loadout_Button_Open_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_SpawnScreen_Loadout_Compact_Button_FullLoadout_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_SpawnScreen_Loadout_Compact_Button_FullLoadout_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_SpawnScreen_Loadout_UI_SpawnScreen_Loadout_ItemSlot_Primary_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__UI_SpawnScreen_Loadout_UI_SpawnScreen_Loadout_ItemSlot_Secondary_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact(int32 EntryPoint);
	void ForceClose();
	class UWidget* Get_Image_Info_ToolTipWidget();
	void GetSlotByItemClass(class UClass* ItemClass, class UUI_Game_SpawnScreen_Loadout_Compact_Slot_C** ItemSlot);
	void OnDark_Event();
	void OnLevelLoaded_Event();
	void OnUpdatePlayerCombinedInfo();
	void OnUpdatePlayerCombinedInfo_Event(const TArray<EModifiedData>& ModifiedData, const class FString& CustomString);
	void OpenChangeWeapon();
	void PreConstruct(bool IsDesignTime);
	void Reset();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Game_SpawnScreen_Loadout_Compact_C">();
	}
	static class UUI_Game_SpawnScreen_Loadout_Compact_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Game_SpawnScreen_Loadout_Compact_C>();
	}
};
static_assert(alignof(UUI_Game_SpawnScreen_Loadout_Compact_C) == 0x000008, "Wrong alignment on UUI_Game_SpawnScreen_Loadout_Compact_C");
static_assert(sizeof(UUI_Game_SpawnScreen_Loadout_Compact_C) == 0x000328, "Wrong size on UUI_Game_SpawnScreen_Loadout_Compact_C");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, UberGraphFrame) == 0x000280, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, FullLoadoutHover) == 0x000288, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::FullLoadoutHover' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, OpenChangeWeaponWindow) == 0x000290, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::OpenChangeWeaponWindow' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, Button_Close) == 0x000298, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::Button_Close' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, Button_Close_2) == 0x0002A0, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::Button_Close_2' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, Button_FullLoadout) == 0x0002A8, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::Button_FullLoadout' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, Button_Open) == 0x0002B0, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::Button_Open' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, Image_Info) == 0x0002B8, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::Image_Info' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, Lines_Map) == 0x0002C0, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::Lines_Map' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, LinesRainbow_Map) == 0x0002C8, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::LinesRainbow_Map' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, Overlay_ChangeWeapon) == 0x0002D0, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::Overlay_ChangeWeapon' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, Overlay_Loading) == 0x0002D8, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::Overlay_Loading' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, ScrollBox_Assault) == 0x0002E0, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::ScrollBox_Assault' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, ScrollBox_Marksman) == 0x0002E8, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::ScrollBox_Marksman' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, ScrollBox_Pistol) == 0x0002F0, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::ScrollBox_Pistol' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, ScrollBox_SMG) == 0x0002F8, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::ScrollBox_SMG' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, ScrollBox_Sniper) == 0x000300, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::ScrollBox_Sniper' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, UI_LoadingIcon) == 0x000308, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::UI_LoadingIcon' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, UI_SpawnScreen_Loadout_ItemSlot_Primary) == 0x000310, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::UI_SpawnScreen_Loadout_ItemSlot_Primary' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, UI_SpawnScreen_Loadout_ItemSlot_Secondary) == 0x000318, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::UI_SpawnScreen_Loadout_ItemSlot_Secondary' has a wrong offset!");
static_assert(offsetof(UUI_Game_SpawnScreen_Loadout_Compact_C, WidgetSwitcher_WeaponSlot) == 0x000320, "Member 'UUI_Game_SpawnScreen_Loadout_Compact_C::WidgetSwitcher_WeaponSlot' has a wrong offset!");

}

