#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_Minimap_Map

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "POLYGON_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_Game_Minimap_Map.UI_Game_Minimap_Map_C.AddOtherIcon
// 0x0018 (0x0018 - 0x0000)
struct UI_Game_Minimap_Map_C_AddOtherIcon final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_Minimap_OtherIcon_C*           CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Minimap_Map_C_AddOtherIcon) == 0x000008, "Wrong alignment on UI_Game_Minimap_Map_C_AddOtherIcon");
static_assert(sizeof(UI_Game_Minimap_Map_C_AddOtherIcon) == 0x000018, "Wrong size on UI_Game_Minimap_Map_C_AddOtherIcon");
static_assert(offsetof(UI_Game_Minimap_Map_C_AddOtherIcon, Owner) == 0x000000, "Member 'UI_Game_Minimap_Map_C_AddOtherIcon::Owner' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_AddOtherIcon, CallFunc_Create_ReturnValue) == 0x000008, "Member 'UI_Game_Minimap_Map_C_AddOtherIcon::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_AddOtherIcon, CallFunc_AddChildToOverlay_ReturnValue) == 0x000010, "Member 'UI_Game_Minimap_Map_C_AddOtherIcon::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");

// Function UI_Game_Minimap_Map.UI_Game_Minimap_Map_C.AddOtherPlayerIcon
// 0x0020 (0x0020 - 0x0000)
struct UI_Game_Minimap_Map_C_AddOtherPlayerIcon final
{
public:
	class APawn*                                  PlayerCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_Minimap_OtherPlayerIcon_C*     CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Minimap_Map_C_AddOtherPlayerIcon) == 0x000008, "Wrong alignment on UI_Game_Minimap_Map_C_AddOtherPlayerIcon");
static_assert(sizeof(UI_Game_Minimap_Map_C_AddOtherPlayerIcon) == 0x000020, "Wrong size on UI_Game_Minimap_Map_C_AddOtherPlayerIcon");
static_assert(offsetof(UI_Game_Minimap_Map_C_AddOtherPlayerIcon, PlayerCharacter) == 0x000000, "Member 'UI_Game_Minimap_Map_C_AddOtherPlayerIcon::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_AddOtherPlayerIcon, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'UI_Game_Minimap_Map_C_AddOtherPlayerIcon::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_AddOtherPlayerIcon, CallFunc_Create_ReturnValue) == 0x000010, "Member 'UI_Game_Minimap_Map_C_AddOtherPlayerIcon::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_AddOtherPlayerIcon, CallFunc_AddChildToOverlay_ReturnValue) == 0x000018, "Member 'UI_Game_Minimap_Map_C_AddOtherPlayerIcon::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");

// Function UI_Game_Minimap_Map.UI_Game_Minimap_Map_C.ConvertCharacterPositionToMap
// 0x00A0 (0x00A0 - 0x0000)
struct UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap final
{
public:
	double                                        X;                                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Y;                                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DF7[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap) == 0x000008, "Wrong alignment on UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap");
static_assert(sizeof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap) == 0x0000A0, "Wrong size on UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap");
static_assert(offsetof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap, X) == 0x000000, "Member 'UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap::X' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap, Y) == 0x000008, "Member 'UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap::Y' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000030, "Member 'UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap, CallFunc_BreakVector_X) == 0x000040, "Member 'UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap, CallFunc_BreakVector_Y) == 0x000048, "Member 'UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap, CallFunc_BreakVector_Z) == 0x000050, "Member 'UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap, K2Node_SwitchString_CmpSuccess) == 0x000058, "Member 'UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap, CallFunc_BreakVector_X_1) == 0x000060, "Member 'UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap, CallFunc_BreakVector_Y_1) == 0x000068, "Member 'UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap, CallFunc_BreakVector_Z_1) == 0x000070, "Member 'UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000078, "Member 'UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000080, "Member 'UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000088, "Member 'UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x000098, "Member 'UI_Game_Minimap_Map_C_ConvertCharacterPositionToMap::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");

// Function UI_Game_Minimap_Map.UI_Game_Minimap_Map_C.ExecuteUbergraph_UI_Game_Minimap_Map
// 0x0290 (0x0290 - 0x0000)
struct UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DF8[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DF9[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0050(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DFA[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapInfo                               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0080(0x00E8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DFB[0x5];                                     // 0x016B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DFC[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ConvertCharacterPositionToMap_X;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ConvertCharacterPositionToMap_Y;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DFD[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DFE[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_GameState_Game_C*                K2Node_DynamicCast_AsBP_PG_Game_State_Game;        // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DFF[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AControlPoint*                          CallFunc_Array_Get_Item_1;                         // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATeamBase*                              CallFunc_Array_Get_Item_2;                         // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E00[0x2];                                     // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E01[0x2];                                     // 0x0226(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_Minimap_TeamBase_C*            CallFunc_Create_ReturnValue;                       // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_Minimap_ControlPoint_C*        CallFunc_Create_ReturnValue_1;                     // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue_1;          // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E02[0x3];                                     // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x025C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2; // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderTransformAngle_Angle_ImplicitCast; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map) == 0x000008, "Wrong alignment on UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map");
static_assert(sizeof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map) == 0x000290, "Wrong size on UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, EntryPoint) == 0x000000, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, Temp_int_Loop_Counter_Variable_1) == 0x000008, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, Temp_int_Array_Index_Variable) == 0x000014, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, Temp_bool_True_if_break_was_hit_Variable) == 0x00001C, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Not_PreBool_ReturnValue) == 0x00001D, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, Temp_int_Loop_Counter_Variable_2) == 0x000020, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Add_IntInt_ReturnValue_2) == 0x000024, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, Temp_int_Array_Index_Variable_2) == 0x000028, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000048, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000050, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000060, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Array_Get_Item) == 0x000070, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_GetDataTableRowFromName_OutRow) == 0x000080, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000168, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Less_IntInt_ReturnValue) == 0x000169, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_BooleanAND_ReturnValue) == 0x00016A, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, Temp_object_Variable) == 0x000170, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, K2Node_DynamicCast_AsTexture_2D) == 0x000178, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, K2Node_DynamicCast_bSuccess) == 0x000180, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_ConvertCharacterPositionToMap_X) == 0x000188, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_ConvertCharacterPositionToMap_X' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_ConvertCharacterPositionToMap_Y) == 0x000190, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_ConvertCharacterPositionToMap_Y' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000198, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0001A0, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_BreakRotator_Roll) == 0x0001B8, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_BreakRotator_Pitch) == 0x0001BC, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_BreakRotator_Yaw) == 0x0001C0, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x0001C8, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0001D0, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_IsValid_ReturnValue) == 0x0001D8, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001E0, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_GetGameState_ReturnValue) == 0x0001E8, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, K2Node_CustomEvent_Loaded) == 0x0001F0, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, K2Node_DynamicCast_AsBP_PG_Game_State_Game) == 0x0001F8, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::K2Node_DynamicCast_AsBP_PG_Game_State_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, K2Node_DynamicCast_bSuccess_1) == 0x000200, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Array_Get_Item_1) == 0x000208, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Array_Get_Item_2) == 0x000210, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_IsValid_ReturnValue_1) == 0x000218, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_IsValid_ReturnValue_2) == 0x000219, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Array_Length_ReturnValue_1) == 0x00021C, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Array_Length_ReturnValue_2) == 0x000220, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Less_IntInt_ReturnValue_1) == 0x000224, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Less_IntInt_ReturnValue_2) == 0x000225, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_GetOwningPlayer_ReturnValue) == 0x000228, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Create_ReturnValue) == 0x000230, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000238, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Create_ReturnValue_1) == 0x000240, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_AddChildToOverlay_ReturnValue) == 0x000248, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_AddChildToOverlay_ReturnValue_1) == 0x000250, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_AddChildToOverlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000258, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, K2Node_CreateDelegate_OutputDelegate_1) == 0x00025C, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x00026C, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000270, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1) == 0x000278, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2) == 0x00027C, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000280, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map, CallFunc_SetRenderTransformAngle_Angle_ImplicitCast) == 0x000288, "Member 'UI_Game_Minimap_Map_C_ExecuteUbergraph_UI_Game_Minimap_Map::CallFunc_SetRenderTransformAngle_Angle_ImplicitCast' has a wrong offset!");

// Function UI_Game_Minimap_Map.UI_Game_Minimap_Map_C.OnLoaded_136039F0430841AA8E176F891F8DB5F6
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_Minimap_Map_C_OnLoaded_136039F0430841AA8E176F891F8DB5F6 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Minimap_Map_C_OnLoaded_136039F0430841AA8E176F891F8DB5F6) == 0x000008, "Wrong alignment on UI_Game_Minimap_Map_C_OnLoaded_136039F0430841AA8E176F891F8DB5F6");
static_assert(sizeof(UI_Game_Minimap_Map_C_OnLoaded_136039F0430841AA8E176F891F8DB5F6) == 0x000008, "Wrong size on UI_Game_Minimap_Map_C_OnLoaded_136039F0430841AA8E176F891F8DB5F6");
static_assert(offsetof(UI_Game_Minimap_Map_C_OnLoaded_136039F0430841AA8E176F891F8DB5F6, Loaded) == 0x000000, "Member 'UI_Game_Minimap_Map_C_OnLoaded_136039F0430841AA8E176F891F8DB5F6::Loaded' has a wrong offset!");

}

