#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_GunCharacteristics

#include "Basic.hpp"

#include "POLYGON_structs.hpp"
#include "ST_ItemInfo_structs.hpp"


namespace SDK::Params
{

// Function UI_GunCharacteristics.UI_GunCharacteristics_C.Get Module by Type
// 0x0058 (0x0058 - 0x0000)
struct UI_GunCharacteristics_C_Get_Module_by_Type final
{
public:
	EGunModuleType                                Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CBA[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_GunCharacteristics_Module_C*        Module;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CBB[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CBC[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CBD[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_GunCharacteristics_Module_C*        K2Node_DynamicCast_AsUI_Gun_Characteristics_Module; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GunCharacteristics_C_Get_Module_by_Type) == 0x000008, "Wrong alignment on UI_GunCharacteristics_C_Get_Module_by_Type");
static_assert(sizeof(UI_GunCharacteristics_C_Get_Module_by_Type) == 0x000058, "Wrong size on UI_GunCharacteristics_C_Get_Module_by_Type");
static_assert(offsetof(UI_GunCharacteristics_C_Get_Module_by_Type, Type) == 0x000000, "Member 'UI_GunCharacteristics_C_Get_Module_by_Type::Type' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_Get_Module_by_Type, Module) == 0x000008, "Member 'UI_GunCharacteristics_C_Get_Module_by_Type::Module' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_Get_Module_by_Type, Temp_int_Array_Index_Variable) == 0x000010, "Member 'UI_GunCharacteristics_C_Get_Module_by_Type::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_Get_Module_by_Type, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'UI_GunCharacteristics_C_Get_Module_by_Type::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_Get_Module_by_Type, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'UI_GunCharacteristics_C_Get_Module_by_Type::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_Get_Module_by_Type, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'UI_GunCharacteristics_C_Get_Module_by_Type::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_Get_Module_by_Type, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'UI_GunCharacteristics_C_Get_Module_by_Type::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_Get_Module_by_Type, CallFunc_Array_Get_Item) == 0x000038, "Member 'UI_GunCharacteristics_C_Get_Module_by_Type::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_Get_Module_by_Type, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'UI_GunCharacteristics_C_Get_Module_by_Type::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_Get_Module_by_Type, K2Node_DynamicCast_AsUI_Gun_Characteristics_Module) == 0x000048, "Member 'UI_GunCharacteristics_C_Get_Module_by_Type::K2Node_DynamicCast_AsUI_Gun_Characteristics_Module' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_Get_Module_by_Type, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UI_GunCharacteristics_C_Get_Module_by_Type::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_Get_Module_by_Type, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000051, "Member 'UI_GunCharacteristics_C_Get_Module_by_Type::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function UI_GunCharacteristics.UI_GunCharacteristics_C.ParseCharacteristics
// 0x0178 (0x0178 - 0x0000)
struct UI_GunCharacteristics_C_ParseCharacteristics final
{
public:
	struct FST_ItemInfo                           Param_CompareGun;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FST_ItemInfo                           Param_CurrentGun;                                  // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class AItem_Gun_General>          L_CurrentGunClass;                                 // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class AItem_Gun_General>          L_CompareGunClass;                                 // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ClassClass_ReturnValue;          // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CBE[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Gun_General;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CBF[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Gun_General_1;      // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC0[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC1[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue_1;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC2[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_1_ImplicitCast;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetParameters_CompareParameter_ImplicitCast; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_0_ImplicitCast;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetParameters_CurrentParameter_ImplicitCast; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC3[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3;   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetParameters_CompareParameter_ImplicitCast_1; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_4;   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1;   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_1;      // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC4[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_5;   // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GunCharacteristics_C_ParseCharacteristics) == 0x000008, "Wrong alignment on UI_GunCharacteristics_C_ParseCharacteristics");
static_assert(sizeof(UI_GunCharacteristics_C_ParseCharacteristics) == 0x000178, "Wrong size on UI_GunCharacteristics_C_ParseCharacteristics");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, Param_CompareGun) == 0x000000, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::Param_CompareGun' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, Param_CurrentGun) == 0x000010, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::Param_CurrentGun' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, L_CurrentGunClass) == 0x000020, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::L_CurrentGunClass' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, L_CompareGunClass) == 0x000028, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::L_CompareGunClass' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000030, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000031, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, Temp_bool_Variable) == 0x000032, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_NotEqual_ClassClass_ReturnValue) == 0x000033, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_NotEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, K2Node_Select_Default) == 0x000038, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000050, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000058, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, K2Node_ClassDynamicCast_AsItem_Gun_General) == 0x000060, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::K2Node_ClassDynamicCast_AsItem_Gun_General' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, K2Node_ClassDynamicCast_bSuccess) == 0x000068, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, K2Node_ClassDynamicCast_AsItem_Gun_General_1) == 0x000070, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::K2Node_ClassDynamicCast_AsItem_Gun_General_1' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, K2Node_ClassDynamicCast_bSuccess_1) == 0x000078, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000080, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000088, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_NormalizeToRange_ReturnValue) == 0x000098, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_GetFloatValue_ReturnValue) == 0x0000A0, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000A8, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0000B0, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x0000B8, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x0000C0, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_NormalizeToRange_ReturnValue_1) == 0x0000C8, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_NormalizeToRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_GetFloatValue_ReturnValue_1) == 0x0000D0, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x0000D8, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, K2Node_Select_Option_1_ImplicitCast) == 0x0000E0, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::K2Node_Select_Option_1_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0000E8, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_SetParameters_CompareParameter_ImplicitCast) == 0x0000F0, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_SetParameters_CompareParameter_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, K2Node_Select_Option_0_ImplicitCast) == 0x0000F8, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::K2Node_Select_Option_0_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x000100, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000108, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Divide_DoubleDouble_B_ImplicitCast_1) == 0x000110, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Divide_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000118, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_SetParameters_CurrentParameter_ImplicitCast) == 0x000120, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_SetParameters_CurrentParameter_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000128, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000130, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x000138, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x000140, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3) == 0x000148, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_SetParameters_CompareParameter_ImplicitCast_1) == 0x000150, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_SetParameters_CompareParameter_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_4) == 0x000158, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1) == 0x000160, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_GetFloatValue_InTime_ImplicitCast_1) == 0x000168, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_GetFloatValue_InTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseCharacteristics, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_5) == 0x000170, "Member 'UI_GunCharacteristics_C_ParseCharacteristics::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_5' has a wrong offset!");

// Function UI_GunCharacteristics.UI_GunCharacteristics_C.ParseGunModules
// 0x0120 (0x0120 - 0x0000)
struct UI_GunCharacteristics_C_ParseGunModules final
{
public:
	struct FGunModuleInfo                         L_RelatedModuleIt;                                 // 0x0000(0x0040)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UUI_GunCharacteristics_Module_C*        L_Module_UI_Entry;                                 // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUI_GunCharacteristics_Module_C*        CallFunc_Get_Module_by_Type_Module;                // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC5[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_2;             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Module_General;     // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC6[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Gun_General;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC7[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGunModulesInfo*                        K2Node_DynamicCast_AsGun_Modules_Info;             // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC8[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGunModuleInfo                         CallFunc_Array_Get_Item;                           // 0x00D0(0x0040)(ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC9[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_GunCharacteristics_C_ParseGunModules) == 0x000008, "Wrong alignment on UI_GunCharacteristics_C_ParseGunModules");
static_assert(sizeof(UI_GunCharacteristics_C_ParseGunModules) == 0x000120, "Wrong size on UI_GunCharacteristics_C_ParseGunModules");
static_assert(offsetof(UI_GunCharacteristics_C_ParseGunModules, L_RelatedModuleIt) == 0x000000, "Member 'UI_GunCharacteristics_C_ParseGunModules::L_RelatedModuleIt' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseGunModules, L_Module_UI_Entry) == 0x000040, "Member 'UI_GunCharacteristics_C_ParseGunModules::L_Module_UI_Entry' has a wrong offset!");
static_assert(offsetof(UI_GunCharacteristics_C_ParseGunModules, Temp_int_Array_Index_Variable) == 0x000048, "Member 'UI_GunCharacteristics_C_ParseGunModules::Temp_int_Array_Index_Variable' has a wrong offset!");
