#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_GameVersion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UI_GameVersion.UI_GameVersion_C.ExecuteUbergraph_UI_GameVersion
// 0x0168 (0x0168 - 0x0000)
struct UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA5[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA6[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetProjectVersion_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA7[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00B8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00D0(0x0018)()
	class UBP_PG_GameInstance_C*                  CallFunc_GetGameInstance_MyGameIntance;            // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClientGameInstance*                    CallFunc_GetClientGameInstance_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA8[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerMasterId_ReturnValue;            // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0120(0x0018)()
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_GameState_Game*                     K2Node_DynamicCast_AsPG_Game_State_Game;           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA9[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ByteToText_ReturnValue;              // 0x0150(0x0018)()
};
static_assert(alignof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion) == 0x000008, "Wrong alignment on UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion");
static_assert(sizeof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion) == 0x000168, "Wrong size on UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, EntryPoint) == 0x000000, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, Temp_bool_Has_Been_Initd_Variable) == 0x000024, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, Temp_bool_IsClosed_Variable) == 0x000040, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_GetProjectVersion_ReturnValue) == 0x000048, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_GetProjectVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000070, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000080, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_BreakVector_X) == 0x000098, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_BreakVector_Y) == 0x0000A0, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_BreakVector_Z) == 0x0000A8, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_FTrunc_ReturnValue) == 0x0000B0, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_FTrunc_ReturnValue_1) == 0x0000B4, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_Conv_IntToText_ReturnValue) == 0x0000B8, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000D0, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_GetGameInstance_MyGameIntance) == 0x0000E8, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_GetGameInstance_MyGameIntance' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_GetCurrentLevelName_ReturnValue) == 0x0000F0, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_GetClientGameInstance_ReturnValue) == 0x000100, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_GetClientGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000108, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_GetPlayerMasterId_ReturnValue) == 0x000110, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_GetPlayerMasterId_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000120, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_GetGameState_ReturnValue) == 0x000138, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, K2Node_DynamicCast_AsPG_Game_State_Game) == 0x000140, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::K2Node_DynamicCast_AsPG_Game_State_Game' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion, CallFunc_Conv_ByteToText_ReturnValue) == 0x000150, "Member 'UI_GameVersion_C_ExecuteUbergraph_UI_GameVersion::CallFunc_Conv_ByteToText_ReturnValue' has a wrong offset!");

}

