#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_Minimap_OtherPlayerIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Game_Minimap_OtherPlayerIcon.UI_Game_Minimap_OtherPlayerIcon_C
// 0x0030 (0x02B0 - 0x0280)
class UUI_Game_Minimap_OtherPlayerIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               MainOverlay;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerIcon;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        TargetOpacity;                                     // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MapSize;                                           // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  PlayerCharacter;                                   // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void CalculateMarkerPosition();
	void CalculatePosition_Event();
	void Construct();
	void ExecuteUbergraph_UI_Game_Minimap_OtherPlayerIcon(int32 EntryPoint);
	void FindAngle(const struct FVector2D& In, double* Degrees);
	void FindCoord(double Distance, double Degrees, struct FVector2D* NewVector);
	void OnIsAlive_Event();
	void OnIsMemberMySquad_Event();
	void OnSetPlayerState_Event();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Game_Minimap_OtherPlayerIcon_C">();
	}
	static class UUI_Game_Minimap_OtherPlayerIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Game_Minimap_OtherPlayerIcon_C>();
	}
};
static_assert(alignof(UUI_Game_Minimap_OtherPlayerIcon_C) == 0x000008, "Wrong alignment on UUI_Game_Minimap_OtherPlayerIcon_C");
static_assert(sizeof(UUI_Game_Minimap_OtherPlayerIcon_C) == 0x0002B0, "Wrong size on UUI_Game_Minimap_OtherPlayerIcon_C");
static_assert(offsetof(UUI_Game_Minimap_OtherPlayerIcon_C, UberGraphFrame) == 0x000280, "Member 'UUI_Game_Minimap_OtherPlayerIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_OtherPlayerIcon_C, MainOverlay) == 0x000288, "Member 'UUI_Game_Minimap_OtherPlayerIcon_C::MainOverlay' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_OtherPlayerIcon_C, PlayerIcon) == 0x000290, "Member 'UUI_Game_Minimap_OtherPlayerIcon_C::PlayerIcon' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_OtherPlayerIcon_C, TargetOpacity) == 0x000298, "Member 'UUI_Game_Minimap_OtherPlayerIcon_C::TargetOpacity' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_OtherPlayerIcon_C, MapSize) == 0x0002A0, "Member 'UUI_Game_Minimap_OtherPlayerIcon_C::MapSize' has a wrong offset!");
static_assert(offsetof(UUI_Game_Minimap_OtherPlayerIcon_C, PlayerCharacter) == 0x0002A8, "Member 'UUI_Game_Minimap_OtherPlayerIcon_C::PlayerCharacter' has a wrong offset!");

}

