#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_GameVersion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_GameVersion.UI_GameVersion_C
// 0x0030 (0x02B0 - 0x0280)
class UUI_GameVersion_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             PlayerId;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ServerFps;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             VectorX;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             VectorY;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Version;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_GameVersion(int32 EntryPoint);
	void OnServerFps_Event();
	void OnSetMasterId_Event();
	void SetPlayerPosition();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_GameVersion_C">();
	}
	static class UUI_GameVersion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_GameVersion_C>();
	}
};
static_assert(alignof(UUI_GameVersion_C) == 0x000008, "Wrong alignment on UUI_GameVersion_C");
static_assert(sizeof(UUI_GameVersion_C) == 0x0002B0, "Wrong size on UUI_GameVersion_C");
static_assert(offsetof(UUI_GameVersion_C, UberGraphFrame) == 0x000280, "Member 'UUI_GameVersion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_GameVersion_C, PlayerId) == 0x000288, "Member 'UUI_GameVersion_C::PlayerId' has a wrong offset!");
static_assert(offsetof(UUI_GameVersion_C, ServerFps) == 0x000290, "Member 'UUI_GameVersion_C::ServerFps' has a wrong offset!");
static_assert(offsetof(UUI_GameVersion_C, VectorX) == 0x000298, "Member 'UUI_GameVersion_C::VectorX' has a wrong offset!");
static_assert(offsetof(UUI_GameVersion_C, VectorY) == 0x0002A0, "Member 'UUI_GameVersion_C::VectorY' has a wrong offset!");
static_assert(offsetof(UUI_GameVersion_C, Version) == 0x0002A8, "Member 'UUI_GameVersion_C::Version' has a wrong offset!");

}

