#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_Notifications_Entry

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_Game_Notifications_Entry.UI_Game_Notifications_Entry_C.ExecuteUbergraph_UI_Game_Notifications_Entry
// 0x0030 (0x0030 - 0x0000)
struct UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2D[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2E[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2F[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry) == 0x000008, "Wrong alignment on UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry");
static_assert(sizeof(UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry) == 0x000030, "Wrong size on UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry");
static_assert(offsetof(UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry, EntryPoint) == 0x000000, "Member 'UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000010, "Member 'UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000018, "Member 'UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000028, "Member 'UI_Game_Notifications_Entry_C_ExecuteUbergraph_UI_Game_Notifications_Entry::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");

// Function UI_Game_Notifications_Entry.UI_Game_Notifications_Entry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Game_Notifications_Entry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_Notifications_Entry_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Game_Notifications_Entry_C_PreConstruct");
static_assert(sizeof(UI_Game_Notifications_Entry_C_PreConstruct) == 0x000001, "Wrong size on UI_Game_Notifications_Entry_C_PreConstruct");
static_assert(offsetof(UI_Game_Notifications_Entry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Game_Notifications_Entry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_Game_Notifications_Entry.UI_Game_Notifications_Entry_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct UI_Game_Notifications_Entry_C_SetText final
{
public:
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0000(0x0018)()
};
static_assert(alignof(UI_Game_Notifications_Entry_C_SetText) == 0x000008, "Wrong alignment on UI_Game_Notifications_Entry_C_SetText");
static_assert(sizeof(UI_Game_Notifications_Entry_C_SetText) == 0x000018, "Wrong size on UI_Game_Notifications_Entry_C_SetText");
static_assert(offsetof(UI_Game_Notifications_Entry_C_SetText, CallFunc_TextToUpper_ReturnValue) == 0x000000, "Member 'UI_Game_Notifications_Entry_C_SetText::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

}

