#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen_Loadout_Compact_Slot

#include "Basic.hpp"

#include "POLYGON_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_Game_SpawnScreen_Loadout_Compact_Slot.UI_Game_SpawnScreen_Loadout_Compact_Slot_C.AsyncLoadIcon
// 0x0030 (0x0030 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Compact_Slot_C_AsyncLoadIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_AsyncLoadIcon) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Compact_Slot_C_AsyncLoadIcon");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_AsyncLoadIcon) == 0x000030, "Wrong size on UI_Game_SpawnScreen_Loadout_Compact_Slot_C_AsyncLoadIcon");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_AsyncLoadIcon, Icon) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_AsyncLoadIcon::Icon' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Compact_Slot.UI_Game_SpawnScreen_Loadout_Compact_Slot_C.ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot
// 0x0070 (0x0070 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BEF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF0[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_Icon;                           // 0x0038(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot) == 0x000070, "Wrong size on UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot, EntryPoint) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot, Temp_object_Variable) == 0x000020, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot, K2Node_DynamicCast_AsTexture_2D) == 0x000028, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot, K2Node_Event_IsDesignTime) == 0x000031, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot, K2Node_CustomEvent_Icon) == 0x000038, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot::K2Node_CustomEvent_Icon' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Slot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Compact_Slot.UI_Game_SpawnScreen_Loadout_Compact_Slot_C.OnLoaded_FF6FB6ED43BE833837F94184A6F34782
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Compact_Slot_C_OnLoaded_FF6FB6ED43BE833837F94184A6F34782 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_OnLoaded_FF6FB6ED43BE833837F94184A6F34782) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Compact_Slot_C_OnLoaded_FF6FB6ED43BE833837F94184A6F34782");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_OnLoaded_FF6FB6ED43BE833837F94184A6F34782) == 0x000008, "Wrong size on UI_Game_SpawnScreen_Loadout_Compact_Slot_C_OnLoaded_FF6FB6ED43BE833837F94184A6F34782");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_OnLoaded_FF6FB6ED43BE833837F94184A6F34782, Loaded) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_OnLoaded_FF6FB6ED43BE833837F94184A6F34782::Loaded' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Compact_Slot.UI_Game_SpawnScreen_Loadout_Compact_Slot_C.Parse Modules
// 0x0220 (0x0220 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF1[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF2[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Temp_object_Variable_2;                            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Temp_object_Variable_3;                            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF3[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGunModulesInfo*                        K2Node_DynamicCast_AsGun_Modules_Info;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF4[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_1;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF5[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGunModuleInfo                         CallFunc_Array_Get_Item;                           // 0x0068(0x0040)(ContainsInstancedReference)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF6[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF7[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF8[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00D0(0x00D0)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BF9[0x3];                                     // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGunModuleType                                Temp_byte_Variable;                                // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BFA[0x6];                                     // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_2;             // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_3;             // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__Object;       // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetFieldNames_ReturnValue;                // 0x01D0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UImage*                                 K2Node_Select_Default;                             // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UImage*                                 K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BFB[0x2];                                     // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules) == 0x000010, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules) == 0x000220, "Wrong size on UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, Temp_object_Variable) == 0x000018, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, Temp_object_Variable_1) == 0x000020, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, Temp_object_Variable_2) == 0x000028, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, Temp_object_Variable_3) == 0x000030, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_HasField_ReturnValue) == 0x000038, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_HasField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000040, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, K2Node_DynamicCast_AsGun_Modules_Info) == 0x000048, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::K2Node_DynamicCast_AsGun_Modules_Info' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_GetObjectField_ReturnValue) == 0x000058, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_HasField_ReturnValue_1) == 0x000060, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_HasField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_Array_Get_Item) == 0x000068, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_BooleanAND_ReturnValue) == 0x0000A8, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x0000B0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, K2Node_DynamicCast_AsTexture_2D) == 0x0000C0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, Temp_int_Loop_Counter_Variable_1) == 0x0000CC, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, K2Node_MakeStruct_SlateBrush) == 0x0000D0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_Less_IntInt_ReturnValue) == 0x0001A0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001A4, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_BooleanAND_ReturnValue_1) == 0x0001A8, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, Temp_byte_Variable) == 0x0001A9, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_GetObjectField_ReturnValue_1) == 0x0001B0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_GetObjectField_ReturnValue_2) == 0x0001B8, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_GetObjectField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_GetObjectField_ReturnValue_3) == 0x0001C0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_GetObjectField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, K2Node_LowEntry_LocalVariable_Value__Object) == 0x0001C8, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_GetFieldNames_ReturnValue) == 0x0001D0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_GetFieldNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_Array_Get_Item_1) == 0x0001E0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, K2Node_Select_Default) == 0x0001F0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_GetStringField_ReturnValue) == 0x0001F8, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, K2Node_LowEntry_LocalVariable_Value__1_Object) == 0x000208, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::K2Node_LowEntry_LocalVariable_Value__1_Object' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000210, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_IsValid_ReturnValue) == 0x000211, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_Array_Length_ReturnValue_1) == 0x000214, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules, CallFunc_Less_IntInt_ReturnValue_1) == 0x000218, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Parse_Modules::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Compact_Slot.UI_Game_SpawnScreen_Loadout_Compact_Slot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Compact_Slot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Compact_Slot_C_PreConstruct");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_PreConstruct) == 0x000001, "Wrong size on UI_Game_SpawnScreen_Loadout_Compact_Slot_C_PreConstruct");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Compact_Slot.UI_Game_SpawnScreen_Loadout_Compact_Slot_C.Reset
// 0x00D0 (0x00D0 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Reset final
{
public:
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0000(0x00D0)()
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Reset) == 0x000010, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Reset");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Reset) == 0x0000D0, "Wrong size on UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Reset");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Reset, K2Node_MakeStruct_SlateBrush) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_Reset::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Compact_Slot.UI_Game_SpawnScreen_Loadout_Compact_Slot_C.SetIsSelected
// 0x0034 (0x0034 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetIsSelected final
{
public:
	bool                                          Param_IsSelected;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BFC[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetIsSelected) == 0x000004, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetIsSelected");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetIsSelected) == 0x000034, "Wrong size on UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetIsSelected");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetIsSelected, Param_IsSelected) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetIsSelected::Param_IsSelected' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetIsSelected, Temp_bool_Variable) == 0x000001, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetIsSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetIsSelected, Temp_struct_Variable) == 0x000004, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetIsSelected::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetIsSelected, Temp_struct_Variable_1) == 0x000014, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetIsSelected::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetIsSelected, K2Node_Select_Default) == 0x000024, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetIsSelected::K2Node_Select_Default' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Compact_Slot.UI_Game_SpawnScreen_Loadout_Compact_Slot_C.SetItemInfo
// 0x0050 (0x0050 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetItemInfo final
{
public:
	class UPlayFabJsonObject*                     ItemInfo;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BFD[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemEntry                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BFE[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Gun_General;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetItemInfo) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetItemInfo");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetItemInfo) == 0x000050, "Wrong size on UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetItemInfo");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetItemInfo, ItemInfo) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetItemInfo::ItemInfo' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetItemInfo, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Slot_C_SetItemInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
