#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen

#include "Basic.hpp"

#include "E_SpawnTargetPermission_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "POLYGON_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_Game_SpawnScreen.UI_Game_SpawnScreen_C.ActivateDeploy
// 0x00C0 (0x00C0 - 0x0000)
struct UI_Game_SpawnScreen_C_ActivateDeploy final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0078(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SpawnTargetPermission                       Temp_byte_Variable;                                // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EE1[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Game_SpawnScreen_Player_SquadMember_C* K2Node_DynamicCast_AsUI_Game_Spawn_Screen_Player_Squad_Member; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EE2[0x5];                                     // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00A8(0x0018)()
};
static_assert(alignof(UI_Game_SpawnScreen_C_ActivateDeploy) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_C_ActivateDeploy");
static_assert(sizeof(UI_Game_SpawnScreen_C_ActivateDeploy) == 0x0000C0, "Wrong size on UI_Game_SpawnScreen_C_ActivateDeploy");
static_assert(offsetof(UI_Game_SpawnScreen_C_ActivateDeploy, Temp_text_Variable) == 0x000000, "Member 'UI_Game_SpawnScreen_C_ActivateDeploy::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ActivateDeploy, Temp_text_Variable_1) == 0x000018, "Member 'UI_Game_SpawnScreen_C_ActivateDeploy::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ActivateDeploy, Temp_text_Variable_2) == 0x000030, "Member 'UI_Game_SpawnScreen_C_ActivateDeploy::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ActivateDeploy, Temp_text_Variable_3) == 0x000048, "Member 'UI_Game_SpawnScreen_C_ActivateDeploy::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ActivateDeploy, Temp_text_Variable_4) == 0x000060, "Member 'UI_Game_SpawnScreen_C_ActivateDeploy::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ActivateDeploy, Temp_text_Variable_5) == 0x000078, "Member 'UI_Game_SpawnScreen_C_ActivateDeploy::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ActivateDeploy, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'UI_Game_SpawnScreen_C_ActivateDeploy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ActivateDeploy, Temp_byte_Variable) == 0x000091, "Member 'UI_Game_SpawnScreen_C_ActivateDeploy::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ActivateDeploy, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000092, "Member 'UI_Game_SpawnScreen_C_ActivateDeploy::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ActivateDeploy, K2Node_DynamicCast_AsUI_Game_Spawn_Screen_Player_Squad_Member) == 0x000098, "Member 'UI_Game_SpawnScreen_C_ActivateDeploy::K2Node_DynamicCast_AsUI_Game_Spawn_Screen_Player_Squad_Member' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ActivateDeploy, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'UI_Game_SpawnScreen_C_ActivateDeploy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ActivateDeploy, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A1, "Member 'UI_Game_SpawnScreen_C_ActivateDeploy::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ActivateDeploy, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000A2, "Member 'UI_Game_SpawnScreen_C_ActivateDeploy::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ActivateDeploy, K2Node_Select_Default) == 0x0000A8, "Member 'UI_Game_SpawnScreen_C_ActivateDeploy::K2Node_Select_Default' has a wrong offset!");

// Function UI_Game_SpawnScreen.UI_Game_SpawnScreen_C.AddPlayerIcon
// 0x0050 (0x0050 - 0x0000)
struct UI_Game_SpawnScreen_C_AddPlayerIcon final
{
public:
	class ABP_PG_Game_Character_C*                PlayerCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSquadMember;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EE3[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            L_CreatedWidget;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          L_IsSquadMember;                                   // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EE4[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_Game_Character_C*                L_Character;                                       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EE5[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Player_SquadMember_C* CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Player_C*          CallFunc_Create_ReturnValue_1;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_C_AddPlayerIcon) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_C_AddPlayerIcon");
static_assert(sizeof(UI_Game_SpawnScreen_C_AddPlayerIcon) == 0x000050, "Wrong size on UI_Game_SpawnScreen_C_AddPlayerIcon");
static_assert(offsetof(UI_Game_SpawnScreen_C_AddPlayerIcon, PlayerCharacter) == 0x000000, "Member 'UI_Game_SpawnScreen_C_AddPlayerIcon::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_AddPlayerIcon, IsSquadMember) == 0x000008, "Member 'UI_Game_SpawnScreen_C_AddPlayerIcon::IsSquadMember' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_AddPlayerIcon, L_CreatedWidget) == 0x000010, "Member 'UI_Game_SpawnScreen_C_AddPlayerIcon::L_CreatedWidget' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_AddPlayerIcon, L_IsSquadMember) == 0x000018, "Member 'UI_Game_SpawnScreen_C_AddPlayerIcon::L_IsSquadMember' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_AddPlayerIcon, L_Character) == 0x000020, "Member 'UI_Game_SpawnScreen_C_AddPlayerIcon::L_Character' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_AddPlayerIcon, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'UI_Game_SpawnScreen_C_AddPlayerIcon::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_AddPlayerIcon, CallFunc_AddChildToOverlay_ReturnValue) == 0x000030, "Member 'UI_Game_SpawnScreen_C_AddPlayerIcon::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_AddPlayerIcon, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'UI_Game_SpawnScreen_C_AddPlayerIcon::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_AddPlayerIcon, CallFunc_Create_ReturnValue) == 0x000040, "Member 'UI_Game_SpawnScreen_C_AddPlayerIcon::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_AddPlayerIcon, CallFunc_Create_ReturnValue_1) == 0x000048, "Member 'UI_Game_SpawnScreen_C_AddPlayerIcon::CallFunc_Create_ReturnValue_1' has a wrong offset!");

// Function UI_Game_SpawnScreen.UI_Game_SpawnScreen_C.ChooseBestSpawnTarget
// 0x0130 (0x0130 - 0x0000)
struct UI_Game_SpawnScreen_C_ChooseBestSpawnTarget final
{
public:
	class UUI_Game_SpawnScreen_ControlPoint_C*    L_NearestControlPoint;                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameMode                                     CallFunc_Array_Get_Item;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EE6[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_SpawnTarget_C>     CallFunc_SetNewSpawnTarget_SpawnTarget_CastInput;  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EE7[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EE8[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EE9[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Game_SpawnScreen_ControlPoint_C*    CallFunc_Array_Get_Item_1;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_TeamBase_C*        CallFunc_Array_Get_Item_2;                         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_SpawnTarget_C>     CallFunc_SetNewSpawnTarget_SpawnTarget_CastInput_1; // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue_1;                      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EEA[0x2];                                     // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EEB[0x1];                                     // 0x0123(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_C_ChooseBestSpawnTarget");
static_assert(sizeof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget) == 0x000130, "Wrong size on UI_Game_SpawnScreen_C_ChooseBestSpawnTarget");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, L_NearestControlPoint) == 0x000000, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::L_NearestControlPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, Temp_int_Array_Index_Variable) == 0x000018, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_Array_Get_Item) == 0x00001C, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001D, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_SetNewSpawnTarget_SpawnTarget_CastInput) == 0x000020, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_SetNewSpawnTarget_SpawnTarget_CastInput' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, Temp_int_Array_Index_Variable_1) == 0x000030, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000038, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000040, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000060, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000080, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000098, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_VSize_ReturnValue) == 0x0000B0, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_IsValid_ReturnValue_2) == 0x0000B8, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000B9, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0000BA, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_BooleanAND_ReturnValue) == 0x0000BB, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_Array_Get_Item_1) == 0x0000C0, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_Array_Get_Item_2) == 0x0000C8, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_SetNewSpawnTarget_SpawnTarget_CastInput_1) == 0x0000D0, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_SetNewSpawnTarget_SpawnTarget_CastInput_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0000E0, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0000F8, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_VSize_ReturnValue_1) == 0x000110, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000118, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_Not_PreBool_ReturnValue) == 0x000119, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_Array_Length_ReturnValue) == 0x00011C, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000120, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_Less_IntInt_ReturnValue) == 0x000121, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_BooleanAND_ReturnValue_1) == 0x000122, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_Array_Length_ReturnValue_1) == 0x000124, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_Less_IntInt_ReturnValue_1) == 0x000128, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ChooseBestSpawnTarget, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000129, "Member 'UI_Game_SpawnScreen_C_ChooseBestSpawnTarget::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");

// Function UI_Game_SpawnScreen.UI_Game_SpawnScreen_C.ConvertWorldPositionToMap
// 0x0198 (0x0198 - 0x0000)
struct UI_Game_SpawnScreen_C_ConvertWorldPositionToMap final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FVector2D                              Position;                                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        L_Y;                                               // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        L_X;                                               // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EEC[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_7;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_8;      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BreakVector2D_InVec_ImplicitCast;         // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BreakVector2D_InVec_ImplicitCast_1;       // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BreakVector2D_InVec_ImplicitCast_2;       // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_C_ConvertWorldPositionToMap");
static_assert(sizeof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap) == 0x000198, "Wrong size on UI_Game_SpawnScreen_C_ConvertWorldPositionToMap");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, Actor) == 0x000000, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::Actor' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, Position) == 0x000008, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::Position' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, L_Y) == 0x000018, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::L_Y' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, L_X) == 0x000020, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::L_X' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_BreakVector_X) == 0x000040, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_BreakVector_Y) == 0x000048, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_BreakVector_Z) == 0x000050, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_BreakVector2D_X) == 0x000058, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_BreakVector2D_Y) == 0x000060, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000068, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_BreakVector2D_X_1) == 0x000078, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_BreakVector2D_Y_1) == 0x000080, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000088, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000090, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000098, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x0000A0, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_MakeVector2D_ReturnValue) == 0x0000A8, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x0000B8, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000C0, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_Conv_DoubleToString_ReturnValue) == 0x0000D0, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_BreakVector_X_1) == 0x0000E0, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_BreakVector_Y_1) == 0x0000E8, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_BreakVector_Z_1) == 0x0000F0, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, K2Node_SwitchString_CmpSuccess) == 0x0000F8, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000100, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000108, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000110, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000118, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_BreakVector2D_X_2) == 0x000120, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_BreakVector2D_Y_2) == 0x000128, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_Multiply_DoubleDouble_ReturnValue_7) == 0x000130, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_Multiply_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_Multiply_DoubleDouble_ReturnValue_8) == 0x000138, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_Multiply_DoubleDouble_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_MakeVector2D_ReturnValue_2) == 0x000140, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_BreakVector2D_InVec_ImplicitCast) == 0x000150, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_BreakVector2D_InVec_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_BreakVector2D_InVec_ImplicitCast_1) == 0x000160, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_BreakVector2D_InVec_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x000170, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000178, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_Divide_DoubleDouble_B_ImplicitCast_1) == 0x000180, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_Divide_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_ConvertWorldPositionToMap, CallFunc_BreakVector2D_InVec_ImplicitCast_2) == 0x000188, "Member 'UI_Game_SpawnScreen_C_ConvertWorldPositionToMap::CallFunc_BreakVector2D_InVec_ImplicitCast_2' has a wrong offset!");

// Function UI_Game_SpawnScreen.UI_Game_SpawnScreen_C.Create Main Markers
// 0x0120 (0x0120 - 0x0000)
struct UI_Game_SpawnScreen_C_Create_Main_Markers final
{
public:
	EControlPoint                                 L_NextControlPoint;                                // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EED[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_GameState_Game_C*                L_GameState;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EEE[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EEF[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0034(0x0008)(NoDestructor)
	uint8                                         Pad_2EF0[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_ControlPointMarker_C*               CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EF1[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EF2[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Game_SpawnScreen_ControlPoint_C*    CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EF3[0x5];                                     // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EF4[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EF5[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_ControlPoint_C*    CallFunc_Create_ReturnValue_1;                     // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AControlPoint*                          CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EF6[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_ConvertWorldPositionToMap_Position;       // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EF7[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EF8[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Game_SpawnScreen_TeamBase_C*        CallFunc_Create_ReturnValue_2;                     // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue_1;          // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_GameState_Game_C*                CallFunc_GetGameStateBP_MyGameState;               // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ATeamBase*                              CallFunc_Array_Get_Item_2;                         // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EF9[0x3];                                     // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_ConvertWorldPositionToMap_Position_1;     // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_C_Create_Main_Markers) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_C_Create_Main_Markers");
static_assert(sizeof(UI_Game_SpawnScreen_C_Create_Main_Markers) == 0x000120, "Wrong size on UI_Game_SpawnScreen_C_Create_Main_Markers");
static_assert(offsetof(UI_Game_SpawnScreen_C_Create_Main_Markers, L_NextControlPoint) == 0x000000, "Member 'UI_Game_SpawnScreen_C_Create_Main_Markers::L_NextControlPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_Create_Main_Markers, L_GameState) == 0x000008, "Member 'UI_Game_SpawnScreen_C_Create_Main_Markers::L_GameState' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_Create_Main_Markers, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'UI_Game_SpawnScreen_C_Create_Main_Markers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_Create_Main_Markers, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'UI_Game_SpawnScreen_C_Create_Main_Markers::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_Create_Main_Markers, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'UI_Game_SpawnScreen_C_Create_Main_Markers::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_Create_Main_Markers, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'UI_Game_SpawnScreen_C_Create_Main_Markers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_Create_Main_Markers, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'UI_Game_SpawnScreen_C_Create_Main_Markers::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_Create_Main_Markers, Temp_bool_True_if_break_was_hit_Variable) == 0x000024, "Member 'UI_Game_SpawnScreen_C_Create_Main_Markers::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_Create_Main_Markers, CallFunc_Not_PreBool_ReturnValue) == 0x000025, "Member 'UI_Game_SpawnScreen_C_Create_Main_Markers::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_Create_Main_Markers, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'UI_Game_SpawnScreen_C_Create_Main_Markers::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_Create_Main_Markers, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'UI_Game_SpawnScreen_C_Create_Main_Markers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_C_Create_Main_Markers, Temp_int_Array_Index_Variable_2) == 0x000030, "Member 'UI_Game_SpawnScreen_C_Create_Main_Markers::Temp_int_Array_Index_Variable_2' has a wrong offset!");
