#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen_Loadout_Full

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_Game_SpawnScreen_Loadout_Full.UI_Game_SpawnScreen_Loadout_Full_C.ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full
// 0x0058 (0x0058 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D5D[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full) == 0x000058, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full, EntryPoint) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full, K2Node_Event_IsDesignTime) == 0x000005, "Member 'UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000010, "Member 'UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full, K2Node_Event_MyGeometry) == 0x000018, "Member 'UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full, K2Node_Event_InDeltaTime) == 0x000050, "Member 'UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full, Temp_bool_Has_Been_Initd_Variable) == 0x000054, "Member 'UI_Game_SpawnScreen_Loadout_Full_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Full::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full.UI_Game_SpawnScreen_Loadout_Full_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_C_PreConstruct");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_C_PreConstruct) == 0x000001, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_C_PreConstruct");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Full.UI_Game_SpawnScreen_Loadout_Full_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Full_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Full_C_Tick) == 0x000004, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Full_C_Tick");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Full_C_Tick) == 0x00003C, "Wrong size on UI_Game_SpawnScreen_Loadout_Full_C_Tick");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_C_Tick, MyGeometry) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Full_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Full_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_Game_SpawnScreen_Loadout_Full_C_Tick::InDeltaTime' has a wrong offset!");

}

