#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_SpawnScreen_Loadout_Compact_Item

#include "Basic.hpp"

#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_Game_SpawnScreen_Loadout_Compact_Item.UI_Game_SpawnScreen_Loadout_Compact_Item_C.ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item
// 0x0188 (0x0188 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGunClass                                     Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BFF[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C00[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C01[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_1; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C02[0x5];                                     // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_2; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C03[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemEntry                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0090(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C04[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Gun_General;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C05[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Game_SpawnScreen_Loadout_Compact_Slot_C* CallFunc_GetSlotByItemClass_ItemSlot;              // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_1;                   // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C06[0x5];                                     // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           Temp_object_Variable_2;                            // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C07[0x6];                                     // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue_1;               // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_2;                   // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C08[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           Temp_object_Variable_3;                            // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           K2Node_Select_Default;                             // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ClassClass_ReturnValue;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C09[0x6];                                     // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C0A[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C0B[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Game*                   K2Node_DynamicCast_AsPG_Player_State_Game;         // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C0C[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_EquipItems_ReturnValue;                   // 0x0168(0x0010)(ReferenceParm)
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x0178(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item) == 0x000188, "Wrong size on UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, EntryPoint) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, Temp_byte_Variable) == 0x000004, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, Temp_object_Variable) == 0x000008, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_CustomEvent_Loaded) == 0x000010, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, Temp_object_Variable_1) == 0x000018, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_DynamicCast_AsTexture_2D) == 0x000020, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_GetPlayerController_ReturnValue_1) == 0x000038, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x000040, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_1) == 0x000050, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_IsVisible_ReturnValue) == 0x000059, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_Not_PreBool_ReturnValue) == 0x00005A, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_GetPlayerController_ReturnValue_2) == 0x000060, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_2) == 0x000068, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_DynamicCast_bSuccess_3) == 0x000070, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_GetStringField_ReturnValue) == 0x000078, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_Conv_StringToName_ReturnValue) == 0x000088, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_GetDataTableRowFromName_OutRow) == 0x000090, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000A0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_IsValid_ReturnValue) == 0x0000A1, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_ClassDynamicCast_AsItem_Gun_General) == 0x0000A8, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_ClassDynamicCast_AsItem_Gun_General' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_ClassDynamicCast_bSuccess) == 0x0000B0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_GetSlotByItemClass_ItemSlot) == 0x0000B8, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_GetSlotByItemClass_ItemSlot' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_GetObjectField_ReturnValue) == 0x0000C0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_HasField_ReturnValue) == 0x0000C8, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_HasField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_GetBoolField_ReturnValue) == 0x0000C9, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_GetBoolField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_HasField_ReturnValue_1) == 0x0000CA, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_HasField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, Temp_object_Variable_2) == 0x0000D0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_BooleanAND_ReturnValue) == 0x0000D8, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_BooleanAND_ReturnValue_1) == 0x0000D9, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_GetObjectField_ReturnValue_1) == 0x0000E0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_SwitchEnum_CmpSuccess) == 0x0000E8, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_GetBoolField_ReturnValue_1) == 0x0000E9, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_GetBoolField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_HasField_ReturnValue_2) == 0x0000EA, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_HasField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_BooleanAND_ReturnValue_2) == 0x0000EB, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, Temp_object_Variable_3) == 0x0000F0, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_CreateDelegate_OutputDelegate) == 0x0000F8, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_Select_Default) == 0x000108, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_AddChild_ReturnValue) == 0x000110, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_NotEqual_ClassClass_ReturnValue) == 0x000118, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_NotEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_IsValid_ReturnValue_1) == 0x000119, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_GetStringField_ReturnValue_1) == 0x000120, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_BooleanAND_ReturnValue_3) == 0x000130, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_MakeArray_Array) == 0x000138, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_BooleanAND_ReturnValue_4) == 0x000148, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_GetPlayerController_ReturnValue_3) == 0x000150, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_DynamicCast_AsPG_Player_State_Game) == 0x000158, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_DynamicCast_AsPG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_DynamicCast_bSuccess_4) == 0x000160, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, CallFunc_EquipItems_ReturnValue) == 0x000168, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::CallFunc_EquipItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item, K2Node_MakeArray_Array_1) == 0x000178, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_ExecuteUbergraph_UI_Game_SpawnScreen_Loadout_Compact_Item::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function UI_Game_SpawnScreen_Loadout_Compact_Item.UI_Game_SpawnScreen_Loadout_Compact_Item_C.OnLoaded_135F2D0D451E0AF6D263CBA52274D8BD
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_SpawnScreen_Loadout_Compact_Item_C_OnLoaded_135F2D0D451E0AF6D263CBA52274D8BD final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_OnLoaded_135F2D0D451E0AF6D263CBA52274D8BD) == 0x000008, "Wrong alignment on UI_Game_SpawnScreen_Loadout_Compact_Item_C_OnLoaded_135F2D0D451E0AF6D263CBA52274D8BD");
static_assert(sizeof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_OnLoaded_135F2D0D451E0AF6D263CBA52274D8BD) == 0x000008, "Wrong size on UI_Game_SpawnScreen_Loadout_Compact_Item_C_OnLoaded_135F2D0D451E0AF6D263CBA52274D8BD");
static_assert(offsetof(UI_Game_SpawnScreen_Loadout_Compact_Item_C_OnLoaded_135F2D0D451E0AF6D263CBA52274D8BD, Loaded) == 0x000000, "Member 'UI_Game_SpawnScreen_Loadout_Compact_Item_C_OnLoaded_135F2D0D451E0AF6D263CBA52274D8BD::Loaded' has a wrong offset!");

}

