#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_HomeScreen_Menu_Vip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_HomeScreen_Menu_Vip.UI_HomeScreen_Menu_Vip_C
// 0x0020 (0x02A0 - 0x0280)
class UUI_HomeScreen_Menu_Vip_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_VIP;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_IsActive;                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__UI_HomeScreen_Offer_Vip_Button_VIP_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_HomeScreen_Offer_Vip_Button_VIP_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_HomeScreen_Offer_Vip_Button_VIP_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_UI_HomeScreen_Menu_Vip(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_HomeScreen_Menu_Vip_C">();
	}
	static class UUI_HomeScreen_Menu_Vip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_HomeScreen_Menu_Vip_C>();
	}
};
static_assert(alignof(UUI_HomeScreen_Menu_Vip_C) == 0x000008, "Wrong alignment on UUI_HomeScreen_Menu_Vip_C");
static_assert(sizeof(UUI_HomeScreen_Menu_Vip_C) == 0x0002A0, "Wrong size on UUI_HomeScreen_Menu_Vip_C");
static_assert(offsetof(UUI_HomeScreen_Menu_Vip_C, UberGraphFrame) == 0x000280, "Member 'UUI_HomeScreen_Menu_Vip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_HomeScreen_Menu_Vip_C, Hover) == 0x000288, "Member 'UUI_HomeScreen_Menu_Vip_C::Hover' has a wrong offset!");
static_assert(offsetof(UUI_HomeScreen_Menu_Vip_C, Button_VIP) == 0x000290, "Member 'UUI_HomeScreen_Menu_Vip_C::Button_VIP' has a wrong offset!");
static_assert(offsetof(UUI_HomeScreen_Menu_Vip_C, WidgetSwitcher_IsActive) == 0x000298, "Member 'UUI_HomeScreen_Menu_Vip_C::WidgetSwitcher_IsActive' has a wrong offset!");

}

