#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_HitIndicator

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_HitIndicator.UI_HitIndicator_C.ExecuteUbergraph_UI_HitIndicator
// 0x0108 (0x0108 - 0x0000)
struct UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E13[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E14[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E15[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E16[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderTransformAngle_Angle_ImplicitCast; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator) == 0x000008, "Wrong alignment on UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator");
static_assert(sizeof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator) == 0x000108, "Wrong size on UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, EntryPoint) == 0x000000, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, K2Node_Event_MyGeometry) == 0x000008, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, K2Node_Event_InDeltaTime) == 0x000040, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, CallFunc_K2_GetPawn_ReturnValue) == 0x000050, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000060, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000068, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x000070, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000090, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000A8, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x0000C0, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, CallFunc_BreakRotator_Roll) == 0x0000D8, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, CallFunc_BreakRotator_Pitch) == 0x0000DC, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, CallFunc_BreakRotator_Yaw) == 0x0000E0, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000E8, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0000F8, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator, CallFunc_SetRenderTransformAngle_Angle_ImplicitCast) == 0x000100, "Member 'UI_HitIndicator_C_ExecuteUbergraph_UI_HitIndicator::CallFunc_SetRenderTransformAngle_Angle_ImplicitCast' has a wrong offset!");

// Function UI_HitIndicator.UI_HitIndicator_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_HitIndicator_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_HitIndicator_C_Tick) == 0x000004, "Wrong alignment on UI_HitIndicator_C_Tick");
static_assert(sizeof(UI_HitIndicator_C_Tick) == 0x00003C, "Wrong size on UI_HitIndicator_C_Tick");
static_assert(offsetof(UI_HitIndicator_C_Tick, MyGeometry) == 0x000000, "Member 'UI_HitIndicator_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_HitIndicator_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_HitIndicator_C_Tick::InDeltaTime' has a wrong offset!");

}

