#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_HomeScreen_Menu_News_ButtonSwitch

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_HomeScreen_Menu_News_ButtonSwitch.UI_HomeScreen_Menu_News_ButtonSwitch_C.ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch
// 0x0028 (0x0028 - 0x0000)
struct UI_HomeScreen_Menu_News_ButtonSwitch_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33AB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isActive;                       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33AC[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_HomeScreen_Menu_News_ButtonSwitch_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch) == 0x000008, "Wrong alignment on UI_HomeScreen_Menu_News_ButtonSwitch_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch");
static_assert(sizeof(UI_HomeScreen_Menu_News_ButtonSwitch_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch) == 0x000028, "Wrong size on UI_HomeScreen_Menu_News_ButtonSwitch_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch");
static_assert(offsetof(UI_HomeScreen_Menu_News_ButtonSwitch_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch, EntryPoint) == 0x000000, "Member 'UI_HomeScreen_Menu_News_ButtonSwitch_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_News_ButtonSwitch_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'UI_HomeScreen_Menu_News_ButtonSwitch_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_News_ButtonSwitch_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000010, "Member 'UI_HomeScreen_Menu_News_ButtonSwitch_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_News_ButtonSwitch_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UI_HomeScreen_Menu_News_ButtonSwitch_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_News_ButtonSwitch_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch, K2Node_CustomEvent_isActive) == 0x000019, "Member 'UI_HomeScreen_Menu_News_ButtonSwitch_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch::K2Node_CustomEvent_isActive' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_News_ButtonSwitch_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'UI_HomeScreen_Menu_News_ButtonSwitch_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_ButtonSwitch::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function UI_HomeScreen_Menu_News_ButtonSwitch.UI_HomeScreen_Menu_News_ButtonSwitch_C.SetIsActive
// 0x0001 (0x0001 - 0x0000)
struct UI_HomeScreen_Menu_News_ButtonSwitch_C_SetIsActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_HomeScreen_Menu_News_ButtonSwitch_C_SetIsActive) == 0x000001, "Wrong alignment on UI_HomeScreen_Menu_News_ButtonSwitch_C_SetIsActive");
static_assert(sizeof(UI_HomeScreen_Menu_News_ButtonSwitch_C_SetIsActive) == 0x000001, "Wrong size on UI_HomeScreen_Menu_News_ButtonSwitch_C_SetIsActive");
static_assert(offsetof(UI_HomeScreen_Menu_News_ButtonSwitch_C_SetIsActive, IsActive) == 0x000000, "Member 'UI_HomeScreen_Menu_News_ButtonSwitch_C_SetIsActive::IsActive' has a wrong offset!");

}

