#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_HomeScreen_Menu_News_PCL

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_HomeScreen_Menu_News_PCL.UI_HomeScreen_Menu_News_PCL_C
// 0x0020 (0x02A0 - 0x0280)
class UUI_HomeScreen_Menu_News_PCL_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ButtonAnimation;                                   // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Discord;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__UI_HomeScreen_Offer_News_NewModules_Button_Shop_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_HomeScreen_Menu_News_PCL(int32 EntryPoint);
	void OnHovered_Event(bool IsHover);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_HomeScreen_Menu_News_PCL_C">();
	}
	static class UUI_HomeScreen_Menu_News_PCL_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_HomeScreen_Menu_News_PCL_C>();
	}
};
static_assert(alignof(UUI_HomeScreen_Menu_News_PCL_C) == 0x000008, "Wrong alignment on UUI_HomeScreen_Menu_News_PCL_C");
static_assert(sizeof(UUI_HomeScreen_Menu_News_PCL_C) == 0x0002A0, "Wrong size on UUI_HomeScreen_Menu_News_PCL_C");
static_assert(offsetof(UUI_HomeScreen_Menu_News_PCL_C, UberGraphFrame) == 0x000280, "Member 'UUI_HomeScreen_Menu_News_PCL_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_HomeScreen_Menu_News_PCL_C, Hover) == 0x000288, "Member 'UUI_HomeScreen_Menu_News_PCL_C::Hover' has a wrong offset!");
static_assert(offsetof(UUI_HomeScreen_Menu_News_PCL_C, ButtonAnimation) == 0x000290, "Member 'UUI_HomeScreen_Menu_News_PCL_C::ButtonAnimation' has a wrong offset!");
static_assert(offsetof(UUI_HomeScreen_Menu_News_PCL_C, Button_Discord) == 0x000298, "Member 'UUI_HomeScreen_Menu_News_PCL_C::Button_Discord' has a wrong offset!");

}

