#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_HomeScreen_Menu_News_NewUpdate

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_HomeScreen_Menu_News_NewUpdate.UI_HomeScreen_Menu_News_NewUpdate_C.ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate
// 0x0050 (0x0050 - 0x0000)
struct UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsHover)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A5[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsHover;                        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A6[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate) == 0x000008, "Wrong alignment on UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate");
static_assert(sizeof(UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate) == 0x000050, "Wrong size on UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate");
static_assert(offsetof(UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate, EntryPoint) == 0x000000, "Member 'UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate, K2Node_Event_IsDesignTime) == 0x000014, "Member 'UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate, CallFunc_PlayAnimation_ReturnValue_2) == 0x000028, "Member 'UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate, K2Node_CustomEvent_IsHover) == 0x000038, "Member 'UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate::K2Node_CustomEvent_IsHover' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000040, "Member 'UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'UI_HomeScreen_Menu_News_NewUpdate_C_ExecuteUbergraph_UI_HomeScreen_Menu_News_NewUpdate::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UI_HomeScreen_Menu_News_NewUpdate.UI_HomeScreen_Menu_News_NewUpdate_C.OnHovered_Event
// 0x0001 (0x0001 - 0x0000)
struct UI_HomeScreen_Menu_News_NewUpdate_C_OnHovered_Event final
{
public:
	bool                                          IsHover;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_HomeScreen_Menu_News_NewUpdate_C_OnHovered_Event) == 0x000001, "Wrong alignment on UI_HomeScreen_Menu_News_NewUpdate_C_OnHovered_Event");
static_assert(sizeof(UI_HomeScreen_Menu_News_NewUpdate_C_OnHovered_Event) == 0x000001, "Wrong size on UI_HomeScreen_Menu_News_NewUpdate_C_OnHovered_Event");
static_assert(offsetof(UI_HomeScreen_Menu_News_NewUpdate_C_OnHovered_Event, IsHover) == 0x000000, "Member 'UI_HomeScreen_Menu_News_NewUpdate_C_OnHovered_Event::IsHover' has a wrong offset!");

// Function UI_HomeScreen_Menu_News_NewUpdate.UI_HomeScreen_Menu_News_NewUpdate_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_HomeScreen_Menu_News_NewUpdate_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_HomeScreen_Menu_News_NewUpdate_C_PreConstruct) == 0x000001, "Wrong alignment on UI_HomeScreen_Menu_News_NewUpdate_C_PreConstruct");
static_assert(sizeof(UI_HomeScreen_Menu_News_NewUpdate_C_PreConstruct) == 0x000001, "Wrong size on UI_HomeScreen_Menu_News_NewUpdate_C_PreConstruct");
static_assert(offsetof(UI_HomeScreen_Menu_News_NewUpdate_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_HomeScreen_Menu_News_NewUpdate_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

