#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_HomeScreen_Menu_BattlePass

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_HomeScreen_Menu_BattlePass.UI_HomeScreen_Menu_BattlePass_C.ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass
// 0x0040 (0x0040 - 0x0000)
struct UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33AE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Menu_GeneralMenuScreen_C*           CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33AF[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33B0[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass) == 0x000008, "Wrong alignment on UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass");
static_assert(sizeof(UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass) == 0x000040, "Wrong size on UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass");
static_assert(offsetof(UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass, EntryPoint) == 0x000000, "Member 'UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass, CallFunc_FindParentWidgetOfType_ReturnValue) == 0x000008, "Member 'UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass::CallFunc_FindParentWidgetOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass, Temp_bool_IsClosed_Variable) == 0x000011, "Member 'UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000020, "Member 'UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000028, "Member 'UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000029, "Member 'UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass, CallFunc_Not_PreBool_ReturnValue) == 0x00002A, "Member 'UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass, CallFunc_Not_PreBool_ReturnValue_1) == 0x00002B, "Member 'UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'UI_HomeScreen_Menu_BattlePass_C_ExecuteUbergraph_UI_HomeScreen_Menu_BattlePass::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

