#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_HomeScreen_Menu_Offers_StarterPack

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_HomeScreen_Menu_Offers_StarterPack.UI_HomeScreen_Menu_Offers_StarterPack_C.ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack
// 0x0050 (0x0050 - 0x0000)
struct UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsHover)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3375[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsHover;                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3376[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3377[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C* CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack) == 0x000008, "Wrong alignment on UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack");
static_assert(sizeof(UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack) == 0x000050, "Wrong size on UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack");
static_assert(offsetof(UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack, EntryPoint) == 0x000000, "Member 'UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack, K2Node_CustomEvent_IsHover) == 0x000028, "Member 'UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack::K2Node_CustomEvent_IsHover' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000030, "Member 'UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack, CallFunc_GetPlayerController_ReturnValue_1) == 0x000040, "Member 'UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack, CallFunc_Create_ReturnValue) == 0x000048, "Member 'UI_HomeScreen_Menu_Offers_StarterPack_C_ExecuteUbergraph_UI_HomeScreen_Menu_Offers_StarterPack::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function UI_HomeScreen_Menu_Offers_StarterPack.UI_HomeScreen_Menu_Offers_StarterPack_C.OnHovered_Event
// 0x0001 (0x0001 - 0x0000)
struct UI_HomeScreen_Menu_Offers_StarterPack_C_OnHovered_Event final
{
public:
	bool                                          IsHover;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_HomeScreen_Menu_Offers_StarterPack_C_OnHovered_Event) == 0x000001, "Wrong alignment on UI_HomeScreen_Menu_Offers_StarterPack_C_OnHovered_Event");
static_assert(sizeof(UI_HomeScreen_Menu_Offers_StarterPack_C_OnHovered_Event) == 0x000001, "Wrong size on UI_HomeScreen_Menu_Offers_StarterPack_C_OnHovered_Event");
static_assert(offsetof(UI_HomeScreen_Menu_Offers_StarterPack_C_OnHovered_Event, IsHover) == 0x000000, "Member 'UI_HomeScreen_Menu_Offers_StarterPack_C_OnHovered_Event::IsHover' has a wrong offset!");

}

