#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_HomeScreen_Menu_Vip

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_HomeScreen_Menu_Vip.UI_HomeScreen_Menu_Vip_C.ExecuteUbergraph_UI_HomeScreen_Menu_Vip
// 0x0030 (0x0030 - 0x0000)
struct UI_HomeScreen_Menu_Vip_C_ExecuteUbergraph_UI_HomeScreen_Menu_Vip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35F9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35FA[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_HomeScreen_Menu_Vip_C_ExecuteUbergraph_UI_HomeScreen_Menu_Vip) == 0x000008, "Wrong alignment on UI_HomeScreen_Menu_Vip_C_ExecuteUbergraph_UI_HomeScreen_Menu_Vip");
static_assert(sizeof(UI_HomeScreen_Menu_Vip_C_ExecuteUbergraph_UI_HomeScreen_Menu_Vip) == 0x000030, "Wrong size on UI_HomeScreen_Menu_Vip_C_ExecuteUbergraph_UI_HomeScreen_Menu_Vip");
static_assert(offsetof(UI_HomeScreen_Menu_Vip_C_ExecuteUbergraph_UI_HomeScreen_Menu_Vip, EntryPoint) == 0x000000, "Member 'UI_HomeScreen_Menu_Vip_C_ExecuteUbergraph_UI_HomeScreen_Menu_Vip::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_Vip_C_ExecuteUbergraph_UI_HomeScreen_Menu_Vip, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'UI_HomeScreen_Menu_Vip_C_ExecuteUbergraph_UI_HomeScreen_Menu_Vip::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_Vip_C_ExecuteUbergraph_UI_HomeScreen_Menu_Vip, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000010, "Member 'UI_HomeScreen_Menu_Vip_C_ExecuteUbergraph_UI_HomeScreen_Menu_Vip::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_Vip_C_ExecuteUbergraph_UI_HomeScreen_Menu_Vip, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UI_HomeScreen_Menu_Vip_C_ExecuteUbergraph_UI_HomeScreen_Menu_Vip::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_Vip_C_ExecuteUbergraph_UI_HomeScreen_Menu_Vip, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'UI_HomeScreen_Menu_Vip_C_ExecuteUbergraph_UI_HomeScreen_Menu_Vip::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_HomeScreen_Menu_Vip_C_ExecuteUbergraph_UI_HomeScreen_Menu_Vip, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'UI_HomeScreen_Menu_Vip_C_ExecuteUbergraph_UI_HomeScreen_Menu_Vip::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

