#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ItemCharacteristic_Parameter

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UI_ItemCharacteristic_Parameter.UI_ItemCharacteristic_Parameter_C.CalculateParameters
// 0x0140 (0x0140 - 0x0000)
struct UI_ItemCharacteristic_Parameter_C_CalculateParameters final
{
public:
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA1[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA2[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA3[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x006C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x007C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA4[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA5[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x009C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA6[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA7[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA8[0x2];                                     // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x00D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA9[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x00F0(0x0018)()
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CAA[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x010C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_3;                           // 0x011C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_2;      // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_3;      // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemCharacteristic_Parameter_C_CalculateParameters) == 0x000008, "Wrong alignment on UI_ItemCharacteristic_Parameter_C_CalculateParameters");
static_assert(sizeof(UI_ItemCharacteristic_Parameter_C_CalculateParameters) == 0x000140, "Wrong size on UI_ItemCharacteristic_Parameter_C_CalculateParameters");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, Temp_struct_Variable) == 0x000000, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, Temp_struct_Variable_1) == 0x000010, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, Temp_bool_Variable) == 0x000020, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, Temp_struct_Variable_2) == 0x000024, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, Temp_struct_Variable_3) == 0x000034, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, Temp_bool_Variable_1) == 0x000044, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, Temp_struct_Variable_4) == 0x000048, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, Temp_struct_Variable_5) == 0x000058, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, Temp_bool_Variable_2) == 0x000068, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, Temp_struct_Variable_6) == 0x00006C, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, Temp_struct_Variable_7) == 0x00007C, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, CallFunc_Not_PreBool_ReturnValue) == 0x00008C, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000090, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000098, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, K2Node_Select_Default) == 0x00009C, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, CallFunc_MapRangeClamped_ReturnValue) == 0x0000B0, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, CallFunc_MapRangeClamped_ReturnValue_1) == 0x0000C0, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, CallFunc_MapRangeClamped_ReturnValue_2) == 0x0000C8, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, Temp_bool_Variable_3) == 0x0000D0, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000D1, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, K2Node_Select_Default_1) == 0x0000D4, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x0000E4, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000E8, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0000F0, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000108, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, K2Node_Select_Default_2) == 0x00010C, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, K2Node_Select_Default_3) == 0x00011C, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x00012C, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, CallFunc_SetPercent_InPercent_ImplicitCast_1) == 0x000130, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::CallFunc_SetPercent_InPercent_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, CallFunc_SetPercent_InPercent_ImplicitCast_2) == 0x000134, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::CallFunc_SetPercent_InPercent_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_CalculateParameters, CallFunc_SetPercent_InPercent_ImplicitCast_3) == 0x000138, "Member 'UI_ItemCharacteristic_Parameter_C_CalculateParameters::CallFunc_SetPercent_InPercent_ImplicitCast_3' has a wrong offset!");

// Function UI_ItemCharacteristic_Parameter.UI_ItemCharacteristic_Parameter_C.ExecuteUbergraph_UI_ItemCharacteristic_Parameter
// 0x0060 (0x0060 - 0x0000)
struct UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CAB[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CAC[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter) == 0x000008, "Wrong alignment on UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter");
static_assert(sizeof(UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter) == 0x000060, "Wrong size on UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter, EntryPoint) == 0x000000, "Member 'UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter, K2Node_Event_MyGeometry) == 0x000008, "Member 'UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter, K2Node_Event_InDeltaTime) == 0x000040, "Member 'UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000048, "Member 'UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter, CallFunc_FInterpTo_ReturnValue) == 0x000050, "Member 'UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000058, "Member 'UI_ItemCharacteristic_Parameter_C_ExecuteUbergraph_UI_ItemCharacteristic_Parameter::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");

// Function UI_ItemCharacteristic_Parameter.UI_ItemCharacteristic_Parameter_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_ItemCharacteristic_Parameter_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemCharacteristic_Parameter_C_PreConstruct) == 0x000001, "Wrong alignment on UI_ItemCharacteristic_Parameter_C_PreConstruct");
static_assert(sizeof(UI_ItemCharacteristic_Parameter_C_PreConstruct) == 0x000001, "Wrong size on UI_ItemCharacteristic_Parameter_C_PreConstruct");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_ItemCharacteristic_Parameter_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_ItemCharacteristic_Parameter.UI_ItemCharacteristic_Parameter_C.SetParameters
// 0x0080 (0x0080 - 0x0000)
struct UI_ItemCharacteristic_Parameter_C_SetParameters final
{
public:
	double                                        CurrentParameter;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CompareParameter;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InstantSet;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_InvertColor;                                     // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CAD[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        L_OldParameter;                                    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        L_NewParameter;                                    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CAE[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CAF[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0038(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0050(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0068(0x0018)()
};
static_assert(alignof(UI_ItemCharacteristic_Parameter_C_SetParameters) == 0x000008, "Wrong alignment on UI_ItemCharacteristic_Parameter_C_SetParameters");
static_assert(sizeof(UI_ItemCharacteristic_Parameter_C_SetParameters) == 0x000080, "Wrong size on UI_ItemCharacteristic_Parameter_C_SetParameters");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_SetParameters, CurrentParameter) == 0x000000, "Member 'UI_ItemCharacteristic_Parameter_C_SetParameters::CurrentParameter' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_SetParameters, CompareParameter) == 0x000008, "Member 'UI_ItemCharacteristic_Parameter_C_SetParameters::CompareParameter' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_SetParameters, InstantSet) == 0x000010, "Member 'UI_ItemCharacteristic_Parameter_C_SetParameters::InstantSet' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_SetParameters, L_InvertColor) == 0x000011, "Member 'UI_ItemCharacteristic_Parameter_C_SetParameters::L_InvertColor' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_SetParameters, L_OldParameter) == 0x000018, "Member 'UI_ItemCharacteristic_Parameter_C_SetParameters::L_OldParameter' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_SetParameters, L_NewParameter) == 0x000020, "Member 'UI_ItemCharacteristic_Parameter_C_SetParameters::L_NewParameter' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_SetParameters, Temp_bool_Variable) == 0x000028, "Member 'UI_ItemCharacteristic_Parameter_C_SetParameters::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_SetParameters, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000029, "Member 'UI_ItemCharacteristic_Parameter_C_SetParameters::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_SetParameters, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'UI_ItemCharacteristic_Parameter_C_SetParameters::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_SetParameters, CallFunc_Not_PreBool_ReturnValue) == 0x00002B, "Member 'UI_ItemCharacteristic_Parameter_C_SetParameters::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_SetParameters, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'UI_ItemCharacteristic_Parameter_C_SetParameters::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_SetParameters, CallFunc_Round_ReturnValue) == 0x000030, "Member 'UI_ItemCharacteristic_Parameter_C_SetParameters::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_SetParameters, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000038, "Member 'UI_ItemCharacteristic_Parameter_C_SetParameters::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_SetParameters, CallFunc_Conv_IntToText_ReturnValue) == 0x000050, "Member 'UI_ItemCharacteristic_Parameter_C_SetParameters::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_SetParameters, K2Node_Select_Default) == 0x000068, "Member 'UI_ItemCharacteristic_Parameter_C_SetParameters::K2Node_Select_Default' has a wrong offset!");

// Function UI_ItemCharacteristic_Parameter.UI_ItemCharacteristic_Parameter_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_ItemCharacteristic_Parameter_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemCharacteristic_Parameter_C_Tick) == 0x000004, "Wrong alignment on UI_ItemCharacteristic_Parameter_C_Tick");
static_assert(sizeof(UI_ItemCharacteristic_Parameter_C_Tick) == 0x00003C, "Wrong size on UI_ItemCharacteristic_Parameter_C_Tick");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_Tick, MyGeometry) == 0x000000, "Member 'UI_ItemCharacteristic_Parameter_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_ItemCharacteristic_Parameter_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_ItemCharacteristic_Parameter_C_Tick::InDeltaTime' has a wrong offset!");

}

