#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_InteractionTime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_InteractionTime.UI_InteractionTime_C
// 0x0020 (0x02A0 - 0x0280)
class UUI_InteractionTime_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_InteractionProgress;                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        InteractionTime;                                   // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        CurrentTime;                                       // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_InteractionTime(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Timer_InteractionTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_InteractionTime_C">();
	}
	static class UUI_InteractionTime_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_InteractionTime_C>();
	}
};
static_assert(alignof(UUI_InteractionTime_C) == 0x000008, "Wrong alignment on UUI_InteractionTime_C");
static_assert(sizeof(UUI_InteractionTime_C) == 0x0002A0, "Wrong size on UUI_InteractionTime_C");
static_assert(offsetof(UUI_InteractionTime_C, UberGraphFrame) == 0x000280, "Member 'UUI_InteractionTime_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_InteractionTime_C, Image_InteractionProgress) == 0x000288, "Member 'UUI_InteractionTime_C::Image_InteractionProgress' has a wrong offset!");
static_assert(offsetof(UUI_InteractionTime_C, InteractionTime) == 0x000290, "Member 'UUI_InteractionTime_C::InteractionTime' has a wrong offset!");
static_assert(offsetof(UUI_InteractionTime_C, CurrentTime) == 0x000298, "Member 'UUI_InteractionTime_C::CurrentTime' has a wrong offset!");

}

