#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_KillLog

#include "Basic.hpp"

#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_KillLog.UI_KillLog_C.AddEntryToLog
// 0x0070 (0x0070 - 0x0000)
struct UI_KillLog_C_AddEntryToLog final
{
public:
	class APG_PlayerState_Game*                   Killed;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Game*                   Killer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPlayerDeathType                              DeathType;                                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DAA[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APG_PlayerState_Game*                   L_Killer;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Game*                   L_Killed;                                          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	EPlayerDeathType                              L_DeathType;                                       // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DAB[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChildAt_ReturnValue;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DAC[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DAD[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_KillLog_Entry_C*                    CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_KillLog_C_AddEntryToLog) == 0x000008, "Wrong alignment on UI_KillLog_C_AddEntryToLog");
static_assert(sizeof(UI_KillLog_C_AddEntryToLog) == 0x000070, "Wrong size on UI_KillLog_C_AddEntryToLog");
static_assert(offsetof(UI_KillLog_C_AddEntryToLog, Killed) == 0x000000, "Member 'UI_KillLog_C_AddEntryToLog::Killed' has a wrong offset!");
static_assert(offsetof(UI_KillLog_C_AddEntryToLog, Killer) == 0x000008, "Member 'UI_KillLog_C_AddEntryToLog::Killer' has a wrong offset!");
static_assert(offsetof(UI_KillLog_C_AddEntryToLog, DeathType) == 0x000010, "Member 'UI_KillLog_C_AddEntryToLog::DeathType' has a wrong offset!");
static_assert(offsetof(UI_KillLog_C_AddEntryToLog, L_Killer) == 0x000018, "Member 'UI_KillLog_C_AddEntryToLog::L_Killer' has a wrong offset!");
static_assert(offsetof(UI_KillLog_C_AddEntryToLog, L_Killed) == 0x000020, "Member 'UI_KillLog_C_AddEntryToLog::L_Killed' has a wrong offset!");
static_assert(offsetof(UI_KillLog_C_AddEntryToLog, L_DeathType) == 0x000028, "Member 'UI_KillLog_C_AddEntryToLog::L_DeathType' has a wrong offset!");
static_assert(offsetof(UI_KillLog_C_AddEntryToLog, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'UI_KillLog_C_AddEntryToLog::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillLog_C_AddEntryToLog, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x000038, "Member 'UI_KillLog_C_AddEntryToLog::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_KillLog_C_AddEntryToLog, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'UI_KillLog_C_AddEntryToLog::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_KillLog_C_AddEntryToLog, CallFunc_RemoveChildAt_ReturnValue) == 0x000041, "Member 'UI_KillLog_C_AddEntryToLog::CallFunc_RemoveChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillLog_C_AddEntryToLog, CallFunc_GetChildrenCount_ReturnValue) == 0x000044, "Member 'UI_KillLog_C_AddEntryToLog::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillLog_C_AddEntryToLog, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'UI_KillLog_C_AddEntryToLog::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillLog_C_AddEntryToLog, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000050, "Member 'UI_KillLog_C_AddEntryToLog::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillLog_C_AddEntryToLog, CallFunc_Create_ReturnValue) == 0x000058, "Member 'UI_KillLog_C_AddEntryToLog::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillLog_C_AddEntryToLog, CallFunc_AddChild_ReturnValue) == 0x000060, "Member 'UI_KillLog_C_AddEntryToLog::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillLog_C_AddEntryToLog, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000068, "Member 'UI_KillLog_C_AddEntryToLog::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");

}

