#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Killcam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "POLYGON_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Killcam.UI_KillCam_C
// 0x0090 (0x0310 - 0x0280)
class UUI_KillCam_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowAnimation;                                     // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_PlayerRank;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Weapon;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Health;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Killer;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PlayerName;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PlayerRank;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_WeaponName;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_You;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APG_PlayerState_Game*                   Killer;                                            // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EPlayerDeathType                              DeathType;                                         // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3EA1[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_Game_Character_C*                KillerCharacter;                                   // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ABP_PG_Game_Character_C*                MyCharacter;                                       // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnDestruct;                                        // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        TargetFOV;                                         // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CreatedGlowMaterialIntance;                        // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_UI_KillCam(int32 EntryPoint);
	void OnDestruct__DelegateSignature();
	void OnLoaded_A88A52FB4579909C553ACEB860586718(class UObject* Loaded);
	void OnLoaded_D051C28E4866ED74E1650198CEA4A38D(class UObject* Loaded);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_KillCam_C">();
	}
	static class UUI_KillCam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_KillCam_C>();
	}
};
static_assert(alignof(UUI_KillCam_C) == 0x000008, "Wrong alignment on UUI_KillCam_C");
static_assert(sizeof(UUI_KillCam_C) == 0x000310, "Wrong size on UUI_KillCam_C");
static_assert(offsetof(UUI_KillCam_C, UberGraphFrame) == 0x000280, "Member 'UUI_KillCam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_KillCam_C, ShowAnimation) == 0x000288, "Member 'UUI_KillCam_C::ShowAnimation' has a wrong offset!");
static_assert(offsetof(UUI_KillCam_C, Image_PlayerRank) == 0x000290, "Member 'UUI_KillCam_C::Image_PlayerRank' has a wrong offset!");
static_assert(offsetof(UUI_KillCam_C, Image_Weapon) == 0x000298, "Member 'UUI_KillCam_C::Image_Weapon' has a wrong offset!");
static_assert(offsetof(UUI_KillCam_C, TextBlock_Health) == 0x0002A0, "Member 'UUI_KillCam_C::TextBlock_Health' has a wrong offset!");
static_assert(offsetof(UUI_KillCam_C, TextBlock_Killer) == 0x0002A8, "Member 'UUI_KillCam_C::TextBlock_Killer' has a wrong offset!");
static_assert(offsetof(UUI_KillCam_C, TextBlock_PlayerName) == 0x0002B0, "Member 'UUI_KillCam_C::TextBlock_PlayerName' has a wrong offset!");
static_assert(offsetof(UUI_KillCam_C, TextBlock_PlayerRank) == 0x0002B8, "Member 'UUI_KillCam_C::TextBlock_PlayerRank' has a wrong offset!");
static_assert(offsetof(UUI_KillCam_C, TextBlock_WeaponName) == 0x0002C0, "Member 'UUI_KillCam_C::TextBlock_WeaponName' has a wrong offset!");
static_assert(offsetof(UUI_KillCam_C, TextBlock_You) == 0x0002C8, "Member 'UUI_KillCam_C::TextBlock_You' has a wrong offset!");
static_assert(offsetof(UUI_KillCam_C, Killer) == 0x0002D0, "Member 'UUI_KillCam_C::Killer' has a wrong offset!");
static_assert(offsetof(UUI_KillCam_C, DeathType) == 0x0002D8, "Member 'UUI_KillCam_C::DeathType' has a wrong offset!");
static_assert(offsetof(UUI_KillCam_C, KillerCharacter) == 0x0002E0, "Member 'UUI_KillCam_C::KillerCharacter' has a wrong offset!");
static_assert(offsetof(UUI_KillCam_C, MyCharacter) == 0x0002E8, "Member 'UUI_KillCam_C::MyCharacter' has a wrong offset!");
static_assert(offsetof(UUI_KillCam_C, OnDestruct) == 0x0002F0, "Member 'UUI_KillCam_C::OnDestruct' has a wrong offset!");
static_assert(offsetof(UUI_KillCam_C, TargetFOV) == 0x000300, "Member 'UUI_KillCam_C::TargetFOV' has a wrong offset!");
static_assert(offsetof(UUI_KillCam_C, CreatedGlowMaterialIntance) == 0x000308, "Member 'UUI_KillCam_C::CreatedGlowMaterialIntance' has a wrong offset!");

}

