#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_KillLog_Entry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UI_KillLog_Entry.UI_KillLog_Entry_C.ExecuteUbergraph_UI_KillLog_Entry
// 0x0118 (0x0118 - 0x0000)
struct UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE0[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE1[0x5];                                     // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE2[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	class FString                                 CallFunc_GetPlayerName_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0088(0x0018)()
	class APG_Game_Character*                     K2Node_DynamicCast_AsPG_Game_Character;            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE3[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE4[0x1];                                     // 0x00BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x00BC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00DC(0x0014)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE5[0x2];                                     // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x00F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0104(0x0014)()
};
static_assert(alignof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry) == 0x000008, "Wrong alignment on UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry");
static_assert(sizeof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry) == 0x000118, "Wrong size on UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, EntryPoint) == 0x000000, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, Temp_struct_Variable) == 0x000004, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, Temp_bool_Variable) == 0x000014, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, Temp_struct_Variable_1) == 0x000018, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, Temp_struct_Variable_2) == 0x000028, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, Temp_bool_Variable_1) == 0x000038, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, Temp_bool_Has_Been_Initd_Variable) == 0x000039, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, Temp_bool_IsClosed_Variable) == 0x00003A, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, CallFunc_PlayAnimationForward_ReturnValue) == 0x000040, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, K2Node_Event_IsDesignTime) == 0x000048, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, CallFunc_GetPlayerName_ReturnValue) == 0x000050, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, CallFunc_GetPlayerName_ReturnValue_1) == 0x000078, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::CallFunc_GetPlayerName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000088, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, K2Node_DynamicCast_AsPG_Game_Character) == 0x0000A0, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::K2Node_DynamicCast_AsPG_Game_Character' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x0000B0, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B9, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, CallFunc_IsValid_ReturnValue) == 0x0000BA, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, Temp_struct_Variable_3) == 0x0000BC, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, K2Node_Select_Default) == 0x0000CC, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, K2Node_MakeStruct_SlateColor) == 0x0000DC, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000F0, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, K2Node_SwitchEnum_CmpSuccess) == 0x0000F1, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, K2Node_Select_Default_1) == 0x0000F4, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry, K2Node_MakeStruct_SlateColor_1) == 0x000104, "Member 'UI_KillLog_Entry_C_ExecuteUbergraph_UI_KillLog_Entry::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function UI_KillLog_Entry.UI_KillLog_Entry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_KillLog_Entry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_KillLog_Entry_C_PreConstruct) == 0x000001, "Wrong alignment on UI_KillLog_Entry_C_PreConstruct");
static_assert(sizeof(UI_KillLog_Entry_C_PreConstruct) == 0x000001, "Wrong size on UI_KillLog_Entry_C_PreConstruct");
static_assert(offsetof(UI_KillLog_Entry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_KillLog_Entry_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

