#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Killcam

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "POLYGON_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_Killcam.UI_KillCam_C.ExecuteUbergraph_UI_KillCam
// 0x0408 (0x0408 - 0x0000)
struct UI_KillCam_C_ExecuteUbergraph_UI_KillCam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA3[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA4[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	struct FLevelInfo                             CallFunc_GetCurrentLevelInfo_ReturnValue;          // 0x0070(0x0048)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00B8(0x0018)()
	class ABP_PG_Game_Character_C*                K2Node_DynamicCast_AsBP_PG_Game_Character;         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA5[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA6[0x6];                                     // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ByteToText_ReturnValue;              // 0x00F0(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ByteToText_ReturnValue_1;            // 0x0110(0x0018)()
	int32                                         CallFunc_GetHealth_ReturnValue;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA7[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0130(0x0018)()
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_Game_Character_C*                K2Node_DynamicCast_AsBP_PG_Game_Character_1;       // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA8[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_Game_Character_C*                K2Node_DynamicCast_AsBP_PG_Game_Character_2;       // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA9[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendable                     CallFunc_Array_Get_Item;                           // 0x0178(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x018C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EAA[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EAB[0x4];                                     // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EAC[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_1; // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EAD[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegSin_ReturnValue;                       // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EAE[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EAF[0x4];                                     // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_2; // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EB0[0x7];                                     // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x03A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x03B8(0x0010)(NoDestructor)
	class UObject*                                Temp_object_Variable_1;                            // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_1;                 // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EB1[0x3];                                     // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EB2[0x7];                                     // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Current_ImplicitCast;           // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegSin_A_ImplicitCast;                    // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCameraFOV_newCameraFOV_ImplicitCast;   // 0x0400(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RInterpTo_DeltaTime_ImplicitCast;         // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam) == 0x000008, "Wrong alignment on UI_KillCam_C_ExecuteUbergraph_UI_KillCam");
static_assert(sizeof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam) == 0x000408, "Wrong size on UI_KillCam_C_ExecuteUbergraph_UI_KillCam");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, EntryPoint) == 0x000000, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_CustomEvent_Loaded_1) == 0x000008, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, Temp_int_Array_Index_Variable) == 0x000018, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, Temp_object_Variable) == 0x000030, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_AsTexture_2D) == 0x000038, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_GetPlayerName_ReturnValue) == 0x000048, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_GetCurrentLevelInfo_ReturnValue) == 0x000070, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_GetCurrentLevelInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_Conv_IntToText_ReturnValue) == 0x0000B8, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_AsBP_PG_Game_Character) == 0x0000D0, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_AsBP_PG_Game_Character' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x0000E0, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_bSuccess_2) == 0x0000E8, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_SwitchEnum_CmpSuccess) == 0x0000E9, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_Conv_ByteToText_ReturnValue) == 0x0000F0, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_Conv_ByteToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_PlayAnimationForward_ReturnValue) == 0x000108, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_Conv_ByteToText_ReturnValue_1) == 0x000110, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_Conv_ByteToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_GetHealth_ReturnValue) == 0x000128, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000130, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000148, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_AsBP_PG_Game_Character_1) == 0x000150, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_AsBP_PG_Game_Character_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_bSuccess_3) == 0x000158, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000160, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_AsBP_PG_Game_Character_2) == 0x000168, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_AsBP_PG_Game_Character_2' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_bSuccess_4) == 0x000170, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_Array_Get_Item) == 0x000178, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_Array_Length_ReturnValue) == 0x000188, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_Event_MyGeometry) == 0x00018C, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_Event_InDeltaTime) == 0x0001C4, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_Less_IntInt_ReturnValue) == 0x0001C8, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001D0, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001E8, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_FindLookAtRotation_ReturnValue) == 0x000200, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_GetPlayerController_ReturnValue) == 0x000218, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_BreakRotator_Roll) == 0x000220, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_BreakRotator_Pitch) == 0x000224, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_BreakRotator_Yaw) == 0x000228, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x000230, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_bSuccess_5) == 0x000238, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_MakeRotator_ReturnValue) == 0x000240, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000258, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_GetPlayerController_ReturnValue_1) == 0x000260, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_1) == 0x000268, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_bSuccess_6) == 0x000270, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000278, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000290, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0002A8, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_VSize_ReturnValue) == 0x0002C0, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_DegSin_ReturnValue) == 0x0002C8, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0002D0, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_GetComponentBounds_Origin) == 0x0002D8, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_GetComponentBounds_BoxExtent) == 0x0002F0, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_GetComponentBounds_SphereRadius) == 0x000308, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000310, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_FInterpTo_ReturnValue) == 0x000318, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000320, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_Abs_ReturnValue) == 0x000328, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000330, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_FClamp_ReturnValue) == 0x000338, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_CustomEvent_Loaded) == 0x000340, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_MakeRotator_ReturnValue_1) == 0x000348, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_RInterpTo_ReturnValue) == 0x000360, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_BreakRotator_Roll_1) == 0x000378, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_BreakRotator_Pitch_1) == 0x00037C, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_BreakRotator_Yaw_1) == 0x000380, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_GetPlayerController_ReturnValue_2) == 0x000388, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_2) == 0x000390, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game_2' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_bSuccess_7) == 0x000398, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0003A0, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003A8, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_MakeStruct_WeightedBlendable) == 0x0003B8, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_MakeStruct_WeightedBlendable' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, Temp_object_Variable_1) == 0x0003C8, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_AsTexture_2D_1) == 0x0003D0, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_AsTexture_2D_1' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, K2Node_DynamicCast_bSuccess_8) == 0x0003D8, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_Array_Add_ReturnValue) == 0x0003DC, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0003E0, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_FInterpTo_Current_ImplicitCast) == 0x0003E8, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_FInterpTo_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_DegSin_A_ImplicitCast) == 0x0003F0, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_DegSin_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0003F8, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_SetCameraFOV_newCameraFOV_ImplicitCast) == 0x000400, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_SetCameraFOV_newCameraFOV_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_ExecuteUbergraph_UI_KillCam, CallFunc_RInterpTo_DeltaTime_ImplicitCast) == 0x000404, "Member 'UI_KillCam_C_ExecuteUbergraph_UI_KillCam::CallFunc_RInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");

// Function UI_Killcam.UI_KillCam_C.OnLoaded_A88A52FB4579909C553ACEB860586718
// 0x0008 (0x0008 - 0x0000)
struct UI_KillCam_C_OnLoaded_A88A52FB4579909C553ACEB860586718 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_KillCam_C_OnLoaded_A88A52FB4579909C553ACEB860586718) == 0x000008, "Wrong alignment on UI_KillCam_C_OnLoaded_A88A52FB4579909C553ACEB860586718");
static_assert(sizeof(UI_KillCam_C_OnLoaded_A88A52FB4579909C553ACEB860586718) == 0x000008, "Wrong size on UI_KillCam_C_OnLoaded_A88A52FB4579909C553ACEB860586718");
static_assert(offsetof(UI_KillCam_C_OnLoaded_A88A52FB4579909C553ACEB860586718, Loaded) == 0x000000, "Member 'UI_KillCam_C_OnLoaded_A88A52FB4579909C553ACEB860586718::Loaded' has a wrong offset!");

// Function UI_Killcam.UI_KillCam_C.OnLoaded_D051C28E4866ED74E1650198CEA4A38D
// 0x0008 (0x0008 - 0x0000)
struct UI_KillCam_C_OnLoaded_D051C28E4866ED74E1650198CEA4A38D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_KillCam_C_OnLoaded_D051C28E4866ED74E1650198CEA4A38D) == 0x000008, "Wrong alignment on UI_KillCam_C_OnLoaded_D051C28E4866ED74E1650198CEA4A38D");
static_assert(sizeof(UI_KillCam_C_OnLoaded_D051C28E4866ED74E1650198CEA4A38D) == 0x000008, "Wrong size on UI_KillCam_C_OnLoaded_D051C28E4866ED74E1650198CEA4A38D");
static_assert(offsetof(UI_KillCam_C_OnLoaded_D051C28E4866ED74E1650198CEA4A38D, Loaded) == 0x000000, "Member 'UI_KillCam_C_OnLoaded_D051C28E4866ED74E1650198CEA4A38D::Loaded' has a wrong offset!");

// Function UI_Killcam.UI_KillCam_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_KillCam_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_KillCam_C_Tick) == 0x000004, "Wrong alignment on UI_KillCam_C_Tick");
static_assert(sizeof(UI_KillCam_C_Tick) == 0x00003C, "Wrong size on UI_KillCam_C_Tick");
static_assert(offsetof(UI_KillCam_C_Tick, MyGeometry) == 0x000000, "Member 'UI_KillCam_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_KillCam_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_KillCam_C_Tick::InDeltaTime' has a wrong offset!");

}

