#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_LoadingIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_LoadingIcon.UI_LoadingIcon_C
// 0x0030 (0x02B0 - 0x0280)
class UUI_LoadingIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Animation;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Main;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           In_Color_and_Opacity;                              // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          GlitchIsActive;                                    // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_LoadingIcon(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_LoadingIcon_C">();
	}
	static class UUI_LoadingIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_LoadingIcon_C>();
	}
};
static_assert(alignof(UUI_LoadingIcon_C) == 0x000008, "Wrong alignment on UUI_LoadingIcon_C");
static_assert(sizeof(UUI_LoadingIcon_C) == 0x0002B0, "Wrong size on UUI_LoadingIcon_C");
static_assert(offsetof(UUI_LoadingIcon_C, UberGraphFrame) == 0x000280, "Member 'UUI_LoadingIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_LoadingIcon_C, Animation) == 0x000288, "Member 'UUI_LoadingIcon_C::Animation' has a wrong offset!");
static_assert(offsetof(UUI_LoadingIcon_C, Image_Main) == 0x000290, "Member 'UUI_LoadingIcon_C::Image_Main' has a wrong offset!");
static_assert(offsetof(UUI_LoadingIcon_C, In_Color_and_Opacity) == 0x000298, "Member 'UUI_LoadingIcon_C::In_Color_and_Opacity' has a wrong offset!");
static_assert(offsetof(UUI_LoadingIcon_C, GlitchIsActive) == 0x0002A8, "Member 'UUI_LoadingIcon_C::GlitchIsActive' has a wrong offset!");

}

