#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Multiplayer_Queue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Multiplayer_Queue.UI_Multiplayer_Queue_C
// 0x0030 (0x02B0 - 0x0280)
class UUI_Multiplayer_Queue_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Leave;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Number;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Number_1;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClickLeave;                                      // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__UI_Multiplayer_Queue_Button_Leave_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void DisableTutorialLocal();
	void ExecuteUbergraph_UI_Multiplayer_Queue(int32 EntryPoint);
	void OnClickLeave__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Multiplayer_Queue_C">();
	}
	static class UUI_Multiplayer_Queue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Multiplayer_Queue_C>();
	}
};
static_assert(alignof(UUI_Multiplayer_Queue_C) == 0x000008, "Wrong alignment on UUI_Multiplayer_Queue_C");
static_assert(sizeof(UUI_Multiplayer_Queue_C) == 0x0002B0, "Wrong size on UUI_Multiplayer_Queue_C");
static_assert(offsetof(UUI_Multiplayer_Queue_C, UberGraphFrame) == 0x000280, "Member 'UUI_Multiplayer_Queue_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Multiplayer_Queue_C, Button_Leave) == 0x000288, "Member 'UUI_Multiplayer_Queue_C::Button_Leave' has a wrong offset!");
static_assert(offsetof(UUI_Multiplayer_Queue_C, TextBlock_Number) == 0x000290, "Member 'UUI_Multiplayer_Queue_C::TextBlock_Number' has a wrong offset!");
static_assert(offsetof(UUI_Multiplayer_Queue_C, TextBlock_Number_1) == 0x000298, "Member 'UUI_Multiplayer_Queue_C::TextBlock_Number_1' has a wrong offset!");
static_assert(offsetof(UUI_Multiplayer_Queue_C, OnClickLeave) == 0x0002A0, "Member 'UUI_Multiplayer_Queue_C::OnClickLeave' has a wrong offset!");

}

