#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MainMenu_Shop_Premium_SpecialOffers

#include "Basic.hpp"

#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_MainMenu_Shop_Premium_SpecialOffers.UI_MainMenu_Shop_Premium_SpecialOffers_C.ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers
// 0x0080 (0x0080 - 0x0000)
struct UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31EC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTask_MainMenu_Shop_Premium_Offers_GenerateStarterPack_C* CallFunc_CreateAction_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_CustomEvent_ModifiedData;                   // 0x0018(0x0010)(ConstParm, ReferenceParm)
	class FString                                 K2Node_CustomEvent_CustomString;                   // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31ED[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31EE[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31EF[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<EModifiedData>& ModifiedData, const class FString& CustomString)> K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers) == 0x000008, "Wrong alignment on UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers");
static_assert(sizeof(UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers) == 0x000080, "Wrong size on UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers, EntryPoint) == 0x000000, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers, CallFunc_CreateAction_ReturnValue) == 0x000008, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers::CallFunc_CreateAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers, K2Node_CustomEvent_ModifiedData) == 0x000018, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers::K2Node_CustomEvent_ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers, K2Node_CustomEvent_CustomString) == 0x000028, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers::K2Node_CustomEvent_CustomString' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers, K2Node_DynamicCast_AsPG_Player_State_Menu) == 0x000040, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers::K2Node_DynamicCast_AsPG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000049, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000050, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers, K2Node_MakeArray_Array) == 0x000058, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function UI_MainMenu_Shop_Premium_SpecialOffers.UI_MainMenu_Shop_Premium_SpecialOffers_C.OnUpdatePlayerCombinedInfo_Event
// 0x0020 (0x0020 - 0x0000)
struct UI_MainMenu_Shop_Premium_SpecialOffers_C_OnUpdatePlayerCombinedInfo_Event final
{
public:
	TArray<EModifiedData>                         ModifiedData;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 CustomString;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MainMenu_Shop_Premium_SpecialOffers_C_OnUpdatePlayerCombinedInfo_Event) == 0x000008, "Wrong alignment on UI_MainMenu_Shop_Premium_SpecialOffers_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(sizeof(UI_MainMenu_Shop_Premium_SpecialOffers_C_OnUpdatePlayerCombinedInfo_Event) == 0x000020, "Wrong size on UI_MainMenu_Shop_Premium_SpecialOffers_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_OnUpdatePlayerCombinedInfo_Event, ModifiedData) == 0x000000, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_OnUpdatePlayerCombinedInfo_Event::ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_OnUpdatePlayerCombinedInfo_Event, CustomString) == 0x000010, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_OnUpdatePlayerCombinedInfo_Event::CustomString' has a wrong offset!");

// Function UI_MainMenu_Shop_Premium_SpecialOffers.UI_MainMenu_Shop_Premium_SpecialOffers_C.RemoveOfferByClass
// 0x0090 (0x0090 - 0x0000)
struct UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass final
{
public:
	class UClass*                                 OfferClass;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 L_OfferClass;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31F0[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31F1[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31F2[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31F3[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31F4[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31F5[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBI_OfferInteract_C>   K2Node_DynamicCast_AsBI_Offer_Interact;            // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31F6[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass) == 0x000008, "Wrong alignment on UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass");
static_assert(sizeof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass) == 0x000090, "Wrong size on UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, OfferClass) == 0x000000, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::OfferClass' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, L_OfferClass) == 0x000008, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::L_OfferClass' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, Temp_bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, Temp_int_Array_Index_Variable) == 0x000014, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000028, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, CallFunc_GetChildrenCount_ReturnValue) == 0x000038, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00003C, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, CallFunc_GetAllChildren_ReturnValue) == 0x000040, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, CallFunc_Array_Get_Item) == 0x000058, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, K2Node_DynamicCast_AsBI_Offer_Interact) == 0x000068, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::K2Node_DynamicCast_AsBI_Offer_Interact' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, CallFunc_BooleanAND_ReturnValue) == 0x000079, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, CallFunc_GetObjectClass_ReturnValue) == 0x000080, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000088, "Member 'UI_MainMenu_Shop_Premium_SpecialOffers_C_RemoveOfferByClass::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");

}

