#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MatchResult_ReceivedGamePoints

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_MatchResult_ReceivedGamePoints.UI_MatchResult_ReceivedGamePoints_C.ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints
// 0x0348 (0x0348 - 0x0000)
struct UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB6[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_1;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB7[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0050(0x0018)()
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB8[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB9[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0088(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BBA[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BBB[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BBC[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_CreateSound2D_ReturnValue;                // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BBD[0x2];                                     // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScore_ReturnValue;                     // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BBE[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScore_ReturnValue_1;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLevelInfo                             CallFunc_GetNextLevelByLevelID_ReturnValue;        // 0x0110(0x0048)()
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BBF[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue_1;                       // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_GameState_Game_C*                CallFunc_GetGameStateBP_MyGameState;               // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC0[0x3];                                     // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGameTimer_ReturnValue;                 // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x01C0(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC1[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLevelInfo                             CallFunc_GetLevelByProgress_ReturnValue;           // 0x01F0(0x0048)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0238(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0250(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x0268(0x0018)()
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0280(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_5;             // 0x0290(0x0018)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue;             // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC2[0x3];                                     // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScore_ReturnValue_2;                   // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC3[0x4];                                     // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_6;             // 0x02F8(0x0018)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_4;           // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_B_ImplicitCast;                      // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC4[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints) == 0x000008, "Wrong alignment on UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints");
static_assert(sizeof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints) == 0x000348, "Wrong size on UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, EntryPoint) == 0x000000, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, Temp_object_Variable) == 0x000008, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, K2Node_DynamicCast_AsTexture_2D) == 0x000010, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, K2Node_CustomEvent_Loaded) == 0x000020, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, Temp_object_Variable_1) == 0x000028, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, K2Node_DynamicCast_AsTexture_2D_1) == 0x000030, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::K2Node_DynamicCast_AsTexture_2D_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000039, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_FTrunc_ReturnValue) == 0x00003C, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Conv_IntToText_ReturnValue) == 0x000050, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000068, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, Temp_bool_IsClosed_Variable) == 0x000070, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, Temp_bool_Has_Been_Initd_Variable) == 0x000071, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, K2Node_CreateDelegate_OutputDelegate_1) == 0x000074, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, K2Node_Event_IsDesignTime) == 0x000084, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, K2Node_Event_MyGeometry) == 0x000088, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, K2Node_Event_InDeltaTime) == 0x0000C0, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000C8, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, Temp_bool_Has_Been_Initd_Variable_1) == 0x0000D0, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000D8, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000E0, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, K2Node_CustomEvent_Loaded_1) == 0x0000E8, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_CreateSound2D_ReturnValue) == 0x0000F8, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_CreateSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000100, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_IsValid_ReturnValue_1) == 0x000101, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_GetScore_ReturnValue) == 0x000104, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_GetScore_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000108, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_GetScore_ReturnValue_1) == 0x00010C, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_GetScore_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_GetNextLevelByLevelID_ReturnValue) == 0x000110, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_GetNextLevelByLevelID_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000158, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_FTrunc_ReturnValue_1) == 0x000160, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_FTrunc_ReturnValue_2) == 0x000164, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000168, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000170, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_FMin_ReturnValue) == 0x000178, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000180, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Lerp_ReturnValue) == 0x000188, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, Temp_bool_IsClosed_Variable_1) == 0x000190, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_GetPlayerController_ReturnValue) == 0x000198, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_FMin_ReturnValue_1) == 0x0001A0, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_GetGameStateBP_MyGameState) == 0x0001A8, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_GetGameStateBP_MyGameState' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x0001B0, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, K2Node_DynamicCast_bSuccess_2) == 0x0001B8, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_GetGameTimer_ReturnValue) == 0x0001BC, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_GetGameTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0001C0, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001D8, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_IsValid_ReturnValue_2) == 0x0001E8, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_GetLevelByProgress_ReturnValue) == 0x0001F0, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_GetLevelByProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000238, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000250, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Conv_IntToText_ReturnValue_4) == 0x000268, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Conv_IntToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, K2Node_CreateDelegate_OutputDelegate_3) == 0x000280, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Conv_IntToText_ReturnValue_5) == 0x000290, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Conv_IntToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x0002A8, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_NormalizeToRange_ReturnValue) == 0x0002B0, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x0002B8, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x0002C0, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Add_IntInt_ReturnValue) == 0x0002C8, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002CC, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0002D0, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_GetScore_ReturnValue_2) == 0x0002D4, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_GetScore_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0002D8, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x0002E0, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_FTrunc_ReturnValue_3) == 0x0002E8, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_FTrunc_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Lerp_ReturnValue_1) == 0x0002F0, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Conv_IntToText_ReturnValue_6) == 0x0002F8, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Conv_IntToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Conv_IntToDouble_ReturnValue_4) == 0x000310, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Conv_IntToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Add_DoubleDouble_ReturnValue_4) == 0x000318, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Add_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000320, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Lerp_B_ImplicitCast) == 0x000328, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Lerp_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000330, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000338, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000340, "Member 'UI_MatchResult_ReceivedGamePoints_C_ExecuteUbergraph_UI_MatchResult_ReceivedGamePoints::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function UI_MatchResult_ReceivedGamePoints.UI_MatchResult_ReceivedGamePoints_C.OnLoaded_3D7D3F584CAFF1A110E1DA8B63501C2E
// 0x0008 (0x0008 - 0x0000)
struct UI_MatchResult_ReceivedGamePoints_C_OnLoaded_3D7D3F584CAFF1A110E1DA8B63501C2E final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MatchResult_ReceivedGamePoints_C_OnLoaded_3D7D3F584CAFF1A110E1DA8B63501C2E) == 0x000008, "Wrong alignment on UI_MatchResult_ReceivedGamePoints_C_OnLoaded_3D7D3F584CAFF1A110E1DA8B63501C2E");
static_assert(sizeof(UI_MatchResult_ReceivedGamePoints_C_OnLoaded_3D7D3F584CAFF1A110E1DA8B63501C2E) == 0x000008, "Wrong size on UI_MatchResult_ReceivedGamePoints_C_OnLoaded_3D7D3F584CAFF1A110E1DA8B63501C2E");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_OnLoaded_3D7D3F584CAFF1A110E1DA8B63501C2E, Loaded) == 0x000000, "Member 'UI_MatchResult_ReceivedGamePoints_C_OnLoaded_3D7D3F584CAFF1A110E1DA8B63501C2E::Loaded' has a wrong offset!");

// Function UI_MatchResult_ReceivedGamePoints.UI_MatchResult_ReceivedGamePoints_C.OnLoaded_78974F8E44E71FCE94F6F9A7D5D44E54
// 0x0008 (0x0008 - 0x0000)
struct UI_MatchResult_ReceivedGamePoints_C_OnLoaded_78974F8E44E71FCE94F6F9A7D5D44E54 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MatchResult_ReceivedGamePoints_C_OnLoaded_78974F8E44E71FCE94F6F9A7D5D44E54) == 0x000008, "Wrong alignment on UI_MatchResult_ReceivedGamePoints_C_OnLoaded_78974F8E44E71FCE94F6F9A7D5D44E54");
static_assert(sizeof(UI_MatchResult_ReceivedGamePoints_C_OnLoaded_78974F8E44E71FCE94F6F9A7D5D44E54) == 0x000008, "Wrong size on UI_MatchResult_ReceivedGamePoints_C_OnLoaded_78974F8E44E71FCE94F6F9A7D5D44E54");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_OnLoaded_78974F8E44E71FCE94F6F9A7D5D44E54, Loaded) == 0x000000, "Member 'UI_MatchResult_ReceivedGamePoints_C_OnLoaded_78974F8E44E71FCE94F6F9A7D5D44E54::Loaded' has a wrong offset!");

// Function UI_MatchResult_ReceivedGamePoints.UI_MatchResult_ReceivedGamePoints_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_MatchResult_ReceivedGamePoints_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MatchResult_ReceivedGamePoints_C_PreConstruct) == 0x000001, "Wrong alignment on UI_MatchResult_ReceivedGamePoints_C_PreConstruct");
static_assert(sizeof(UI_MatchResult_ReceivedGamePoints_C_PreConstruct) == 0x000001, "Wrong size on UI_MatchResult_ReceivedGamePoints_C_PreConstruct");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_MatchResult_ReceivedGamePoints_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_MatchResult_ReceivedGamePoints.UI_MatchResult_ReceivedGamePoints_C.SetProgress
// 0x0080 (0x0080 - 0x0000)
struct UI_MatchResult_ReceivedGamePoints_C_SetProgress final
{
public:
	double                                        CurrentProgress;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPremium_;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_IsPremium;                                       // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC5[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        L_CurrentProgress;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC6[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_2;          // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC7[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC8[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqualFloatInteger_ReturnValue;     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC9[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MatchResult_ReceivedGamePoints_C_SetProgress) == 0x000008, "Wrong alignment on UI_MatchResult_ReceivedGamePoints_C_SetProgress");
static_assert(sizeof(UI_MatchResult_ReceivedGamePoints_C_SetProgress) == 0x000080, "Wrong size on UI_MatchResult_ReceivedGamePoints_C_SetProgress");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, CurrentProgress) == 0x000000, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::CurrentProgress' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, IsPremium_) == 0x000008, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::IsPremium_' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, L_IsPremium) == 0x000009, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::L_IsPremium' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, L_CurrentProgress) == 0x000010, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::L_CurrentProgress' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, Temp_bool_Variable) == 0x000018, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, CallFunc_FTrunc_ReturnValue) == 0x00001C, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, CallFunc_NotEqual_NameName_ReturnValue) == 0x000038, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x000039, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, CallFunc_NotEqual_NameName_ReturnValue_2) == 0x00003A, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::CallFunc_NotEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, CallFunc_BooleanAND_ReturnValue) == 0x00003B, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, CallFunc_PlayAnimationForward_ReturnValue) == 0x000040, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, CallFunc_BooleanAND_ReturnValue_1) == 0x000048, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000050, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, K2Node_Select_Default) == 0x000058, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, CallFunc_GreaterEqualFloatInteger_ReturnValue) == 0x000060, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::CallFunc_GreaterEqualFloatInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000068, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, CallFunc_NormalizeToRange_ReturnValue) == 0x000070, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_SetProgress, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000078, "Member 'UI_MatchResult_ReceivedGamePoints_C_SetProgress::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function UI_MatchResult_ReceivedGamePoints.UI_MatchResult_ReceivedGamePoints_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_MatchResult_ReceivedGamePoints_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MatchResult_ReceivedGamePoints_C_Tick) == 0x000004, "Wrong alignment on UI_MatchResult_ReceivedGamePoints_C_Tick");
static_assert(sizeof(UI_MatchResult_ReceivedGamePoints_C_Tick) == 0x00003C, "Wrong size on UI_MatchResult_ReceivedGamePoints_C_Tick");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_Tick, MyGeometry) == 0x000000, "Member 'UI_MatchResult_ReceivedGamePoints_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_MatchResult_ReceivedGamePoints_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_MatchResult_ReceivedGamePoints_C_Tick::InDeltaTime' has a wrong offset!");

}

