#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Weapon_Gun_Selector_EquippedGun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ST_ItemInfo_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Solder_Weapon_Gun_Selector_EquippedGun.UI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C
// 0x00A8 (0x0328 - 0x0280)
class UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CustomizationHover;                                // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Gunsmith;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ItemIcon;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Loading;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_CurrentProgress;                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrentLevel;                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemType_1;                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemType_3;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_MaxLevel;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_WeaponName;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_WeaponType;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_LoadingIcon_C*                      UI_LoadingIcon;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FST_ItemInfo                           GunInfo;                                           // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUI_Menu_Soldier_Weapon_C*              UI_Menu_Solder_Weapon;                             // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnHovered;                                         // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_Button_Customization_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_Button_Customization_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_Button_Customization_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_EquippedGun(int32 EntryPoint);
	void OnClickBack_Event();
	void OnDark_Event();
	void OnHovered__DelegateSignature(bool IsHoved);
	void OnLoaded_88637D094754FD2518D206B827A5A426(class UObject* Loaded);
	void OnSucceed_6F9375FE4722383E9605BDB1B992E345();
	void ParseGunProgress();
	void PreConstruct(bool IsDesignTime);
	void SetGunInfo(const struct FST_ItemInfo& WeaponInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C">();
	}
	static class UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C>();
	}
};
static_assert(alignof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C) == 0x000008, "Wrong alignment on UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C");
static_assert(sizeof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C) == 0x000328, "Wrong size on UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, UberGraphFrame) == 0x000280, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, CustomizationHover) == 0x000288, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::CustomizationHover' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, Hover) == 0x000290, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::Hover' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, Button) == 0x000298, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::Button' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, Button_Gunsmith) == 0x0002A0, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::Button_Gunsmith' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, Image_ItemIcon) == 0x0002A8, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::Image_ItemIcon' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, Overlay_Loading) == 0x0002B0, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::Overlay_Loading' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, ProgressBar_CurrentProgress) == 0x0002B8, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::ProgressBar_CurrentProgress' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, SizeBox) == 0x0002C0, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, TextBlock_CurrentLevel) == 0x0002C8, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::TextBlock_CurrentLevel' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, TextBlock_ItemType_1) == 0x0002D0, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::TextBlock_ItemType_1' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, TextBlock_ItemType_3) == 0x0002D8, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::TextBlock_ItemType_3' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, TextBlock_MaxLevel) == 0x0002E0, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::TextBlock_MaxLevel' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, TextBlock_WeaponName) == 0x0002E8, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::TextBlock_WeaponName' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, TextBlock_WeaponType) == 0x0002F0, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::TextBlock_WeaponType' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, UI_LoadingIcon) == 0x0002F8, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::UI_LoadingIcon' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, GunInfo) == 0x000300, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::GunInfo' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, UI_Menu_Solder_Weapon) == 0x000310, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::UI_Menu_Solder_Weapon' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C, OnHovered) == 0x000318, "Member 'UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C::OnHovered' has a wrong offset!");

}

