#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MainMenu_Shop_Premium_Offers_BoosterBundle

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C.CreateOfferOnHomeMenu
// 0x0030 (0x0030 - 0x0000)
struct UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_CreateOfferOnHomeMenu final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_336E[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_AddOffer_CreatedOfferWidget;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_HomeScreen_Menu_Offers_BoosterBundle_C* K2Node_DynamicCast_AsUI_Home_Screen_Menu_Offers_Booster_Bundle; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_CreateOfferOnHomeMenu) == 0x000008, "Wrong alignment on UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_CreateOfferOnHomeMenu");
static_assert(sizeof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_CreateOfferOnHomeMenu) == 0x000030, "Wrong size on UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_CreateOfferOnHomeMenu");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_CreateOfferOnHomeMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_CreateOfferOnHomeMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_CreateOfferOnHomeMenu, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000008, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_CreateOfferOnHomeMenu::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_CreateOfferOnHomeMenu, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_CreateOfferOnHomeMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_CreateOfferOnHomeMenu, CallFunc_AddOffer_CreatedOfferWidget) == 0x000018, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_CreateOfferOnHomeMenu::CallFunc_AddOffer_CreatedOfferWidget' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_CreateOfferOnHomeMenu, K2Node_DynamicCast_AsUI_Home_Screen_Menu_Offers_Booster_Bundle) == 0x000020, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_CreateOfferOnHomeMenu::K2Node_DynamicCast_AsUI_Home_Screen_Menu_Offers_Booster_Bundle' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_CreateOfferOnHomeMenu, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_CreateOfferOnHomeMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C.ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle
// 0x0280 (0x0280 - 0x0000)
struct UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_336F[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3370[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3371[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3372[0x2];                                     // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D0(0x0050)(HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C* CallFunc_Create_ReturnValue;                       // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3373[0x6];                                     // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_1;                           // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0158(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0170(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3374[0x3];                                     // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_2;                           // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x01D8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01F0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0240(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0250(0x0018)()
	class FText                                   K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0268(0x0018)()
};
static_assert(alignof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle) == 0x000008, "Wrong alignment on UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle");
static_assert(sizeof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle) == 0x000280, "Wrong size on UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, EntryPoint) == 0x000000, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, Temp_int_Variable) == 0x000004, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Divide_IntInt_ReturnValue) == 0x000020, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Divide_IntInt_ReturnValue_1) == 0x000024, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Conv_IntToString_ReturnValue) == 0x000028, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Percent_IntInt_ReturnValue) == 0x000038, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Greater_IntInt_ReturnValue) == 0x000050, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000058, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000068, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000070, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000080, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, Temp_bool_Variable) == 0x000084, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000085, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000088, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, K2Node_Select_Default) == 0x000098, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000A8, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B8, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, K2Node_MakeStruct_FormatArgumentData) == 0x0000D0, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_PlayAnimation_ReturnValue) == 0x000120, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_PlayAnimation_ReturnValue_1) == 0x000128, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_GetPlayerController_ReturnValue) == 0x000130, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Create_ReturnValue) == 0x000138, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, Temp_bool_Variable_1) == 0x000140, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Greater_IntInt_ReturnValue_3) == 0x000141, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, K2Node_Select_Default_1) == 0x000148, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000158, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, K2Node_MakeStruct_FormatArgumentData_1) == 0x000170, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001C0, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, Temp_bool_Variable_2) == 0x0001C4, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, K2Node_Select_Default_2) == 0x0001C8, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0001D8, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001F0, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, K2Node_MakeArray_Array) == 0x000240, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, CallFunc_Format_ReturnValue) == 0x000250, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000268, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");

// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C.RemoveOfferFunc
// 0x0018 (0x0018 - 0x0000)
struct UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_RemoveOfferFunc final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_RemoveOfferFunc) == 0x000008, "Wrong alignment on UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_RemoveOfferFunc");
static_assert(sizeof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_RemoveOfferFunc) == 0x000018, "Wrong size on UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_RemoveOfferFunc");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_RemoveOfferFunc, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_RemoveOfferFunc::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_RemoveOfferFunc, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000008, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_RemoveOfferFunc::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_RemoveOfferFunc, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_C_RemoveOfferFunc::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

