#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Multiplayer_Queue

#include "Basic.hpp"

#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_Multiplayer_Queue.UI_Multiplayer_Queue_C.DisableTutorialLocal
// 0x0038 (0x0038 - 0x0000)
struct UI_Multiplayer_Queue_C_DisableTutorialLocal final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3445[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Multiplayer_Queue_C_DisableTutorialLocal) == 0x000008, "Wrong alignment on UI_Multiplayer_Queue_C_DisableTutorialLocal");
static_assert(sizeof(UI_Multiplayer_Queue_C_DisableTutorialLocal) == 0x000038, "Wrong size on UI_Multiplayer_Queue_C_DisableTutorialLocal");
static_assert(offsetof(UI_Multiplayer_Queue_C_DisableTutorialLocal, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'UI_Multiplayer_Queue_C_DisableTutorialLocal::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_Queue_C_DisableTutorialLocal, K2Node_MakeArray_Array) == 0x000008, "Member 'UI_Multiplayer_Queue_C_DisableTutorialLocal::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_Queue_C_DisableTutorialLocal, K2Node_DynamicCast_AsPG_Player_State_Menu) == 0x000018, "Member 'UI_Multiplayer_Queue_C_DisableTutorialLocal::K2Node_DynamicCast_AsPG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_Queue_C_DisableTutorialLocal, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UI_Multiplayer_Queue_C_DisableTutorialLocal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_Queue_C_DisableTutorialLocal, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000028, "Member 'UI_Multiplayer_Queue_C_DisableTutorialLocal::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_Queue_C_DisableTutorialLocal, CallFunc_GetObjectField_ReturnValue) == 0x000030, "Member 'UI_Multiplayer_Queue_C_DisableTutorialLocal::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");

// Function UI_Multiplayer_Queue.UI_Multiplayer_Queue_C.ExecuteUbergraph_UI_Multiplayer_Queue
// 0x0004 (0x0004 - 0x0000)
struct UI_Multiplayer_Queue_C_ExecuteUbergraph_UI_Multiplayer_Queue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Multiplayer_Queue_C_ExecuteUbergraph_UI_Multiplayer_Queue) == 0x000004, "Wrong alignment on UI_Multiplayer_Queue_C_ExecuteUbergraph_UI_Multiplayer_Queue");
static_assert(sizeof(UI_Multiplayer_Queue_C_ExecuteUbergraph_UI_Multiplayer_Queue) == 0x000004, "Wrong size on UI_Multiplayer_Queue_C_ExecuteUbergraph_UI_Multiplayer_Queue");
static_assert(offsetof(UI_Multiplayer_Queue_C_ExecuteUbergraph_UI_Multiplayer_Queue, EntryPoint) == 0x000000, "Member 'UI_Multiplayer_Queue_C_ExecuteUbergraph_UI_Multiplayer_Queue::EntryPoint' has a wrong offset!");

}

