#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Gear_Watch_Slot

#include "Basic.hpp"

#include "ST_ItemInfo_structs.hpp"
#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_Menu_Solder_Gear_Watch_Slot.UI_Menu_Solder_Gear_Watch_Slot_C.ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Slot
// 0x0004 (0x0004 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Slot_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Gear_Watch_Slot_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Slot) == 0x000004, "Wrong alignment on UI_Menu_Solder_Gear_Watch_Slot_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Slot");
static_assert(sizeof(UI_Menu_Solder_Gear_Watch_Slot_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Slot) == 0x000004, "Wrong size on UI_Menu_Solder_Gear_Watch_Slot_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Slot");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Slot_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Slot, EntryPoint) == 0x000000, "Member 'UI_Menu_Solder_Gear_Watch_Slot_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Slot::EntryPoint' has a wrong offset!");

// Function UI_Menu_Solder_Gear_Watch_Slot.UI_Menu_Solder_Gear_Watch_Slot_C.SetWatchInfo
// 0x0060 (0x0060 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo final
{
public:
	struct FST_ItemInfo                           ItemInfo;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 L_WatchClass;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F4[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Watch_General;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F5[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemEntry                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0048(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo) == 0x000008, "Wrong alignment on UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo");
static_assert(sizeof(UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo) == 0x000060, "Wrong size on UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo, ItemInfo) == 0x000000, "Member 'UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo::ItemInfo' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo, L_WatchClass) == 0x000010, "Member 'UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo::L_WatchClass' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo, CallFunc_IsValidClass_ReturnValue) == 0x000018, "Member 'UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo, K2Node_ClassDynamicCast_AsItem_Watch_General) == 0x000020, "Member 'UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo::K2Node_ClassDynamicCast_AsItem_Watch_General' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo, K2Node_ClassDynamicCast_bSuccess) == 0x000028, "Member 'UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo, CallFunc_GetStringField_ReturnValue) == 0x000030, "Member 'UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo, CallFunc_GetDataTableRowFromName_OutRow) == 0x000048, "Member 'UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000058, "Member 'UI_Menu_Solder_Gear_Watch_Slot_C_SetWatchInfo::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

}

