#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Soldier_Gear

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Soldier_Gear.UI_Menu_Soldier_Gear_C
// 0x0030 (0x02B0 - 0x0280)
class UUI_Menu_Soldier_Gear_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               Overlay_Container;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Menu_Solder_Gear_Watch_Slot_C*      UI_Menu_Solder_Gear_Watch_Slot;                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Equipped;                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Main;                               // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Menu_C*              PlayerState;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_Menu_Soldier_Gear_UI_Menu_Solder_Gear_Watch_Slot_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_Menu_Soldier_Gear(int32 EntryPoint);
	void GetSlotByItemClass(class UClass* ItemClass, class UUserWidget** Param_Slot);
	void OnUpdatePlayerCombinedInfo_Event(const TArray<EModifiedData>& ModifiedData, const class FString& CustomString);
	void ParsePlayerInventory();
	void PreConstruct(bool IsDesignTime);
	void Reset();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Menu_Soldier_Gear_C">();
	}
	static class UUI_Menu_Soldier_Gear_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Soldier_Gear_C>();
	}
};
static_assert(alignof(UUI_Menu_Soldier_Gear_C) == 0x000008, "Wrong alignment on UUI_Menu_Soldier_Gear_C");
static_assert(sizeof(UUI_Menu_Soldier_Gear_C) == 0x0002B0, "Wrong size on UUI_Menu_Soldier_Gear_C");
static_assert(offsetof(UUI_Menu_Soldier_Gear_C, UberGraphFrame) == 0x000280, "Member 'UUI_Menu_Soldier_Gear_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Soldier_Gear_C, Overlay_Container) == 0x000288, "Member 'UUI_Menu_Soldier_Gear_C::Overlay_Container' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Soldier_Gear_C, UI_Menu_Solder_Gear_Watch_Slot) == 0x000290, "Member 'UUI_Menu_Soldier_Gear_C::UI_Menu_Solder_Gear_Watch_Slot' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Soldier_Gear_C, VerticalBox_Equipped) == 0x000298, "Member 'UUI_Menu_Soldier_Gear_C::VerticalBox_Equipped' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Soldier_Gear_C, WidgetSwitcher_Main) == 0x0002A0, "Member 'UUI_Menu_Soldier_Gear_C::WidgetSwitcher_Main' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Soldier_Gear_C, PlayerState) == 0x0002A8, "Member 'UUI_Menu_Soldier_Gear_C::PlayerState' has a wrong offset!");

}

