#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Gear_Watch_Selector_Item

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "POLYGON_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PlayFab_structs.hpp"


namespace SDK::Params
{

// Function UI_Menu_Solder_Gear_Watch_Selector_Item.UI_Menu_Solder_Gear_Watch_Selector_Item_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Selector_Item_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UI_Menu_Solder_Gear_Watch_Selector_Item_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UI_Menu_Solder_Gear_Watch_Selector_Item_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function UI_Menu_Solder_Gear_Watch_Selector_Item.UI_Menu_Solder_Gear_Watch_Selector_Item_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Selector_Item_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UI_Menu_Solder_Gear_Watch_Selector_Item_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UI_Menu_Solder_Gear_Watch_Selector_Item_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UI_Menu_Solder_Gear_Watch_Selector_Item.UI_Menu_Solder_Gear_Watch_Selector_Item_C.EquipWatch_Failure
// 0x0040 (0x0040 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Failure final
{
public:
	struct FPlayFabError                          Error;                                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Failure) == 0x000008, "Wrong alignment on UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Failure");
static_assert(sizeof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Failure) == 0x000040, "Wrong size on UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Failure");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Failure, Error) == 0x000000, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Failure::Error' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Failure, CustomData) == 0x000038, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Failure::CustomData' has a wrong offset!");

// Function UI_Menu_Solder_Gear_Watch_Selector_Item.UI_Menu_Solder_Gear_Watch_Selector_Item_C.EquipWatch_Success
// 0x0068 (0x0068 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Success final
{
public:
	struct FClientExecuteCloudScriptResult        Result;                                            // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Success) == 0x000008, "Wrong alignment on UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Success");
static_assert(sizeof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Success) == 0x000068, "Wrong size on UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Success");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Success, Result) == 0x000000, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Success::Result' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Success, CustomData) == 0x000060, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_EquipWatch_Success::CustomData' has a wrong offset!");

// Function UI_Menu_Solder_Gear_Watch_Selector_Item.UI_Menu_Solder_Gear_Watch_Selector_Item_C.ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item
// 0x03B8 (0x03B8 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36DA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36DB[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue_1;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36DC[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36DD[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Solder_Gear_Watch_Selector_C*  CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Solder_Gear_Watch_Selector_C*  Temp_wildcard_Variable;                            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36DE[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Solder_Gear_Watch_Selector_C*  Temp_wildcard_Variable_1;                          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Solder_Gear_Watch_Selector_C*  CallFunc_FindParentWidgetOfType_ReturnValue_1;     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36DF[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffset_ReturnValue_1;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36E0[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Menu_Solder_Gear_Watch_Selector_C*  CallFunc_FindParentWidgetOfType_ReturnValue_2;     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Solder_Gear_Watch_Selector_C*  Temp_wildcard_Variable_2;                          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36E1[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36E2[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Menu_Solder_Gear_Watch_Selector_C*  CallFunc_FindParentWidgetOfType_ReturnValue_3;     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Solder_Gear_Watch_Selector_C*  Temp_wildcard_Variable_3;                          // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate;              // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36E3[0x5];                                     // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_Menu_Solder_Gear_Watch_Selector_Item_Entry_C* K2Node_DynamicCast_AsBP_Menu_Solder_Gear_Watch_Selector_Item_Entry; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36E4[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00E4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36E5[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36E6[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptRequest       K2Node_MakeStruct_ClientExecuteCloudScriptRequest; // 0x0140(0x0030)()
	TDelegate<void(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                      CallFunc_ExecuteCloudScript_ReturnValue;           // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36E7[0x6];                                     // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result;                         // 0x01A0(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x0208(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36E8[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0250(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0268(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x0288(0x0010)(ConstParm, ReferenceParm)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36E9[0x6];                                     // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue_1;        // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Soldier_Gear_C*                CallFunc_FindParentWidgetOfType_ReturnValue_4;     // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x02C0(0x0040)()
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36EA[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36EB[0x6];                                     // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x0320(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36EC[0x2];                                     // 0x036A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x036C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36ED[0x3];                                     // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_0_ImplicitCast;               // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_Current_ImplicitCast;  // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36EE[0x4];                                     // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item) == 0x000008, "Wrong alignment on UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item");
static_assert(sizeof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item) == 0x0003B8, "Wrong size on UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, EntryPoint) == 0x000000, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_DynamicCast_AsPG_Player_State_Menu) == 0x000010, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_DynamicCast_AsPG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x00001C, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_GetScrollOffsetOfEnd_ReturnValue_1) == 0x000020, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_GetScrollOffsetOfEnd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000024, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, Temp_real_Variable) == 0x000028, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000030, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_GetScrollOffset_ReturnValue) == 0x000034, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000038, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_FindParentWidgetOfType_ReturnValue) == 0x000040, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_FindParentWidgetOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, Temp_wildcard_Variable) == 0x000048, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, Temp_real_Variable_1) == 0x000058, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, Temp_wildcard_Variable_1) == 0x000060, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::Temp_wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_FindParentWidgetOfType_ReturnValue_1) == 0x000068, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_FindParentWidgetOfType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_GetScrollOffset_ReturnValue_1) == 0x000074, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_GetScrollOffset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000078, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_FindParentWidgetOfType_ReturnValue_2) == 0x000080, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_FindParentWidgetOfType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, Temp_wildcard_Variable_2) == 0x000088, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::Temp_wildcard_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, Temp_bool_Variable) == 0x000090, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_Select_Default) == 0x000098, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_IsValid_ReturnValue_2) == 0x0000A0, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_FindParentWidgetOfType_ReturnValue_3) == 0x0000A8, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_FindParentWidgetOfType_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, Temp_wildcard_Variable_3) == 0x0000B0, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::Temp_wildcard_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_IsValid_ReturnValue_3) == 0x0000C8, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_Event_bIsExpanded) == 0x0000C9, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_Event_bIsSelected) == 0x0000CA, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_Event_ListItemObject) == 0x0000D0, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_DynamicCast_AsBP_Menu_Solder_Gear_Watch_Selector_Item_Entry) == 0x0000D8, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_DynamicCast_AsBP_Menu_Solder_Gear_Watch_Selector_Item_Entry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_Event_MyGeometry) == 0x0000E4, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_Event_InDeltaTime) == 0x00011C, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_Not_PreBool_ReturnValue) == 0x000120, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_ConstructJsonObject_ReturnValue) == 0x000128, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_BooleanAND_ReturnValue) == 0x000130, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000138, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_MakeStruct_ClientExecuteCloudScriptRequest) == 0x000140, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_MakeStruct_ClientExecuteCloudScriptRequest' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_CreateDelegate_OutputDelegate_1) == 0x000170, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_ExecuteCloudScript_ReturnValue) == 0x000180, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_ExecuteCloudScript_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_IsValid_ReturnValue_4) == 0x000188, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_IsValid_ReturnValue_5) == 0x000189, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_GetStringField_ReturnValue) == 0x000190, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_CustomEvent_result) == 0x0001A0, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_CustomEvent_result' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_CustomEvent_customData_1) == 0x000200, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_CustomEvent_customData_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_CustomEvent_error) == 0x000208, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_CustomEvent_error' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_CustomEvent_customData) == 0x000240, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_CustomEvent_customData' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_GetBoolField_ReturnValue) == 0x000248, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_GetBoolField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_Conv_StringToText_ReturnValue) == 0x000250, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000268, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_GetPlayerController_ReturnValue) == 0x000280, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_MakeArray_Array) == 0x000288, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000298, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_DynamicCast_bSuccess_2) == 0x0002A0, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_HasField_ReturnValue) == 0x0002A1, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_HasField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_ConstructJsonObject_ReturnValue_1) == 0x0002A8, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_ConstructJsonObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_FindParentWidgetOfType_ReturnValue_4) == 0x0002B0, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_FindParentWidgetOfType_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_GetObjectField_ReturnValue) == 0x0002B8, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, Temp_struct_Variable) == 0x0002C0, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_IsValid_ReturnValue_6) == 0x000300, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_GetObjectField_ReturnValue_1) == 0x000308, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, Temp_object_Variable) == 0x000310, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, Temp_bool_Has_Been_Initd_Variable) == 0x000318, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, Temp_bool_Variable_1) == 0x000319, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_CustomEvent_response) == 0x000320, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_CustomEvent_customData_2) == 0x000360, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_CustomEvent_customData_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_CustomEvent_successful) == 0x000368, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_IsValid_ReturnValue_7) == 0x000369, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_CreateDelegate_OutputDelegate_2) == 0x00036C, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, Temp_bool_IsClosed_Variable) == 0x00037C, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast) == 0x000380, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, K2Node_Select_Option_0_ImplicitCast) == 0x000388, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::K2Node_Select_Option_0_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000390, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000398, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_FInterpTo_Constant_Current_ImplicitCast) == 0x0003A0, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_FInterpTo_Constant_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast) == 0x0003A8, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x0003B0, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function UI_Menu_Solder_Gear_Watch_Selector_Item.UI_Menu_Solder_Gear_Watch_Selector_Item_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnListItemObjectSet");
static_assert(sizeof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnListItemObjectSet) == 0x000008, "Wrong size on UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnListItemObjectSet");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UI_Menu_Solder_Gear_Watch_Selector_Item.UI_Menu_Solder_Gear_Watch_Selector_Item_C.OnPlayFabResponse_4DB661204543D431890A0D90AFBB3B1D
// 0x0050 (0x0050 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnPlayFabResponse_4DB661204543D431890A0D90AFBB3B1D final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnPlayFabResponse_4DB661204543D431890A0D90AFBB3B1D) == 0x000008, "Wrong alignment on UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnPlayFabResponse_4DB661204543D431890A0D90AFBB3B1D");
static_assert(sizeof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnPlayFabResponse_4DB661204543D431890A0D90AFBB3B1D) == 0x000050, "Wrong size on UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnPlayFabResponse_4DB661204543D431890A0D90AFBB3B1D");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnPlayFabResponse_4DB661204543D431890A0D90AFBB3B1D, Response) == 0x000000, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnPlayFabResponse_4DB661204543D431890A0D90AFBB3B1D::Response' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnPlayFabResponse_4DB661204543D431890A0D90AFBB3B1D, CustomData) == 0x000040, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnPlayFabResponse_4DB661204543D431890A0D90AFBB3B1D::CustomData' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnPlayFabResponse_4DB661204543D431890A0D90AFBB3B1D, Successful) == 0x000048, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_OnPlayFabResponse_4DB661204543D431890A0D90AFBB3B1D::Successful' has a wrong offset!");

// Function UI_Menu_Solder_Gear_Watch_Selector_Item.UI_Menu_Solder_Gear_Watch_Selector_Item_C.ParseWatchInfo
// 0x0038 (0x0038 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo final
{
public:
	class UClass*                                 L_WatchClass;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36EF[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_1;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F0[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Watch_General;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo) == 0x000008, "Wrong alignment on UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo");
static_assert(sizeof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo) == 0x000038, "Wrong size on UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo, L_WatchClass) == 0x000000, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo::L_WatchClass' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo, CallFunc_GetObjectField_ReturnValue) == 0x000008, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo, CallFunc_GetBoolField_ReturnValue) == 0x000010, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo::CallFunc_GetBoolField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo, CallFunc_GetObjectField_ReturnValue_1) == 0x000018, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo, CallFunc_HasField_ReturnValue) == 0x000021, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo::CallFunc_HasField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo, CallFunc_HasField_ReturnValue_1) == 0x000022, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo::CallFunc_HasField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo, CallFunc_BooleanAND_ReturnValue) == 0x000023, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo, CallFunc_BooleanAND_ReturnValue_1) == 0x000024, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo, K2Node_ClassDynamicCast_AsItem_Watch_General) == 0x000028, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo::K2Node_ClassDynamicCast_AsItem_Watch_General' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo, K2Node_ClassDynamicCast_bSuccess) == 0x000030, "Member 'UI_Menu_Solder_Gear_Watch_Selector_Item_C_ParseWatchInfo::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");

// Function UI_Menu_Solder_Gear_Watch_Selector_Item.UI_Menu_Solder_Gear_Watch_Selector_Item_C.SetIsEquipped
// 0x0030 (0x0030 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Selector_Item_C_SetIsEquipped final
{
public:
