#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry.UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C
// 0x0028 (0x02A8 - 0x0280)
class UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C final : public UUserWidget
{
public:
	class UBorder*                                Border_Background;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Positivity;                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Text;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDataContainerValue_DataObject*         CharacteristicData;                                // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, AdvancedDisplay, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Effect;                                            // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ParseCharacteristic();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C">();
	}
	static class UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C>();
	}
};
static_assert(alignof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C) == 0x000008, "Wrong alignment on UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C");
static_assert(sizeof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C) == 0x0002A8, "Wrong size on UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C, Border_Background) == 0x000280, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C::Border_Background' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C, TextBlock_Positivity) == 0x000288, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C::TextBlock_Positivity' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C, TextBlock_Text) == 0x000290, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C::TextBlock_Text' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C, CharacteristicData) == 0x000298, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C::CharacteristicData' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C, Effect) == 0x0002A0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C::Effect' has a wrong offset!");

}

