#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Multiplayer

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_Multiplayer.UI_Multiplayer_C.BndEvt__UI_Button_CreateServer_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Multiplayer_C_BndEvt__UI_Button_CreateServer_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Multiplayer_C_BndEvt__UI_Button_CreateServer_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Multiplayer_C_BndEvt__UI_Button_CreateServer_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature");
static_assert(sizeof(UI_Multiplayer_C_BndEvt__UI_Button_CreateServer_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Multiplayer_C_BndEvt__UI_Button_CreateServer_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature");
static_assert(offsetof(UI_Multiplayer_C_BndEvt__UI_Button_CreateServer_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Multiplayer_C_BndEvt__UI_Button_CreateServer_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Multiplayer.UI_Multiplayer_C.BndEvt__UI_Button_Quickmatch_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Multiplayer_C_BndEvt__UI_Button_Quickmatch_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Multiplayer_C_BndEvt__UI_Button_Quickmatch_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Multiplayer_C_BndEvt__UI_Button_Quickmatch_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature");
static_assert(sizeof(UI_Multiplayer_C_BndEvt__UI_Button_Quickmatch_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Multiplayer_C_BndEvt__UI_Button_Quickmatch_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature");
static_assert(offsetof(UI_Multiplayer_C_BndEvt__UI_Button_Quickmatch_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Multiplayer_C_BndEvt__UI_Button_Quickmatch_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Multiplayer.UI_Multiplayer_C.BndEvt__UI_Button_ServerList_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Multiplayer_C_BndEvt__UI_Button_ServerList_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Multiplayer_C_BndEvt__UI_Button_ServerList_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Multiplayer_C_BndEvt__UI_Button_ServerList_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature");
static_assert(sizeof(UI_Multiplayer_C_BndEvt__UI_Button_ServerList_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Multiplayer_C_BndEvt__UI_Button_ServerList_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature");
static_assert(offsetof(UI_Multiplayer_C_BndEvt__UI_Button_ServerList_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Multiplayer_C_BndEvt__UI_Button_ServerList_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Multiplayer.UI_Multiplayer_C.DirectConnectToServer
// 0x00B0 (0x00B0 - 0x0000)
struct UI_Multiplayer_C_DirectConnectToServer final
{
public:
	class FString                                 IP;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Port;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_Port;                                            // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 L_IP;                                              // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         L_PlayerController;                                // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3895[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Menu_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Menu;      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3896[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PG_GameInstance_C*                  CallFunc_GetGameInstance_MyGameIntance;            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Multiplayer_C_DirectConnectToServer) == 0x000008, "Wrong alignment on UI_Multiplayer_C_DirectConnectToServer");
static_assert(sizeof(UI_Multiplayer_C_DirectConnectToServer) == 0x0000B0, "Wrong size on UI_Multiplayer_C_DirectConnectToServer");
static_assert(offsetof(UI_Multiplayer_C_DirectConnectToServer, IP) == 0x000000, "Member 'UI_Multiplayer_C_DirectConnectToServer::IP' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_DirectConnectToServer, Port) == 0x000010, "Member 'UI_Multiplayer_C_DirectConnectToServer::Port' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_DirectConnectToServer, L_Port) == 0x000014, "Member 'UI_Multiplayer_C_DirectConnectToServer::L_Port' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_DirectConnectToServer, L_IP) == 0x000018, "Member 'UI_Multiplayer_C_DirectConnectToServer::L_IP' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_DirectConnectToServer, L_PlayerController) == 0x000028, "Member 'UI_Multiplayer_C_DirectConnectToServer::L_PlayerController' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_DirectConnectToServer, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'UI_Multiplayer_C_DirectConnectToServer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_DirectConnectToServer, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000038, "Member 'UI_Multiplayer_C_DirectConnectToServer::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_DirectConnectToServer, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'UI_Multiplayer_C_DirectConnectToServer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_DirectConnectToServer, CallFunc_Conv_IntToString_ReturnValue) == 0x000048, "Member 'UI_Multiplayer_C_DirectConnectToServer::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_DirectConnectToServer, CallFunc_GetPlayerController_ReturnValue_1) == 0x000058, "Member 'UI_Multiplayer_C_DirectConnectToServer::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_DirectConnectToServer, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'UI_Multiplayer_C_DirectConnectToServer::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_DirectConnectToServer, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000070, "Member 'UI_Multiplayer_C_DirectConnectToServer::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_DirectConnectToServer, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000080, "Member 'UI_Multiplayer_C_DirectConnectToServer::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_DirectConnectToServer, K2Node_DynamicCast_AsBP_PG_Player_State_Menu) == 0x000090, "Member 'UI_Multiplayer_C_DirectConnectToServer::K2Node_DynamicCast_AsBP_PG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_DirectConnectToServer, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'UI_Multiplayer_C_DirectConnectToServer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_DirectConnectToServer, CallFunc_GetGameInstance_MyGameIntance) == 0x0000A0, "Member 'UI_Multiplayer_C_DirectConnectToServer::CallFunc_GetGameInstance_MyGameIntance' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_DirectConnectToServer, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x0000A8, "Member 'UI_Multiplayer_C_DirectConnectToServer::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");

// Function UI_Multiplayer.UI_Multiplayer_C.ExecuteUbergraph_UI_Multiplayer
// 0x00B8 (0x00B8 - 0x0000)
struct UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3897[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3898[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3899[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_DynamicCast_AsUI_Button;                    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389A[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Button_C*                           K2Node_DynamicCast_AsUI_Button_1;                  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389B[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389C[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389D[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUI_Button_C* Button)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389E[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_2;               // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_1;               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button;                 // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_CustomEvent_Button;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer) == 0x000008, "Wrong alignment on UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer");
static_assert(sizeof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer) == 0x0000B8, "Wrong size on UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, EntryPoint) == 0x000000, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, Temp_int_Array_Index_Variable) == 0x000008, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, Temp_bool_Has_Been_Initd_Variable) == 0x00000C, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, CallFunc_GetAllChildren_ReturnValue) == 0x000028, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, CallFunc_GetAllChildren_ReturnValue_1) == 0x000038, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, CallFunc_Array_Get_Item) == 0x000048, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, K2Node_DynamicCast_AsUI_Button) == 0x000058, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::K2Node_DynamicCast_AsUI_Button' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, K2Node_DynamicCast_AsUI_Button_1) == 0x000068, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::K2Node_DynamicCast_AsUI_Button_1' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, CallFunc_Array_Length_ReturnValue_1) == 0x00007C, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, CallFunc_Less_IntInt_ReturnValue_1) == 0x000080, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, K2Node_CreateDelegate_OutputDelegate) == 0x000084, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, K2Node_ComponentBoundEvent_Button_2) == 0x000098, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, K2Node_ComponentBoundEvent_Button_1) == 0x0000A0, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, K2Node_ComponentBoundEvent_Button) == 0x0000A8, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer, K2Node_CustomEvent_Button) == 0x0000B0, "Member 'UI_Multiplayer_C_ExecuteUbergraph_UI_Multiplayer::K2Node_CustomEvent_Button' has a wrong offset!");

// Function UI_Multiplayer.UI_Multiplayer_C.OnClick_Event
// 0x0008 (0x0008 - 0x0000)
struct UI_Multiplayer_C_OnClick_Event final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Multiplayer_C_OnClick_Event) == 0x000008, "Wrong alignment on UI_Multiplayer_C_OnClick_Event");
static_assert(sizeof(UI_Multiplayer_C_OnClick_Event) == 0x000008, "Wrong size on UI_Multiplayer_C_OnClick_Event");
static_assert(offsetof(UI_Multiplayer_C_OnClick_Event, Button) == 0x000000, "Member 'UI_Multiplayer_C_OnClick_Event::Button' has a wrong offset!");

}

