#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item.UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C
// 0x0090 (0x0310 - 0x0280)
class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Lock;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_IsEquipped;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Rare;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Rare_Glow;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectedBackground;                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_IsLock;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Loading;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Name;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Name;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_LoadingIcon_C*                      UI_LoadingIcon;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_Entry_C* Entry;                                             // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_C* UI_Menu_Soldier_Weapon_Gun_Gunsmith_Selector_List; // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Delta_Time;                                        // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUnlocked;                                        // 0x030C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEquipped;                                        // 0x030D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void ParseModuleInfo();
	void Reset();
	void SetIsEquipped(bool IsEquip);
	void SetIsUnlock(bool IsUnlock);
	void SetRare(EItemRareType Rare);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C">();
	}
	static class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C>();
	}
};
static_assert(alignof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C) == 0x000008, "Wrong alignment on UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C");
static_assert(sizeof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C) == 0x000310, "Wrong size on UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, UberGraphFrame) == 0x000280, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, Lock) == 0x000288, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::Lock' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, Hover) == 0x000290, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::Hover' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, Border_IsEquipped) == 0x000298, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::Border_IsEquipped' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, Border_Rare) == 0x0002A0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::Border_Rare' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, Button) == 0x0002A8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::Button' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, Image_Icon) == 0x0002B0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, Image_Rare_Glow) == 0x0002B8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::Image_Rare_Glow' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, Image_SelectedBackground) == 0x0002C0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::Image_SelectedBackground' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, Overlay_IsLock) == 0x0002C8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::Overlay_IsLock' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, Overlay_Loading) == 0x0002D0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::Overlay_Loading' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, ScrollBox_Name) == 0x0002D8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::ScrollBox_Name' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, SizeBox) == 0x0002E0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, TextBlock_Name) == 0x0002E8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::TextBlock_Name' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, UI_LoadingIcon) == 0x0002F0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::UI_LoadingIcon' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, Entry) == 0x0002F8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::Entry' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, UI_Menu_Soldier_Weapon_Gun_Gunsmith_Selector_List) == 0x000300, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::UI_Menu_Soldier_Weapon_Gun_Gunsmith_Selector_List' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, Delta_Time) == 0x000308, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::Delta_Time' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, IsUnlocked) == 0x00030C, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::IsUnlocked' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C, IsEquipped) == 0x00030D, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C::IsEquipped' has a wrong offset!");

}

