#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary

#include "Basic.hpp"

#include "POLYGON_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary.UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C
// 0x0060 (0x02E0 - 0x0280)
class UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C final : public UUserWidget
{
public:
	class UVerticalBox*                           VerticalBox_Cons;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Cons_Base;                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Pros;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Pros_Base;                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGunModuleInfo                         ModuleInfo;                                        // 0x02A0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ParseCharacteristics(const struct FGunModuleInfo& Param_ModuleInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C">();
	}
	static class UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C>();
	}
};
static_assert(alignof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C) == 0x000008, "Wrong alignment on UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C");
static_assert(sizeof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C) == 0x0002E0, "Wrong size on UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C, VerticalBox_Cons) == 0x000280, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C::VerticalBox_Cons' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C, VerticalBox_Cons_Base) == 0x000288, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C::VerticalBox_Cons_Base' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C, VerticalBox_Pros) == 0x000290, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C::VerticalBox_Pros' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C, VerticalBox_Pros_Base) == 0x000298, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C::VerticalBox_Pros_Base' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C, ModuleInfo) == 0x0002A0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C::ModuleInfo' has a wrong offset!");

}

