#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Gear_Watch_Selector_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Solder_Gear_Watch_Selector_Item.UI_Menu_Solder_Gear_Watch_Selector_Item_C
// 0x0078 (0x02F8 - 0x0280)
class UUI_Menu_Solder_Gear_Watch_Selector_Item_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Lock;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Rare;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Rare_Glow_01;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Rare_Glow_02;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectedBackground;                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOpenIcon*                              OpenIcon_Equipped;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_IsLock;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Name;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Name;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Menu_Solder_Gear_Watch_Selector_Item_Entry_C* Entry;                                             // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Delta_Time;                                        // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUnlocked;                                        // 0x02F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEquipped;                                        // 0x02F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_Menu_Solder_Gear_Watch_Selector_Item_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Menu_Solder_Gear_Watch_Selector_Item_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Menu_Solder_Gear_Watch_Selector_Item_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void EquipWatch_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void EquipWatch_Success(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData);
	void ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector_Item(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnPlayFabResponse_4DB661204543D431890A0D90AFBB3B1D(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void ParseWatchInfo();
	void Reset();
	void SetIsEquipped(bool IsEquip);
	void SetIsUnlock(bool IsUnlock);
	void SetRare(EItemRareType Rare);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Menu_Solder_Gear_Watch_Selector_Item_C">();
	}
	static class UUI_Menu_Solder_Gear_Watch_Selector_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Solder_Gear_Watch_Selector_Item_C>();
	}
};
static_assert(alignof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C) == 0x000008, "Wrong alignment on UUI_Menu_Solder_Gear_Watch_Selector_Item_C");
static_assert(sizeof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C) == 0x0002F8, "Wrong size on UUI_Menu_Solder_Gear_Watch_Selector_Item_C");
static_assert(offsetof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C, UberGraphFrame) == 0x000280, "Member 'UUI_Menu_Solder_Gear_Watch_Selector_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C, Lock) == 0x000288, "Member 'UUI_Menu_Solder_Gear_Watch_Selector_Item_C::Lock' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C, Border_Rare) == 0x000290, "Member 'UUI_Menu_Solder_Gear_Watch_Selector_Item_C::Border_Rare' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C, Button) == 0x000298, "Member 'UUI_Menu_Solder_Gear_Watch_Selector_Item_C::Button' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C, Image_Background) == 0x0002A0, "Member 'UUI_Menu_Solder_Gear_Watch_Selector_Item_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C, Image_Rare_Glow_01) == 0x0002A8, "Member 'UUI_Menu_Solder_Gear_Watch_Selector_Item_C::Image_Rare_Glow_01' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C, Image_Rare_Glow_02) == 0x0002B0, "Member 'UUI_Menu_Solder_Gear_Watch_Selector_Item_C::Image_Rare_Glow_02' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C, Image_SelectedBackground) == 0x0002B8, "Member 'UUI_Menu_Solder_Gear_Watch_Selector_Item_C::Image_SelectedBackground' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C, OpenIcon_Equipped) == 0x0002C0, "Member 'UUI_Menu_Solder_Gear_Watch_Selector_Item_C::OpenIcon_Equipped' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C, Overlay_IsLock) == 0x0002C8, "Member 'UUI_Menu_Solder_Gear_Watch_Selector_Item_C::Overlay_IsLock' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C, ScrollBox_Name) == 0x0002D0, "Member 'UUI_Menu_Solder_Gear_Watch_Selector_Item_C::ScrollBox_Name' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C, SizeBox) == 0x0002D8, "Member 'UUI_Menu_Solder_Gear_Watch_Selector_Item_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C, TextBlock_Name) == 0x0002E0, "Member 'UUI_Menu_Solder_Gear_Watch_Selector_Item_C::TextBlock_Name' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C, Entry) == 0x0002E8, "Member 'UUI_Menu_Solder_Gear_Watch_Selector_Item_C::Entry' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C, Delta_Time) == 0x0002F0, "Member 'UUI_Menu_Solder_Gear_Watch_Selector_Item_C::Delta_Time' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C, IsUnlocked) == 0x0002F4, "Member 'UUI_Menu_Solder_Gear_Watch_Selector_Item_C::IsUnlocked' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Gear_Watch_Selector_Item_C, IsEquipped) == 0x0002F5, "Member 'UUI_Menu_Solder_Gear_Watch_Selector_Item_C::IsEquipped' has a wrong offset!");

}

