#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DataContainer_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C
// 0x0090 (0x0310 - 0x0280)
class UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowDetails;                                       // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Buy;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Close;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Details;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrencySign_01;                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrencySign_02;                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Price_01;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Price_02;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Timer;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SoftLoadingScreen_C*                UI_SoftLoadingScreen;                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Details;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Order_Id;                                          // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Trans_Id;                                          // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UUI_MainMenu_Shop_Premium_Offers_StarterPack_C* StarterPackInShop;                                 // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FDataContainerObjectWrapper            Price;                                             // 0x0308(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)

public:
	void BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Close_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Close_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Close_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Details_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Details_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_MainMenu_Offers_StarterPack_BuyPage_Button_Details_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_Button_Buy_K2Node_ComponentBoundEvent_6_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage(int32 EntryPoint);
	void MicroTxnAuthorizationResponse_Event(const struct FMicroTxnAuthorizationResponse& Data);
	void OnPlayFabResponse_1CC442114838F73DFE7A0ABEABFC8ACF(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void OnPlayFabResponse_47E1A245465E405069DB68A0FB4D256A(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void OnPlayFabResponse_4DA677C9456C74A537D3D4AE02ED21D8(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void OnPlayFabResponse_60C97A8B42A225A67538279E0B85ED7B(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void SetCurrency();
	void SetOfferAsPurchased_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void SetOfferAsPurchased_Success(const struct FClientUpdateUserDataResult& Result, class UObject* CustomData);
	void ShowError(const struct FPlayFabError& PlayFabError);
	void SteamFinalizeTxn_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void SteamFinalizeTxn_Success(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData);
	void SteamInitTxn_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void SteamInitTxn_Success(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void WritePlayerEvent_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void WritePlayerEvent_Success(const struct FClientWriteEventResponse& Result, class UObject* CustomData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C">();
	}
	static class UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C>();
	}
};
static_assert(alignof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C) == 0x000008, "Wrong alignment on UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C");
static_assert(sizeof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C) == 0x000310, "Wrong size on UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C, UberGraphFrame) == 0x000280, "Member 'UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C, ShowDetails) == 0x000288, "Member 'UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C::ShowDetails' has a wrong offset!");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C, Button_Buy) == 0x000290, "Member 'UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C::Button_Buy' has a wrong offset!");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C, Button_Close) == 0x000298, "Member 'UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C::Button_Close' has a wrong offset!");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C, Button_Details) == 0x0002A0, "Member 'UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C::Button_Details' has a wrong offset!");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C, TextBlock_CurrencySign_01) == 0x0002A8, "Member 'UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C::TextBlock_CurrencySign_01' has a wrong offset!");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C, TextBlock_CurrencySign_02) == 0x0002B0, "Member 'UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C::TextBlock_CurrencySign_02' has a wrong offset!");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C, TextBlock_Price_01) == 0x0002B8, "Member 'UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C::TextBlock_Price_01' has a wrong offset!");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C, TextBlock_Price_02) == 0x0002C0, "Member 'UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C::TextBlock_Price_02' has a wrong offset!");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C, TextBlock_Timer) == 0x0002C8, "Member 'UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C::TextBlock_Timer' has a wrong offset!");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C, UI_SoftLoadingScreen) == 0x0002D0, "Member 'UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C::UI_SoftLoadingScreen' has a wrong offset!");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C, WidgetSwitcher_Details) == 0x0002D8, "Member 'UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C::WidgetSwitcher_Details' has a wrong offset!");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C, Order_Id) == 0x0002E0, "Member 'UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C::Order_Id' has a wrong offset!");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C, Trans_Id) == 0x0002F0, "Member 'UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C::Trans_Id' has a wrong offset!");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C, StarterPackInShop) == 0x000300, "Member 'UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C::StarterPackInShop' has a wrong offset!");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C, Price) == 0x000308, "Member 'UUI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C::Price' has a wrong offset!");

}

