#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary

#include "Basic.hpp"

#include "POLYGON_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary.UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C.ParseCharacteristics
// 0x0118 (0x0118 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics final
{
public:
	struct FGunModuleInfo                         Param_ModuleInfo;                                  // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C* L_CreatedEntry;                                    // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C0D[0x1];                                     // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C* CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C0E[0x2];                                     // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0068(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C0F[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataContainerValue_Base*               CallFunc_Map_Find_Value;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C10[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataContainerValue_Base*               K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDataContainerValue_DataObject*         K2Node_DynamicCast_AsData_Object;                  // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C11[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C12[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDataContainerValue_Base*>       CallFunc_Map_Values_Values;                        // 0x00A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C13[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataContainerValue_Base*               CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDataContainerValue_DataObject*         K2Node_DynamicCast_AsData_Object_1;                // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C14[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C15[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C16[0x1];                                     // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue_2;           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C17[0x2];                                     // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue_3;           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C18[0x6];                                     // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBox*                           K2Node_Select_Default_2;                           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C19[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics) == 0x000118, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, Param_ModuleInfo) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::Param_ModuleInfo' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, L_CreatedEntry) == 0x000040, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::L_CreatedEntry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, Temp_byte_Variable) == 0x000048, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, Temp_byte_Variable_1) == 0x000049, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, Temp_bool_Variable) == 0x00004A, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, Temp_byte_Variable_2) == 0x00004B, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, Temp_byte_Variable_3) == 0x00004C, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, Temp_bool_Variable_1) == 0x00004D, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_IsValid_ReturnValue) == 0x00004E, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_Create_ReturnValue) == 0x000050, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, Temp_int_Array_Index_Variable) == 0x000060, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, Temp_byte_Variable_4) == 0x000064, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, Temp_bool_Variable_2) == 0x000065, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, Temp_name_Variable) == 0x000068, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_Map_Find_Value) == 0x000078, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_Map_Find_ReturnValue) == 0x000080, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000088, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, K2Node_DynamicCast_AsData_Object) == 0x000090, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::K2Node_DynamicCast_AsData_Object' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_GetChildrenCount_ReturnValue) == 0x00009C, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_Map_Values_Values) == 0x0000A8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_IsValid_ReturnValue_2) == 0x0000B8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, K2Node_DynamicCast_AsData_Object_1) == 0x0000C8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::K2Node_DynamicCast_AsData_Object_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_Array_Length_ReturnValue) == 0x0000D4, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_GetChildrenCount_ReturnValue_1) == 0x0000DC, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, Temp_bool_Variable_3) == 0x0000E0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000E1, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_BooleanOR_ReturnValue) == 0x0000E2, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_GetChildrenCount_ReturnValue_2) == 0x0000E4, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_GetChildrenCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, K2Node_Select_Default) == 0x0000E9, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_GetChildrenCount_ReturnValue_3) == 0x0000EC, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_GetChildrenCount_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000F0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, K2Node_Select_Default_1) == 0x0000F1, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, K2Node_Select_Default_2) == 0x0000F8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, Temp_byte_Variable_5) == 0x000100, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000108, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics, K2Node_Select_Default_3) == 0x000110, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C_ParseCharacteristics::K2Node_Select_Default_3' has a wrong offset!");

}

