#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Squad_PlayerSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "OnlineSubsystemBlueprints_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Squad_PlayerSlot.UI_Menu_Squad_PlayerSlot_C
// 0x0050 (0x02D0 - 0x0280)
class UUI_Menu_Squad_PlayerSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Boost;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Invite;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Kick;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_IsLeader;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_UserIcon;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_UserDisplayName;                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Menu_Squad_C*                       UI_Squad;                                          // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_UserEntry_C*                        UserEntry;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_Squad_PlayerSlot_Button_Boost_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Squad_PlayerSlot_Button_Invite_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Squad_PlayerSlot_Button_Kick_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void ClearUser();
	void Construct();
	void ExecuteUbergraph_UI_Menu_Squad_PlayerSlot(int32 EntryPoint);
	class UWidget* Get_Button_Boost_ToolTipWidget_0();
	class UWidget* Get_Button_Kick_ToolTipWidget_0();
	void OnCallFailed_1F83148846FB88D87A25DA9D374E4887(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, ELeavePartyCompletionResult_ Result);
	void OnCallFailed_53C3B59B4135F67BDD8461BBA8B65407(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, const struct FUniqueNetIdRepl& MemberId, EPromoteMemberCompletionResult_ Result);
	void OnCallFailed_93FB9404410172EB228B94ABBFF55B60(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, const struct FUniqueNetIdRepl& MemberId, EKickMemberCompletionResult_ Result);
	void OnGetAvatar_Event();
	void OnKickPartyMemberComplete_93FB9404410172EB228B94ABBFF55B60(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, const struct FUniqueNetIdRepl& MemberId, EKickMemberCompletionResult_ Result);
	void OnLeavePartyComplete_1F83148846FB88D87A25DA9D374E4887(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, ELeavePartyCompletionResult_ Result);
	void OnPromotePartyMemberComplete_53C3B59B4135F67BDD8461BBA8B65407(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, const struct FUniqueNetIdRepl& MemberId, EPromoteMemberCompletionResult_ Result);
	void ParseUserData(const struct FUniqueNetIdRepl& UserId);
	void SearchUserEntry(const struct FUniqueNetIdRepl& UserId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Menu_Squad_PlayerSlot_C">();
	}
	static class UUI_Menu_Squad_PlayerSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Squad_PlayerSlot_C>();
	}
};
static_assert(alignof(UUI_Menu_Squad_PlayerSlot_C) == 0x000008, "Wrong alignment on UUI_Menu_Squad_PlayerSlot_C");
static_assert(sizeof(UUI_Menu_Squad_PlayerSlot_C) == 0x0002D0, "Wrong size on UUI_Menu_Squad_PlayerSlot_C");
static_assert(offsetof(UUI_Menu_Squad_PlayerSlot_C, UberGraphFrame) == 0x000280, "Member 'UUI_Menu_Squad_PlayerSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_PlayerSlot_C, Button_Boost) == 0x000288, "Member 'UUI_Menu_Squad_PlayerSlot_C::Button_Boost' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_PlayerSlot_C, Button_Invite) == 0x000290, "Member 'UUI_Menu_Squad_PlayerSlot_C::Button_Invite' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_PlayerSlot_C, Button_Kick) == 0x000298, "Member 'UUI_Menu_Squad_PlayerSlot_C::Button_Kick' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_PlayerSlot_C, Image_IsLeader) == 0x0002A0, "Member 'UUI_Menu_Squad_PlayerSlot_C::Image_IsLeader' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_PlayerSlot_C, Image_UserIcon) == 0x0002A8, "Member 'UUI_Menu_Squad_PlayerSlot_C::Image_UserIcon' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_PlayerSlot_C, TextBlock_UserDisplayName) == 0x0002B0, "Member 'UUI_Menu_Squad_PlayerSlot_C::TextBlock_UserDisplayName' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_PlayerSlot_C, WidgetSwitcher) == 0x0002B8, "Member 'UUI_Menu_Squad_PlayerSlot_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_PlayerSlot_C, UI_Squad) == 0x0002C0, "Member 'UUI_Menu_Squad_PlayerSlot_C::UI_Squad' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_PlayerSlot_C, UserEntry) == 0x0002C8, "Member 'UUI_Menu_Squad_PlayerSlot_C::UserEntry' has a wrong offset!");

}

