#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Squad_Friend

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "OnlineSubsystemBlueprints_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Squad_Friend.UI_Menu_Squad_Friend_C
// 0x0058 (0x02D8 - 0x0280)
class UUI_Menu_Squad_Friend_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Invite;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_IsInvited;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_UserIcon;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_UserDisplayName;                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_InviteStatus;                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_OnlineStatus;                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsLeader;                                          // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3413[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_UserEntry_C*                        UserEntry;                                         // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UOnlineFriendRef*                       FriendRef;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        InviteCooldown;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_Squad_Friend_Button_Invite_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_UI_Menu_Squad_Friend(int32 EntryPoint);
	void OnGetAvatar_Event();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnPartyExited_Event(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId);
	void OnPartyJoined_Event(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId);
	void OnPartyMemberExited_Event(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, const struct FUniqueNetIdRepl& MemberId, EMemberExitedReason_ Reason);
	void OnPartyMemberJoined_Event(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, const struct FUniqueNetIdRepl& MemberId);
	void OnPresenceUpdated_Event();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Menu_Squad_Friend_C">();
	}
	static class UUI_Menu_Squad_Friend_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Squad_Friend_C>();
	}
};
static_assert(alignof(UUI_Menu_Squad_Friend_C) == 0x000008, "Wrong alignment on UUI_Menu_Squad_Friend_C");
static_assert(sizeof(UUI_Menu_Squad_Friend_C) == 0x0002D8, "Wrong size on UUI_Menu_Squad_Friend_C");
static_assert(offsetof(UUI_Menu_Squad_Friend_C, UberGraphFrame) == 0x000280, "Member 'UUI_Menu_Squad_Friend_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_Friend_C, Button_Invite) == 0x000288, "Member 'UUI_Menu_Squad_Friend_C::Button_Invite' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_Friend_C, Image_IsInvited) == 0x000290, "Member 'UUI_Menu_Squad_Friend_C::Image_IsInvited' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_Friend_C, Image_UserIcon) == 0x000298, "Member 'UUI_Menu_Squad_Friend_C::Image_UserIcon' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_Friend_C, TextBlock_UserDisplayName) == 0x0002A0, "Member 'UUI_Menu_Squad_Friend_C::TextBlock_UserDisplayName' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_Friend_C, WidgetSwitcher_InviteStatus) == 0x0002A8, "Member 'UUI_Menu_Squad_Friend_C::WidgetSwitcher_InviteStatus' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_Friend_C, WidgetSwitcher_OnlineStatus) == 0x0002B0, "Member 'UUI_Menu_Squad_Friend_C::WidgetSwitcher_OnlineStatus' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_Friend_C, IsLeader) == 0x0002B8, "Member 'UUI_Menu_Squad_Friend_C::IsLeader' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_Friend_C, UserEntry) == 0x0002C0, "Member 'UUI_Menu_Squad_Friend_C::UserEntry' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_Friend_C, FriendRef) == 0x0002C8, "Member 'UUI_Menu_Squad_Friend_C::FriendRef' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Squad_Friend_C, InviteCooldown) == 0x0002D0, "Member 'UUI_Menu_Squad_Friend_C::InviteCooldown' has a wrong offset!");

}

