#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage

#include "Basic.hpp"

#include "SteamCore_structs.hpp"
#include "PlayFab_structs.hpp"
#include "SlateCore_structs.hpp"
#include "POLYGON_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage.UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C.ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage
// 0x0A18 (0x0A18 - 0x0000)
struct UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3348[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x0008(0x0040)()
	TDelegate<void(const struct FClientUpdateUserDataResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_SteamOverlayIsDisabled_C*      CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response_1;                     // 0x0080(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_9;                   // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful_1;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3349[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable_1;                            // 0x00D8(0x0040)()
	TDelegate<void(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUser*                                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FMicroTxnAuthorizationResponse& Data)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x0160(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_8;                   // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334A[0x6];                                     // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable_2;                            // 0x01B8(0x0040)()
	TDelegate<void(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x01F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_MicroTxnError_C*               CallFunc_Create_ReturnValue_1;                     // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0210(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334B[0x3];                                     // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334C[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_2;                            // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334D[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334E[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response_2;                     // 0x0258(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_10;                  // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful_2;                   // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334F[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_1;      // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_2;             // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3350[0x4];                                     // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x02F0(0x0010)(ConstParm, ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3351[0x7];                                     // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientWriteClientPlayerEventRequest   K2Node_MakeStruct_ClientWriteClientPlayerEventRequest; // 0x0318(0x0038)()
	struct FClientWriteEventResponse              K2Node_CustomEvent_result_3;                       // 0x0350(0x0018)()
	class UObject*                                K2Node_CustomEvent_customData_7;                   // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error_3;                        // 0x0370(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_6;                   // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3352[0x7];                                     // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientUpdateUserDataResult            K2Node_CustomEvent_result_2;                       // 0x03B8(0x0010)(NoDestructor)
	class UObject*                                K2Node_CustomEvent_customData_5;                   // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error_2;                        // 0x03D0(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_4;                   // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0420(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientUpdateUserDataRequest           K2Node_MakeStruct_ClientUpdateUserDataRequest;     // 0x0430(0x0030)()
	class UPlayFabClientAPI*                      CallFunc_UpdateUserData_ReturnValue;               // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3353[0x7];                                     // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1; // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3354[0x3];                                     // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0484(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x04C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x04D0(0x0018)()
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x04E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_MainMenu_Shop_Premium_Offers_BoosterBundle_C* K2Node_DynamicCast_AsUI_Main_Menu_Shop_Premium_Offers_Booster_Bundle; // 0x04F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3355[0x7];                                     // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0500(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3356[0x3];                                     // 0x0509(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlayEnabled_ReturnValue;             // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3357[0x7];                                     // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue_1;        // 0x0518(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptRequest       K2Node_MakeStruct_ClientExecuteCloudScriptRequest; // 0x0528(0x0030)()
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0558(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                      CallFunc_ExecuteCloudScript_ReturnValue;           // 0x0568(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3358[0x7];                                     // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSteamUILanguage_ReturnValue;           // 0x0578(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3359[0x7];                                     // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result_1;                       // 0x0590(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData_3;                   // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error_1;                        // 0x05F8(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x0630(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0638(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_2;             // 0x0648(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335A[0x3];                                     // 0x0659(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNumberField_ReturnValue_1;             // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FClientWriteEventResponse& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0664(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335B[0x4];                                     // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabError                          K2Node_MakeStruct_PlayFabError;                    // 0x0678(0x0038)()
	class UPlayFabClientAPI*                      CallFunc_WritePlayerEvent_ReturnValue;             // 0x06B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335C[0x7];                                     // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      Temp_struct_Variable_3;                            // 0x06C0(0x0040)()
	class UObject*                                Temp_object_Variable_3;                            // 0x0700(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMicroTxnAuthorizationResponse         K2Node_CustomEvent_Data;                           // 0x0708(0x0020)(ConstParm)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue_2;        // 0x0728(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335D[0x7];                                     // 0x0731(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__2_Object;     // 0x0738(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptRequest       K2Node_MakeStruct_ClientExecuteCloudScriptRequest_1; // 0x0740(0x0030)()
	class UPlayFabClientAPI*                      CallFunc_ExecuteCloudScript_ReturnValue_1;         // 0x0770(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335E[0x7];                                     // 0x0779(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result;                         // 0x0780(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x07E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x07E8(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x0820(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue_1;               // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335F[0x3];                                     // 0x0829(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNumberField_ReturnValue_2;             // 0x082C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response_3;                     // 0x0830(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_11;                  // 0x0870(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful_3;                   // 0x0878(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3360[0x3];                                     // 0x0879(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x087C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_MakeStruct_PlayFabError_1;                  // 0x0880(0x0038)()
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x08B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_PlayFabError;                   // 0x08C8(0x0038)(ConstParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0900(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0908(0x0018)()
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_2; // 0x0920(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3361[0x7];                                     // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0930(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0940(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3362[0x7];                                     // 0x0941(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0948(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0958(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0968(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0978(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0990(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x09A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x09B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3363[0x7];                                     // 0x09B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_StringToDouble_ReturnValue;          // 0x09C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x09C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x09D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3364[0x3];                                     // 0x09D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x09D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x09D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x09E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3365[0x3];                                     // 0x09E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x09E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x09E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3366[0x3];                                     // 0x09E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x09EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x09F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3367[0x7];                                     // 0x09F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x09F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast;       // 0x0A00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3368[0x4];                                     // 0x0A04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0A08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_1;                  // 0x0A10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage) == 0x000008, "Wrong alignment on UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage");
static_assert(sizeof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage) == 0x000A18, "Wrong size on UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, EntryPoint) == 0x000000, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, Temp_struct_Variable) == 0x000008, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_Create_ReturnValue) == 0x000068, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CreateDelegate_OutputDelegate_2) == 0x000070, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CustomEvent_response_1) == 0x000080, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CustomEvent_response_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CustomEvent_customData_9) == 0x0000C0, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CustomEvent_customData_9' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CustomEvent_successful_1) == 0x0000C8, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CustomEvent_successful_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, Temp_bool_Variable) == 0x0000C9, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, Temp_object_Variable) == 0x0000D0, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, Temp_struct_Variable_1) == 0x0000D8, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CreateDelegate_OutputDelegate_3) == 0x000118, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000128, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CreateDelegate_OutputDelegate_4) == 0x000130, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CreateDelegate_OutputDelegate_5) == 0x000140, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CreateDelegate_OutputDelegate_6) == 0x000150, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CustomEvent_response) == 0x000160, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CustomEvent_customData_8) == 0x0001A0, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CustomEvent_customData_8' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CustomEvent_successful) == 0x0001A8, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, Temp_bool_Variable_1) == 0x0001A9, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, Temp_object_Variable_1) == 0x0001B0, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, Temp_struct_Variable_2) == 0x0001B8, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001F8, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_Create_ReturnValue_1) == 0x000208, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CreateDelegate_OutputDelegate_8) == 0x000210, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, Temp_bool_True_if_break_was_hit_Variable) == 0x000220, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, Temp_int_Array_Index_Variable) == 0x000224, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_Not_PreBool_ReturnValue) == 0x000228, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, Temp_object_Variable_2) == 0x000230, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_GetPlayerController_ReturnValue) == 0x000238, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, Temp_bool_Variable_2) == 0x000240, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_DynamicCast_AsPG_Player_State_Menu) == 0x000248, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_DynamicCast_AsPG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_DynamicCast_bSuccess) == 0x000250, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CustomEvent_response_2) == 0x000258, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CustomEvent_response_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CustomEvent_customData_10) == 0x000298, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CustomEvent_customData_10' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CustomEvent_successful_2) == 0x0002A0, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CustomEvent_successful_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x0002A8, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_GetObjectField_ReturnValue) == 0x0002B0, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_GetPlayerCombinedInfo_ReturnValue_1) == 0x0002B8, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_GetPlayerCombinedInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_GetObjectField_ReturnValue_1) == 0x0002C0, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_GetObjectField_ReturnValue_2) == 0x0002C8, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_GetObjectField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_GetStringField_ReturnValue) == 0x0002D0, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_GetNumberField_ReturnValue) == 0x0002E0, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0002E8, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_MakeArray_Array) == 0x0002F0, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_GetPlayerController_ReturnValue_1) == 0x000300, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000308, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_DynamicCast_bSuccess_1) == 0x000310, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_MakeStruct_ClientWriteClientPlayerEventRequest) == 0x000318, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_MakeStruct_ClientWriteClientPlayerEventRequest' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CustomEvent_result_3) == 0x000350, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CustomEvent_result_3' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CustomEvent_customData_7) == 0x000368, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CustomEvent_customData_7' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CustomEvent_error_3) == 0x000370, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CustomEvent_error_3' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CustomEvent_customData_6) == 0x0003A8, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CustomEvent_customData_6' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, Temp_byte_Variable) == 0x0003B0, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CustomEvent_result_2) == 0x0003B8, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CustomEvent_result_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CustomEvent_customData_5) == 0x0003C8, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CustomEvent_customData_5' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CustomEvent_error_2) == 0x0003D0, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CustomEvent_error_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CustomEvent_customData_4) == 0x000408, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CustomEvent_customData_4' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_ConstructJsonObject_ReturnValue) == 0x000410, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000418, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_CreateDelegate_OutputDelegate_9) == 0x000420, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_MakeStruct_ClientUpdateUserDataRequest) == 0x000430, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_MakeStruct_ClientUpdateUserDataRequest' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_UpdateUserData_ReturnValue) == 0x000460, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_UpdateUserData_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_IsValid_ReturnValue) == 0x000468, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_GetPlayerController_ReturnValue_2) == 0x000470, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1) == 0x000478, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_DynamicCast_bSuccess_2) == 0x000480, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_Event_MyGeometry) == 0x000484, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, K2Node_Event_InDeltaTime) == 0x0004BC, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_GetAllChildren_ReturnValue) == 0x0004C0, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage, CallFunc_GetText_ReturnValue) == 0x0004D0, "Member 'UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_BoosterBundle_BuyPage::CallFunc_GetText_ReturnValue' has a wrong offset!");
