#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item

#include "Basic.hpp"

#include "POLYGON_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item.UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item.UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item.UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C.ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item
// 0x01D8 (0x01D8 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3674[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3675[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue_1;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3676[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue_1;       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3677[0x5];                                     // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3678[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x005C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_Entry_C* K2Node_DynamicCast_AsBP_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_Entry; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3679[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_367A[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_367B[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_2;             // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ConstParm, ReferenceParm)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGunModuleType                                CallFunc_GetModuleType_Module_Type;                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_367C[0x6];                                     // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ToLower_ReturnValue;                      // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EGunModuleType                                CallFunc_GetModuleType_Module_Type_1;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_367D[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C* CallFunc_GetSlotByModuleType_Slot;                 // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Gun_General;        // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_367E[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGunModuleType                                CallFunc_GetModuleType_Module_Type_2;              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_367F[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C* CallFunc_GetSlotByModuleType_Slot_1;               // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Gun_General_1;      // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3680[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_1;                           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_Current_ImplicitCast;  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_0_ImplicitCast;               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item) == 0x0001D8, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, EntryPoint) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_DynamicCast_AsPG_Player_State_Menu) == 0x000010, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_DynamicCast_AsPG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_GetScrollOffset_ReturnValue) == 0x00001C, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_GetScrollOffset_ReturnValue_1) == 0x000020, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_GetScrollOffset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, Temp_string_Variable) == 0x000028, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000038, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_GetScrollOffsetOfEnd_ReturnValue_1) == 0x00003C, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_GetScrollOffsetOfEnd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, Temp_real_Variable) == 0x000040, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000048, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000049, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x00004A, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000050, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, Temp_bool_Variable) == 0x000058, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_Event_MyGeometry) == 0x00005C, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_Event_InDeltaTime) == 0x000094, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_Event_ListItemObject) == 0x000098, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_DynamicCast_AsBP_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_Entry) == 0x0000A0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_DynamicCast_AsBP_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_Entry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, Temp_bool_IsClosed_Variable) == 0x0000A9, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_Event_bIsSelected) == 0x0000AA, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_Event_bIsExpanded) == 0x0000AB, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_Not_PreBool_ReturnValue) == 0x0000AC, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_GetPlayerController_ReturnValue) == 0x0000B0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x0000B8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000C8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000D0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0000D8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000E0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_IsValidClass_ReturnValue) == 0x0000E1, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_GetObjectField_ReturnValue) == 0x0000E8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_GetObjectField_ReturnValue_1) == 0x0000F0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_Select_Default) == 0x0000F8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_GetObjectField_ReturnValue_2) == 0x000108, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_GetObjectField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_MakeArray_Array) == 0x000110, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_ConstructJsonObject_ReturnValue) == 0x000120, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_IsValid_ReturnValue) == 0x000128, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_GetModuleType_Module_Type) == 0x000129, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_GetModuleType_Module_Type' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000130, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_ToLower_ReturnValue) == 0x000140, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_ToLower_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_GetModuleType_Module_Type_1) == 0x000150, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_GetModuleType_Module_Type_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_GetSlotByModuleType_Slot) == 0x000158, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_GetSlotByModuleType_Slot' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_ClassDynamicCast_AsItem_Gun_General) == 0x000160, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_ClassDynamicCast_AsItem_Gun_General' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_ClassDynamicCast_bSuccess) == 0x000168, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, Temp_real_Variable_1) == 0x000170, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_GetModuleType_Module_Type_2) == 0x000178, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_GetModuleType_Module_Type_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_GetSlotByModuleType_Slot_1) == 0x000180, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_GetSlotByModuleType_Slot_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_ClassDynamicCast_AsItem_Gun_General_1) == 0x000188, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_ClassDynamicCast_AsItem_Gun_General_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_ClassDynamicCast_bSuccess_1) == 0x000190, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_IsValidClass_ReturnValue_1) == 0x000191, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, Temp_bool_Variable_1) == 0x000192, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, Temp_bool_Has_Been_Initd_Variable) == 0x000193, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_Select_Default_1) == 0x000198, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x0001A0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_FInterpTo_Constant_Current_ImplicitCast) == 0x0001A8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_FInterpTo_Constant_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast) == 0x0001B0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, K2Node_Select_Option_0_ImplicitCast) == 0x0001B8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::K2Node_Select_Option_0_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x0001C0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0001C8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast) == 0x0001D0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item.UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_OnListItemObjectSet");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_OnListItemObjectSet) == 0x000008, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_OnListItemObjectSet");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item.UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C.ParseModuleInfo
// 0x0128 (0x0128 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo final
{
public:
	class UPlayFabJsonObject*                     L_ModulesDataContainerCustomData;                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3681[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3682[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_C* K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3683[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue;          // 0x0048(0x0010)(ReferenceParm)
	class UPlayFabJsonObject*                     CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3684[0x1];                                     // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Module_Skin;        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3685[0x2];                                     // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3686[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3687[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0098(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3688[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3689[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_2;             // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_3;             // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_4;             // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_1;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_368A[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_5;             // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_2;                   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_368B[0x6];                                     // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo) == 0x000128, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, L_ModulesDataContainerCustomData) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::L_ModulesDataContainerCustomData' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, Temp_int_Array_Index_Variable) == 0x000008, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, K2Node_DynamicCast_AsPG_Player_State_Menu) == 0x000018, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::K2Node_DynamicCast_AsPG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, CallFunc_GetOuterObject_ReturnValue) == 0x000028, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List) == 0x000030, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000040, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, CallFunc_GetObjectArrayField_ReturnValue) == 0x000048, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::CallFunc_GetObjectArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, CallFunc_Array_Get_Item) == 0x000058, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, CallFunc_GetStringField_ReturnValue) == 0x000060, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, CallFunc_Not_PreBool_ReturnValue) == 0x000074, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, CallFunc_IsValid_ReturnValue) == 0x000075, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, Temp_bool_True_if_break_was_hit_Variable) == 0x000076, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, K2Node_ClassDynamicCast_AsItem_Module_Skin) == 0x000078, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::K2Node_ClassDynamicCast_AsItem_Module_Skin' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, K2Node_ClassDynamicCast_bSuccess) == 0x000080, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, CallFunc_Not_PreBool_ReturnValue_1) == 0x000081, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000082, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000083, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000084, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo, CallFunc_BooleanOR_ReturnValue) == 0x000085, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_List_Item_C_ParseModuleInfo::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
