#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress.UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C
// 0x0028 (0x02A8 - 0x0280)
class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Back;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_TreeContainer;                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SoftLoadingScreen_C*                UI_SoftLoadingScreen;                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_C*  UI_Menu_Soldier_Weapon_Gun_Gunsmith;               // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Button_Back_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress(int32 EntryPoint);
	void OnUpdateGunData();
	void OnUpdatePlayerCombinedInfo_Event(const TArray<EModifiedData>& ModifiedData, const class FString& CustomString);
	void PreConstruct(bool IsDesignTime);
	void Reset();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C">();
	}
	static class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C>();
	}
};
static_assert(alignof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C) == 0x000008, "Wrong alignment on UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C");
static_assert(sizeof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C) == 0x0002A8, "Wrong size on UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C, UberGraphFrame) == 0x000280, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C, Button_Back) == 0x000288, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C, Overlay_TreeContainer) == 0x000290, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C::Overlay_TreeContainer' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C, UI_SoftLoadingScreen) == 0x000298, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C::UI_SoftLoadingScreen' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C, UI_Menu_Soldier_Weapon_Gun_Gunsmith) == 0x0002A0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C::UI_Menu_Soldier_Weapon_Gun_Gunsmith' has a wrong offset!");

}

