#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Tutorial

#include "Basic.hpp"

#include "POLYGON_structs.hpp"
#include "PlayFab_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_Menu_Tutorial.UI_Menu_Tutorial_C.AddRewardForView
// 0x0068 (0x0068 - 0x0000)
struct UI_Menu_Tutorial_C_AddRewardForView final
{
public:
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ConstParm, ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3835[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3836[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast;       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Tutorial_C_AddRewardForView) == 0x000008, "Wrong alignment on UI_Menu_Tutorial_C_AddRewardForView");
static_assert(sizeof(UI_Menu_Tutorial_C_AddRewardForView) == 0x000068, "Wrong size on UI_Menu_Tutorial_C_AddRewardForView");
static_assert(offsetof(UI_Menu_Tutorial_C_AddRewardForView, K2Node_MakeArray_Array) == 0x000000, "Member 'UI_Menu_Tutorial_C_AddRewardForView::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_AddRewardForView, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'UI_Menu_Tutorial_C_AddRewardForView::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_AddRewardForView, K2Node_DynamicCast_AsPG_Player_State_Menu) == 0x000018, "Member 'UI_Menu_Tutorial_C_AddRewardForView::K2Node_DynamicCast_AsPG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_AddRewardForView, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UI_Menu_Tutorial_C_AddRewardForView::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_AddRewardForView, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000028, "Member 'UI_Menu_Tutorial_C_AddRewardForView::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_AddRewardForView, CallFunc_GetObjectField_ReturnValue) == 0x000030, "Member 'UI_Menu_Tutorial_C_AddRewardForView::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_AddRewardForView, CallFunc_GetPlayerCombinedInfo_ReturnValue_1) == 0x000038, "Member 'UI_Menu_Tutorial_C_AddRewardForView::CallFunc_GetPlayerCombinedInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_AddRewardForView, CallFunc_GetNumberField_ReturnValue) == 0x000040, "Member 'UI_Menu_Tutorial_C_AddRewardForView::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_AddRewardForView, CallFunc_GetObjectField_ReturnValue_1) == 0x000048, "Member 'UI_Menu_Tutorial_C_AddRewardForView::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_AddRewardForView, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'UI_Menu_Tutorial_C_AddRewardForView::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_AddRewardForView, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000058, "Member 'UI_Menu_Tutorial_C_AddRewardForView::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_AddRewardForView, CallFunc_SetNumberField_Number_ImplicitCast) == 0x000060, "Member 'UI_Menu_Tutorial_C_AddRewardForView::CallFunc_SetNumberField_Number_ImplicitCast' has a wrong offset!");

// Function UI_Menu_Tutorial.UI_Menu_Tutorial_C.ExecuteUbergraph_UI_Menu_Tutorial
// 0x0398 (0x0398 - 0x0000)
struct UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3837[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response_1;                     // 0x0028(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_3;                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful_1;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3838[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x0080(0x0040)()
	TDelegate<void(const struct FClientWriteEventResponse& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x00F0(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3839[0x3];                                     // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x013C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_383A[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable_1;                            // 0x0158(0x0040)()
	class UUI_Menu_Tutorial_Close_C*              CallFunc_Create_ReturnValue;                       // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Tutorial_Close_C*              K2Node_LowEntry_LocalVariable_Value__Object;       // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x01C8(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_383B[0x4];                                     // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenSource_ReturnValue;                   // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_383C[0x7];                                     // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaSoundComponent*                   CallFunc_AddComponentByClass_ReturnValue;          // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_383D[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_383E[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaSoundComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_383F[0x6];                                     // 0x0252(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3840[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientWriteClientPlayerEventRequest   K2Node_MakeStruct_ClientWriteClientPlayerEventRequest; // 0x0278(0x0038)()
	class UPlayFabClientAPI*                      CallFunc_WritePlayerEvent_ReturnValue;             // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientWriteEventResponse              K2Node_CustomEvent_result;                         // 0x02B8(0x0018)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3841[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x02E0(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientWriteClientPlayerEventRequest   K2Node_MakeStruct_ClientWriteClientPlayerEventRequest_1; // 0x0320(0x0038)()
	double                                        Temp_real_Variable_1;                              // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                      CallFunc_WritePlayerEvent_ReturnValue_1;           // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Pause_ReturnValue;                        // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3842[0x5];                                     // 0x037B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Constant_Current_ImplicitCast;  // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast; // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial) == 0x000008, "Wrong alignment on UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial");
static_assert(sizeof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial) == 0x000398, "Wrong size on UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, EntryPoint) == 0x000000, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CustomEvent_response_1) == 0x000028, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CustomEvent_response_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CustomEvent_customData_3) == 0x000068, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CustomEvent_customData_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CustomEvent_successful_1) == 0x000070, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CustomEvent_successful_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, Temp_bool_Variable) == 0x000071, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, Temp_object_Variable) == 0x000078, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, Temp_struct_Variable) == 0x000080, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000C0, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D0, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000E0, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CustomEvent_response) == 0x0000F0, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CustomEvent_customData_2) == 0x000130, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CustomEvent_customData_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CustomEvent_successful) == 0x000138, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CreateDelegate_OutputDelegate_5) == 0x00013C, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, Temp_bool_Variable_1) == 0x00014C, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, Temp_object_Variable_1) == 0x000150, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, Temp_struct_Variable_1) == 0x000158, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_Create_ReturnValue) == 0x000198, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_LowEntry_LocalVariable_Value__Object) == 0x0001A0, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001A8, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001B8, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_Event_MyGeometry) == 0x0001C8, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_Event_InDeltaTime) == 0x000200, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_GetPlayerController_ReturnValue) == 0x000208, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_OpenSource_ReturnValue) == 0x000210, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_OpenSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_AddComponentByClass_ReturnValue) == 0x000218, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_GetPlayerController_ReturnValue_1) == 0x000220, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000228, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_DynamicCast_bSuccess) == 0x000230, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_GetPlayerController_ReturnValue_2) == 0x000238, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000240, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_GetComponentByClass_ReturnValue) == 0x000248, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_Not_PreBool_ReturnValue) == 0x000250, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_BooleanAND_ReturnValue) == 0x000251, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, Temp_real_Variable) == 0x000258, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000260, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_PlayAnimationForward_ReturnValue) == 0x000268, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, Temp_bool_Variable_2) == 0x000270, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_MakeStruct_ClientWriteClientPlayerEventRequest) == 0x000278, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_MakeStruct_ClientWriteClientPlayerEventRequest' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_WritePlayerEvent_ReturnValue) == 0x0002B0, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_WritePlayerEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CustomEvent_result) == 0x0002B8, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CustomEvent_result' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CustomEvent_customData_1) == 0x0002D0, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CustomEvent_customData_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_IsValid_ReturnValue) == 0x0002D8, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CustomEvent_error) == 0x0002E0, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CustomEvent_error' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_CustomEvent_customData) == 0x000318, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_CustomEvent_customData' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_MakeStruct_ClientWriteClientPlayerEventRequest_1) == 0x000320, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_MakeStruct_ClientWriteClientPlayerEventRequest_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, Temp_real_Variable_1) == 0x000358, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_WritePlayerEvent_ReturnValue_1) == 0x000360, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_WritePlayerEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, K2Node_Select_Default) == 0x000368, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000370, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_IsValid_ReturnValue_1) == 0x000378, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_Pause_ReturnValue) == 0x000379, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_Pause_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_Play_ReturnValue) == 0x00037A, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_FInterpTo_Constant_Current_ImplicitCast) == 0x000380, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_FInterpTo_Constant_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000388, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial, CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast) == 0x000390, "Member 'UI_Menu_Tutorial_C_ExecuteUbergraph_UI_Menu_Tutorial::CallFunc_SetVolumeMultiplier_NewVolumeMultiplier_ImplicitCast' has a wrong offset!");

// Function UI_Menu_Tutorial.UI_Menu_Tutorial_C.OnPlayFabResponse_279C81A643E72D1B08D5EAA62AF932CF
// 0x0050 (0x0050 - 0x0000)
struct UI_Menu_Tutorial_C_OnPlayFabResponse_279C81A643E72D1B08D5EAA62AF932CF final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Tutorial_C_OnPlayFabResponse_279C81A643E72D1B08D5EAA62AF932CF) == 0x000008, "Wrong alignment on UI_Menu_Tutorial_C_OnPlayFabResponse_279C81A643E72D1B08D5EAA62AF932CF");
static_assert(sizeof(UI_Menu_Tutorial_C_OnPlayFabResponse_279C81A643E72D1B08D5EAA62AF932CF) == 0x000050, "Wrong size on UI_Menu_Tutorial_C_OnPlayFabResponse_279C81A643E72D1B08D5EAA62AF932CF");
static_assert(offsetof(UI_Menu_Tutorial_C_OnPlayFabResponse_279C81A643E72D1B08D5EAA62AF932CF, Response) == 0x000000, "Member 'UI_Menu_Tutorial_C_OnPlayFabResponse_279C81A643E72D1B08D5EAA62AF932CF::Response' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_OnPlayFabResponse_279C81A643E72D1B08D5EAA62AF932CF, CustomData) == 0x000040, "Member 'UI_Menu_Tutorial_C_OnPlayFabResponse_279C81A643E72D1B08D5EAA62AF932CF::CustomData' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_OnPlayFabResponse_279C81A643E72D1B08D5EAA62AF932CF, Successful) == 0x000048, "Member 'UI_Menu_Tutorial_C_OnPlayFabResponse_279C81A643E72D1B08D5EAA62AF932CF::Successful' has a wrong offset!");

// Function UI_Menu_Tutorial.UI_Menu_Tutorial_C.OnPlayFabResponse_CF947AC8424EFB0C9C68F2ABAE0E2B42
// 0x0050 (0x0050 - 0x0000)
struct UI_Menu_Tutorial_C_OnPlayFabResponse_CF947AC8424EFB0C9C68F2ABAE0E2B42 final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Tutorial_C_OnPlayFabResponse_CF947AC8424EFB0C9C68F2ABAE0E2B42) == 0x000008, "Wrong alignment on UI_Menu_Tutorial_C_OnPlayFabResponse_CF947AC8424EFB0C9C68F2ABAE0E2B42");
static_assert(sizeof(UI_Menu_Tutorial_C_OnPlayFabResponse_CF947AC8424EFB0C9C68F2ABAE0E2B42) == 0x000050, "Wrong size on UI_Menu_Tutorial_C_OnPlayFabResponse_CF947AC8424EFB0C9C68F2ABAE0E2B42");
static_assert(offsetof(UI_Menu_Tutorial_C_OnPlayFabResponse_CF947AC8424EFB0C9C68F2ABAE0E2B42, Response) == 0x000000, "Member 'UI_Menu_Tutorial_C_OnPlayFabResponse_CF947AC8424EFB0C9C68F2ABAE0E2B42::Response' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_OnPlayFabResponse_CF947AC8424EFB0C9C68F2ABAE0E2B42, CustomData) == 0x000040, "Member 'UI_Menu_Tutorial_C_OnPlayFabResponse_CF947AC8424EFB0C9C68F2ABAE0E2B42::CustomData' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_OnPlayFabResponse_CF947AC8424EFB0C9C68F2ABAE0E2B42, Successful) == 0x000048, "Member 'UI_Menu_Tutorial_C_OnPlayFabResponse_CF947AC8424EFB0C9C68F2ABAE0E2B42::Successful' has a wrong offset!");

// Function UI_Menu_Tutorial.UI_Menu_Tutorial_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_Menu_Tutorial_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Tutorial_C_Tick) == 0x000004, "Wrong alignment on UI_Menu_Tutorial_C_Tick");
static_assert(sizeof(UI_Menu_Tutorial_C_Tick) == 0x00003C, "Wrong size on UI_Menu_Tutorial_C_Tick");
static_assert(offsetof(UI_Menu_Tutorial_C_Tick, MyGeometry) == 0x000000, "Member 'UI_Menu_Tutorial_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_Menu_Tutorial_C_Tick::InDeltaTime' has a wrong offset!");

// Function UI_Menu_Tutorial.UI_Menu_Tutorial_C.WritePlayerEvent_Failure
// 0x0040 (0x0040 - 0x0000)
struct UI_Menu_Tutorial_C_WritePlayerEvent_Failure final
{
public:
	struct FPlayFabError                          Error;                                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Tutorial_C_WritePlayerEvent_Failure) == 0x000008, "Wrong alignment on UI_Menu_Tutorial_C_WritePlayerEvent_Failure");
static_assert(sizeof(UI_Menu_Tutorial_C_WritePlayerEvent_Failure) == 0x000040, "Wrong size on UI_Menu_Tutorial_C_WritePlayerEvent_Failure");
static_assert(offsetof(UI_Menu_Tutorial_C_WritePlayerEvent_Failure, Error) == 0x000000, "Member 'UI_Menu_Tutorial_C_WritePlayerEvent_Failure::Error' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_WritePlayerEvent_Failure, CustomData) == 0x000038, "Member 'UI_Menu_Tutorial_C_WritePlayerEvent_Failure::CustomData' has a wrong offset!");

// Function UI_Menu_Tutorial.UI_Menu_Tutorial_C.WritePlayerEvent_Success
// 0x0020 (0x0020 - 0x0000)
struct UI_Menu_Tutorial_C_WritePlayerEvent_Success final
{
public:
	struct FClientWriteEventResponse              Result;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Tutorial_C_WritePlayerEvent_Success) == 0x000008, "Wrong alignment on UI_Menu_Tutorial_C_WritePlayerEvent_Success");
static_assert(sizeof(UI_Menu_Tutorial_C_WritePlayerEvent_Success) == 0x000020, "Wrong size on UI_Menu_Tutorial_C_WritePlayerEvent_Success");
static_assert(offsetof(UI_Menu_Tutorial_C_WritePlayerEvent_Success, Result) == 0x000000, "Member 'UI_Menu_Tutorial_C_WritePlayerEvent_Success::Result' has a wrong offset!");
static_assert(offsetof(UI_Menu_Tutorial_C_WritePlayerEvent_Success, CustomData) == 0x000018, "Member 'UI_Menu_Tutorial_C_WritePlayerEvent_Success::CustomData' has a wrong offset!");

}

