#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_GeneralMenuScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_GeneralMenuScreen.UI_Menu_GeneralMenuScreen_C
// 0x0110 (0x0390 - 0x0280)
class UUI_Menu_GeneralMenuScreen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BuyPremiumHovered;                                 // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Progress;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Settings;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Header;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LevelIcon;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LevelProgress;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lines;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_Header;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Level;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_BattlePass_C*                       UI_BattlePass;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Line_C*                      UI_Button_BattlePass;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Line_C*                      UI_Button_Home;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Line_C*                      UI_Button_Multiplayer;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Line_C*                      UI_Button_Shop;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Line_C*                      UI_Button_Soldier;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Counter_C*                          UI_Counter_Coin;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Counter_C*                          UI_Counter_PremiumCoin;                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_GameVersion_C*                      UI_GameVersion;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_LoginScreen_C*                      UI_LoginScreen;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_HomeScreen_C*                       UI_Menu_HomeScreen;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Multiplayer_C*                      UI_Menu_Multiplayer;                               // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Shop_C*                             UI_Menu_Shop;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UU_Menu_Soldier_C*                      UI_Menu_Soldier;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Options_C*                          UI_Options;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_PopUpMenu_C*                        UI_PopUpMenu;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Main;                               // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Menu;                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Menu_C*              PlayerState;                                       // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>             Regions;                                           // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnUpdatePingOfRegions;                             // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         NewVar;                                            // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_Progress_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Settings_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Button_CreateServer_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature(class UUI_Button_Line_C* Button);
	void BndEvt__UI_Button_ServerSearch_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature(class UUI_Button_Line_C* Button);
	void BndEvt__UI_Button_Shop_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature(class UUI_Button_Line_C* Button);
	void BndEvt__UI_Button_Soldier_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature(class UUI_Button_Line_C* Button);
	void BndEvt__UI_Counter_PremiumCoin_K2Node_ComponentBoundEvent_9_OnClickDelegate__DelegateSignature(class UUI_Counter_C* Counter);
	void BndEvt__UI_GeneralMenuScreen_UI_Counter_Coin_K2Node_ComponentBoundEvent_8_OnClickDelegate__DelegateSignature(class UUI_Counter_C* Counter);
	void BndEvt__UI_Menu_GeneralMenuScreen_UI_Button_BattlePass_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature(class UUI_Button_Line_C* Button);
	void BndEvt__UI_Options_K2Node_ComponentBoundEvent_7_ClickBackDelegate__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_Menu_GeneralMenuScreen(int32 EntryPoint);
	void GetTime_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void GetTime_Success(const struct FClientGetTimeResult& Result, class UObject* CustomData);
	void ListQoSServers_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void ListQoSServers_Success(const struct FMultiplayerListQosServersForTitleResponse& Result, class UObject* CustomData);
	void OnPlayFabResponse_CD96840840F6BDC429744386EADF9989(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void OnPlayFabResponse_EEAC2C894C8FF45B97AF2E8BBAB9F58E(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void OnSetPlayerId_Event();
	void OnSucceed_00DA80004521B2E9443A3BB00FD71E8D();
	void OnSucceed_0EF931404E41431044ED4280D2E40D0C();
	void OnSucceed_0FCC1976414D74186E4E89BDC8765DCE();
	void OnSucceed_537890494AA4404E9B27D19198E61A0D();
	void OnSucceed_9F51216140A8CFB9D900AA890B100915();
	void OnSucceed_C68D4C074C7D58E2089838A390E6D5A6();
	void OnSucceed_D60BB62342CAE2C50B2B7F84D4EF71C1();
	void OnUpdatePingOfRegions__DelegateSignature();
	void OnUpdatePlayerCombinedInfo_Event(const TArray<EModifiedData>& ModifiedData, const class FString& CustomString);
	void ParsePlayerInventory();
	void ParsePlayerProgress();
	void PreConstruct(bool IsDesignTime);
	void RequestRegionPing();
	void RequestWriteReview();
	void ShowChristmasEvent();
	void ShowTutorial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Menu_GeneralMenuScreen_C">();
	}
	static class UUI_Menu_GeneralMenuScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_GeneralMenuScreen_C>();
	}
};
static_assert(alignof(UUI_Menu_GeneralMenuScreen_C) == 0x000008, "Wrong alignment on UUI_Menu_GeneralMenuScreen_C");
static_assert(sizeof(UUI_Menu_GeneralMenuScreen_C) == 0x000390, "Wrong size on UUI_Menu_GeneralMenuScreen_C");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, UberGraphFrame) == 0x000280, "Member 'UUI_Menu_GeneralMenuScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, BuyPremiumHovered) == 0x000288, "Member 'UUI_Menu_GeneralMenuScreen_C::BuyPremiumHovered' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, Button_Progress) == 0x000290, "Member 'UUI_Menu_GeneralMenuScreen_C::Button_Progress' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, Button_Settings) == 0x000298, "Member 'UUI_Menu_GeneralMenuScreen_C::Button_Settings' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, HorizontalBox_Header) == 0x0002A0, "Member 'UUI_Menu_GeneralMenuScreen_C::HorizontalBox_Header' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, Image_LevelIcon) == 0x0002A8, "Member 'UUI_Menu_GeneralMenuScreen_C::Image_LevelIcon' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, Image_LevelProgress) == 0x0002B0, "Member 'UUI_Menu_GeneralMenuScreen_C::Image_LevelProgress' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, Lines) == 0x0002B8, "Member 'UUI_Menu_GeneralMenuScreen_C::Lines' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, ScaleBox_Header) == 0x0002C0, "Member 'UUI_Menu_GeneralMenuScreen_C::ScaleBox_Header' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, TextBlock_Level) == 0x0002C8, "Member 'UUI_Menu_GeneralMenuScreen_C::TextBlock_Level' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, UI_BattlePass) == 0x0002D0, "Member 'UUI_Menu_GeneralMenuScreen_C::UI_BattlePass' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, UI_Button_BattlePass) == 0x0002D8, "Member 'UUI_Menu_GeneralMenuScreen_C::UI_Button_BattlePass' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, UI_Button_Home) == 0x0002E0, "Member 'UUI_Menu_GeneralMenuScreen_C::UI_Button_Home' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, UI_Button_Multiplayer) == 0x0002E8, "Member 'UUI_Menu_GeneralMenuScreen_C::UI_Button_Multiplayer' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, UI_Button_Shop) == 0x0002F0, "Member 'UUI_Menu_GeneralMenuScreen_C::UI_Button_Shop' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, UI_Button_Soldier) == 0x0002F8, "Member 'UUI_Menu_GeneralMenuScreen_C::UI_Button_Soldier' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, UI_Counter_Coin) == 0x000300, "Member 'UUI_Menu_GeneralMenuScreen_C::UI_Counter_Coin' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, UI_Counter_PremiumCoin) == 0x000308, "Member 'UUI_Menu_GeneralMenuScreen_C::UI_Counter_PremiumCoin' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, UI_GameVersion) == 0x000310, "Member 'UUI_Menu_GeneralMenuScreen_C::UI_GameVersion' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, UI_LoginScreen) == 0x000318, "Member 'UUI_Menu_GeneralMenuScreen_C::UI_LoginScreen' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, UI_Menu_HomeScreen) == 0x000320, "Member 'UUI_Menu_GeneralMenuScreen_C::UI_Menu_HomeScreen' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, UI_Menu_Multiplayer) == 0x000328, "Member 'UUI_Menu_GeneralMenuScreen_C::UI_Menu_Multiplayer' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, UI_Menu_Shop) == 0x000330, "Member 'UUI_Menu_GeneralMenuScreen_C::UI_Menu_Shop' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, UI_Menu_Soldier) == 0x000338, "Member 'UUI_Menu_GeneralMenuScreen_C::UI_Menu_Soldier' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, UI_Options) == 0x000340, "Member 'UUI_Menu_GeneralMenuScreen_C::UI_Options' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, UI_PopUpMenu) == 0x000348, "Member 'UUI_Menu_GeneralMenuScreen_C::UI_PopUpMenu' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, WidgetSwitcher_Main) == 0x000350, "Member 'UUI_Menu_GeneralMenuScreen_C::WidgetSwitcher_Main' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, WidgetSwitcher_Menu) == 0x000358, "Member 'UUI_Menu_GeneralMenuScreen_C::WidgetSwitcher_Menu' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, PlayerState) == 0x000360, "Member 'UUI_Menu_GeneralMenuScreen_C::PlayerState' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, Regions) == 0x000368, "Member 'UUI_Menu_GeneralMenuScreen_C::Regions' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, OnUpdatePingOfRegions) == 0x000378, "Member 'UUI_Menu_GeneralMenuScreen_C::OnUpdatePingOfRegions' has a wrong offset!");
static_assert(offsetof(UUI_Menu_GeneralMenuScreen_C, NewVar) == 0x000388, "Member 'UUI_Menu_GeneralMenuScreen_C::NewVar' has a wrong offset!");

}

