#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Squad

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OnlineSubsystemBlueprints_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_Menu_Squad.UI_Menu_Squad_C.ExecuteUbergraph_UI_Menu_Squad
// 0x09A8 (0x09A8 - 0x0000)
struct UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3455[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineIdentitySubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlineFriendsSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 LocalUserNum, bool bWasSuccessful, const struct FUniqueNetIdRepl& UserId, const class FString& Error)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlineFriendsSubsystemReadFriendsList* CallFunc_ReadFriendsList_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3456[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 LocalUserNum, bool bWasSuccessful, const class FString& ListName, const class FString& ErrorStr)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LocalUserNum_2;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWasSuccessful_2;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3457[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ListName_1;                     // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ErrorStr_1;                     // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LocalUserNum_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWasSuccessful_1;               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3458[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ListName;                       // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ErrorStr;                       // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(int32 LocalUserNum, bool bWasSuccessful, const class FString& ListName, const class FString& ErrorStr)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3459[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_LocalUserId_10;                 // 0x00D8(0x0030)(HasGetValueTypeHash)
	class UPartyId*                               K2Node_CustomEvent_PartyId_9;                      // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_RecipientId_1;                  // 0x0110(0x0030)(HasGetValueTypeHash)
	ESendPartyInvitationCompletionResult_         K2Node_CustomEvent_result_3;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345A[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, const struct FUniqueNetIdRepl& RecipientId, ESendPartyInvitationCompletionResult_ Result)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0144(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345B[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_LocalUserId_9;                  // 0x0158(0x0030)(HasGetValueTypeHash)
	class UPartyId*                               K2Node_CustomEvent_PartyId_8;                      // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_RecipientId;                    // 0x0190(0x0030)(HasGetValueTypeHash)
	ESendPartyInvitationCompletionResult_         K2Node_CustomEvent_result_2;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345C[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, const struct FUniqueNetIdRepl& RecipientId, ESendPartyInvitationCompletionResult_ Result)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x01C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESendPartyInvitationCompletionResult_         Temp_byte_Variable;                                // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345D[0x3];                                     // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       Temp_struct_Variable;                              // 0x01D8(0x0030)(HasGetValueTypeHash)
	class UPartyId*                               Temp_object_Variable;                              // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       Temp_struct_Variable_1;                            // 0x0210(0x0030)(HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_LocalUserId_8;                  // 0x0240(0x0030)(HasGetValueTypeHash)
	class UPartyId*                               K2Node_CustomEvent_PartyId_7;                      // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECreatePartyCompletionResult_                 K2Node_CustomEvent_result_1;                       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345E[0x3];                                     // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, ECreatePartyCompletionResult_ Result)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x027C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345F[0x4];                                     // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_LocalUserId_7;                  // 0x0290(0x0030)(HasGetValueTypeHash)
	class UPartyId*                               K2Node_CustomEvent_PartyId_6;                      // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECreatePartyCompletionResult_                 K2Node_CustomEvent_result;                         // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3460[0x3];                                     // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, ECreatePartyCompletionResult_ Result)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x02CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECreatePartyCompletionResult_                 Temp_byte_Variable_1;                              // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3461[0x3];                                     // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPartyId*                               Temp_object_Variable_1;                            // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       Temp_struct_Variable_2;                            // 0x02E8(0x0030)(HasGetValueTypeHash)
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlineIdentitySubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EOnlineLoginStatus                            CallFunc_GetLoginStatus_ReturnValue;               // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x0333(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_3;                              // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3462[0x3];                                     // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0343(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3463[0x3];                                     // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, const struct FUniqueNetIdRepl& NewLeaderId)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0348(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3464[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_LocalUserId_6;                  // 0x0360(0x0030)(HasGetValueTypeHash)
	class UPartyId*                               K2Node_CustomEvent_PartyId_5;                      // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_MemberId_1;                     // 0x0398(0x0030)(HasGetValueTypeHash)
	TDelegate<void(const struct FUniqueNetIdRepl& LocalUserId)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x03C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_LocalUserId_5;                  // 0x03D8(0x0030)(HasGetValueTypeHash)
	class UPartyId*                               K2Node_CustomEvent_PartyId_4;                      // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_NewLeaderId;                    // 0x0410(0x0030)(HasGetValueTypeHash)
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_LocalUserId_4;                  // 0x0448(0x0030)(HasGetValueTypeHash)
	class UPartyId*                               K2Node_CustomEvent_PartyId_3;                      // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_MemberId;                       // 0x0480(0x0030)(HasGetValueTypeHash)
	EMemberExitedReason_                          K2Node_CustomEvent_Reason;                         // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3465[0x3];                                     // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, class FName Namespace, class UReadablePartyData* PartyData)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x04B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3466[0x4];                                     // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_8;   // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_LocalUserId_3;                  // 0x04D0(0x0030)(HasGetValueTypeHash)
	class UPartyId*                               K2Node_CustomEvent_PartyId_2;                      // 0x0500(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0508(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_9;   // 0x0518(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetControllerUniqueNetId_ReturnValue;     // 0x0528(0x0030)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0558(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetControllerUniqueNetId_ReturnValue_1;   // 0x0560(0x0030)(HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       Temp_struct_Variable_3;                            // 0x0590(0x0030)(HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_LocalUserId_2;                  // 0x05C0(0x0030)(HasGetValueTypeHash)
	class UPartyId*                               K2Node_CustomEvent_PartyId_1;                      // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPartyId*                               Temp_object_Variable_2;                            // 0x05F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ELeavePartyCompletionResult_                  Temp_byte_Variable_4;                              // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3467[0x7];                                     // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_LocalUserId_1;                  // 0x0608(0x0030)(HasGetValueTypeHash)
	class UPartyId*                               K2Node_CustomEvent_PartyId;                        // 0x0638(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Namespace;                      // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UReadablePartyData*                     K2Node_CustomEvent_PartyData;                      // 0x0648(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0650(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_LocalUserId_11;                 // 0x0658(0x0030)(HasGetValueTypeHash)
	class UPartyId*                               K2Node_CustomEvent_PartyId_10;                     // 0x0688(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ELeavePartyCompletionResult_                  K2Node_CustomEvent_result_4;                       // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3468[0x7];                                     // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetControllerUniqueNetId_ReturnValue_2;   // 0x0698(0x0030)(HasGetValueTypeHash)
	TArray<class UPartyId*>                       CallFunc_GetJoinedParties_OutPartyIdArray;         // 0x06C8(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetJoinedParties_ReturnValue;             // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3469[0x7];                                     // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPartyId*                               CallFunc_Array_Get_Item;                           // 0x06E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_PartyId_ReturnValue;              // 0x06E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x06EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x06EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_346A[0x4];                                     // 0x06EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_LocalUserId;                    // 0x06F0(0x0030)(HasGetValueTypeHash)
	TDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, ELeavePartyCompletionResult_ Result)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0720(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LocalUserNum;                   // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWasSuccessful;                 // 0x0734(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_346B[0x3];                                     // 0x0735(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_UserId;                         // 0x0738(0x0030)(HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_error;                          // 0x0768(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_10;  // 0x0778(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_LocalUserId_12;                 // 0x0780(0x0030)(HasGetValueTypeHash)
	class UPartyId*                               K2Node_CustomEvent_PartyId_11;                     // 0x07B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ELeavePartyCompletionResult_                  K2Node_CustomEvent_result_5;                       // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_346C[0x7];                                     // 0x07B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Menu_Squad_Friend_C*                K2Node_CustomEvent_Friend;                         // 0x07C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, const struct FUniqueNetIdRepl& MemberId)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x07C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x07D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetControllerUniqueNetId_ReturnValue_3;   // 0x07E0(0x0030)(HasGetValueTypeHash)
	TDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, ELeavePartyCompletionResult_ Result)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x0810(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0820(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOnlinePartyConfiguration              K2Node_MakeStruct_OnlinePartyConfiguration;        // 0x0828(0x0040)()
	struct FUniqueNetIdRepl                       CallFunc_GetControllerUniqueNetId_ReturnValue_4;   // 0x0868(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_PartyId_ReturnValue_1;            // 0x0899(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x089A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_346D[0x5];                                     // 0x089B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x08A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x08A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetControllerUniqueNetId_ReturnValue_5;   // 0x08B0(0x0030)(HasGetValueTypeHash)
	int64                                         CallFunc_GetPartyMemberCount_ReturnValue;          // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x08E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_Int64Int64_ReturnValue;              // 0x08F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x08F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x08F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_346E[0x1];                                     // 0x08F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x08F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x08F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_346F[0x7];                                     // 0x08F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_11;  // 0x0900(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0908(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3470[0x7];                                     // 0x0909(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlinePartySubsystemSendInvitation*    CallFunc_SendInvitation_ReturnValue;               // 0x0910(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3471[0x7];                                     // 0x0919(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_12;  // 0x0920(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_13;  // 0x0928(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlinePartySubsystemLeaveParty*        CallFunc_LeaveParty_ReturnValue;                   // 0x0930(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBlueprintPartyMember*>          CallFunc_GetPartyMembers_OutPartyMembersArray;     // 0x0938(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetPartyMembers_ReturnValue;              // 0x0948(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3472[0x3];                                     // 0x0949(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x094C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0950(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0951(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3473[0x2];                                     // 0x0952(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x0954(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3474[0x4];                                     // 0x0964(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_14;  // 0x0968(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_PartyId_ReturnValue_2;            // 0x0970(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0971(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0972(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3475[0x1];                                     // 0x0973(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, const struct FUniqueNetIdRepl& MemberId, EMemberExitedReason_ Reason)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x0974(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0984(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3476[0x3];                                     // 0x0985(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_15;  // 0x0988(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_GetPrimaryPartyType_ReturnValue;          // 0x0990(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOnlinePartySubsystemCreateParty*       CallFunc_CreateParty_ReturnValue;                  // 0x0998(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x09A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x09A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_PartyId_ReturnValue_3;            // 0x09A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x09A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad) == 0x000008, "Wrong alignment on UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad");
static_assert(sizeof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad) == 0x0009A8, "Wrong size on UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, EntryPoint) == 0x000000, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000010, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_ReadFriendsList_ReturnValue) == 0x000028, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_ReadFriendsList_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_LocalUserNum_2) == 0x000044, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_LocalUserNum_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_bWasSuccessful_2) == 0x000048, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_bWasSuccessful_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_ListName_1) == 0x000050, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_ListName_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_ErrorStr_1) == 0x000060, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_ErrorStr_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_LocalUserNum_1) == 0x000070, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_LocalUserNum_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_bWasSuccessful_1) == 0x000074, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_bWasSuccessful_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_ListName) == 0x000078, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_ListName' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_ErrorStr) == 0x000088, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_ErrorStr' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CreateDelegate_OutputDelegate_2) == 0x000098, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_string_Variable) == 0x0000A8, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_string_Variable_1) == 0x0000B8, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_bool_Variable) == 0x0000C8, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_int_Variable) == 0x0000CC, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0000D0, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_LocalUserId_10) == 0x0000D8, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_LocalUserId_10' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_PartyId_9) == 0x000108, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_PartyId_9' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_RecipientId_1) == 0x000110, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_RecipientId_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_result_3) == 0x000140, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_result_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CreateDelegate_OutputDelegate_3) == 0x000144, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_LocalUserId_9) == 0x000158, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_LocalUserId_9' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_PartyId_8) == 0x000188, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_PartyId_8' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_RecipientId) == 0x000190, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_RecipientId' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_result_2) == 0x0001C0, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_result_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001C4, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_byte_Variable) == 0x0001D4, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_struct_Variable) == 0x0001D8, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_object_Variable) == 0x000208, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_struct_Variable_1) == 0x000210, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_LocalUserId_8) == 0x000240, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_LocalUserId_8' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_PartyId_7) == 0x000270, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_PartyId_7' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_result_1) == 0x000278, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_result_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CreateDelegate_OutputDelegate_5) == 0x00027C, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_LocalUserId_7) == 0x000290, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_LocalUserId_7' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_PartyId_6) == 0x0002C0, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_PartyId_6' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_result) == 0x0002C8, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_result' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CreateDelegate_OutputDelegate_6) == 0x0002CC, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_byte_Variable_1) == 0x0002DC, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_object_Variable_1) == 0x0002E0, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_struct_Variable_2) == 0x0002E8, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000318, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000320, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000328, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetLoginStatus_ReturnValue) == 0x000330, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetLoginStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_bool_Variable_1) == 0x000331, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000332, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_byte_Variable_2) == 0x000333, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_byte_Variable_3) == 0x000334, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetGameInstanceSubsystem_ReturnValue_6) == 0x000338, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetGameInstanceSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_bool_Has_Been_Initd_Variable) == 0x000340, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_bool_Variable_2) == 0x000341, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_Not_PreBool_ReturnValue) == 0x000342, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_Select_Default) == 0x000343, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_bool_IsClosed_Variable) == 0x000344, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CreateDelegate_OutputDelegate_7) == 0x000348, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_bool_Has_Been_Initd_Variable_1) == 0x000358, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_LocalUserId_6) == 0x000360, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_LocalUserId_6' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_PartyId_5) == 0x000390, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_PartyId_5' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_MemberId_1) == 0x000398, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_MemberId_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CreateDelegate_OutputDelegate_8) == 0x0003C8, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_LocalUserId_5) == 0x0003D8, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_LocalUserId_5' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_PartyId_4) == 0x000408, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_PartyId_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_NewLeaderId) == 0x000410, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_NewLeaderId' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetGameInstanceSubsystem_ReturnValue_7) == 0x000440, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetGameInstanceSubsystem_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_LocalUserId_4) == 0x000448, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_LocalUserId_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_PartyId_3) == 0x000478, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_PartyId_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_MemberId) == 0x000480, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_MemberId' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_Reason) == 0x0004B0, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_Reason' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CreateDelegate_OutputDelegate_9) == 0x0004B4, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetGameInstanceSubsystem_ReturnValue_8) == 0x0004C8, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetGameInstanceSubsystem_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_LocalUserId_3) == 0x0004D0, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_LocalUserId_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_PartyId_2) == 0x000500, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_PartyId_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CreateDelegate_OutputDelegate_10) == 0x000508, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetGameInstanceSubsystem_ReturnValue_9) == 0x000518, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetGameInstanceSubsystem_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetPlayerController_ReturnValue) == 0x000520, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetControllerUniqueNetId_ReturnValue) == 0x000528, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetControllerUniqueNetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetPlayerController_ReturnValue_1) == 0x000558, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetControllerUniqueNetId_ReturnValue_1) == 0x000560, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetControllerUniqueNetId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_struct_Variable_3) == 0x000590, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_LocalUserId_2) == 0x0005C0, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_LocalUserId_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_PartyId_1) == 0x0005F0, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_PartyId_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_object_Variable_2) == 0x0005F8, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, Temp_byte_Variable_4) == 0x000600, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_LocalUserId_1) == 0x000608, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_LocalUserId_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_PartyId) == 0x000638, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_PartyId' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_Namespace) == 0x000640, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_Namespace' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_PartyData) == 0x000648, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_PartyData' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetPlayerController_ReturnValue_2) == 0x000650, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_LocalUserId_11) == 0x000658, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_LocalUserId_11' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_PartyId_10) == 0x000688, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_PartyId_10' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_result_4) == 0x000690, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_result_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetControllerUniqueNetId_ReturnValue_2) == 0x000698, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetControllerUniqueNetId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetJoinedParties_OutPartyIdArray) == 0x0006C8, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetJoinedParties_OutPartyIdArray' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_GetJoinedParties_ReturnValue) == 0x0006D8, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_GetJoinedParties_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_Array_Get_Item) == 0x0006E0, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0006E8, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_IsValid_PartyId_ReturnValue) == 0x0006E9, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_IsValid_PartyId_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_IsValid_ReturnValue_1) == 0x0006EA, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, CallFunc_BooleanAND_ReturnValue) == 0x0006EB, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_LocalUserId) == 0x0006F0, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_LocalUserId' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CreateDelegate_OutputDelegate_11) == 0x000720, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_LocalUserNum) == 0x000730, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_LocalUserNum' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad, K2Node_CustomEvent_bWasSuccessful) == 0x000734, "Member 'UI_Menu_Squad_C_ExecuteUbergraph_UI_Menu_Squad::K2Node_CustomEvent_bWasSuccessful' has a wrong offset!");
