#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Tutorial_Show

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Tutorial_Show.UI_Menu_Tutorial_Show_C
// 0x0028 (0x02A8 - 0x0280)
class UUI_Menu_Tutorial_Show_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Later;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_No;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_OK;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__UI_Menu_Tutorial_Show_Button_Later_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Menu_Tutorial_Show_Button_No_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Menu_Tutorial_Show_Button_Ok_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void DisableTutorialLocal();
	void ExecuteUbergraph_UI_Menu_Tutorial_Show(int32 EntryPoint);
	void OnPlayFabResponse_2834E7BC44EE5C27AF494EACE2CE051F(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void OnPlayFabResponse_8E175A004BF299396E7FF1936175E0A8(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void WritePlayerEvent_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void WritePlayerEvent_Success(const struct FClientWriteEventResponse& Result, class UObject* CustomData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Menu_Tutorial_Show_C">();
	}
	static class UUI_Menu_Tutorial_Show_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Tutorial_Show_C>();
	}
};
static_assert(alignof(UUI_Menu_Tutorial_Show_C) == 0x000008, "Wrong alignment on UUI_Menu_Tutorial_Show_C");
static_assert(sizeof(UUI_Menu_Tutorial_Show_C) == 0x0002A8, "Wrong size on UUI_Menu_Tutorial_Show_C");
static_assert(offsetof(UUI_Menu_Tutorial_Show_C, UberGraphFrame) == 0x000280, "Member 'UUI_Menu_Tutorial_Show_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Tutorial_Show_C, Show) == 0x000288, "Member 'UUI_Menu_Tutorial_Show_C::Show' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Tutorial_Show_C, Button_Later) == 0x000290, "Member 'UUI_Menu_Tutorial_Show_C::Button_Later' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Tutorial_Show_C, Button_No) == 0x000298, "Member 'UUI_Menu_Tutorial_Show_C::Button_No' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Tutorial_Show_C, Button_OK) == 0x0002A0, "Member 'UUI_Menu_Tutorial_Show_C::Button_OK' has a wrong offset!");

}

