#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "POLYGON_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot.UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C
// 0x0078 (0x02F8 - 0x0280)
class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_ModuleName;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ModuleName;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ModuleType_1;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ModuleType_2;                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Icon;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Text;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_C* UI_Menu_Soldier_Weapon_Gun_Gunsmith_Selector;      // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EGunModuleType                                ModuleType;                                        // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3691[0x7];                                     // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Module_Class;                                      // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Delta_Time;                                        // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_General_Slot_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_General_Slot_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_General_Slot_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Reset();
	void SetModuleInfo(class UClass* ModuleClass);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C">();
	}
	static class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C>();
	}
};
static_assert(alignof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C) == 0x000008, "Wrong alignment on UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C");
static_assert(sizeof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C) == 0x0002F8, "Wrong size on UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C, UberGraphFrame) == 0x000280, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C, Hover) == 0x000288, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C::Hover' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C, Button) == 0x000290, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C::Button' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C, Image_Icon) == 0x000298, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C, ScrollBox_ModuleName) == 0x0002A0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C::ScrollBox_ModuleName' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C, SizeBox) == 0x0002A8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C, TextBlock_ModuleName) == 0x0002B0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C::TextBlock_ModuleName' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C, TextBlock_ModuleType_1) == 0x0002B8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C::TextBlock_ModuleType_1' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C, TextBlock_ModuleType_2) == 0x0002C0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C::TextBlock_ModuleType_2' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C, WidgetSwitcher_Icon) == 0x0002C8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C::WidgetSwitcher_Icon' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C, WidgetSwitcher_Text) == 0x0002D0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C::WidgetSwitcher_Text' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C, UI_Menu_Soldier_Weapon_Gun_Gunsmith_Selector) == 0x0002D8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C::UI_Menu_Soldier_Weapon_Gun_Gunsmith_Selector' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C, ModuleType) == 0x0002E0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C::ModuleType' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C, Module_Class) == 0x0002E8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C::Module_Class' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C, Delta_Time) == 0x0002F0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Slot_C::Delta_Time' has a wrong offset!");

}

