#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Squad_Friend

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OnlineSubsystemBlueprints_structs.hpp"


namespace SDK::Params
{

// Function UI_Menu_Squad_Friend.UI_Menu_Squad_Friend_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UI_Menu_Squad_Friend_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Squad_Friend_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UI_Menu_Squad_Friend_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UI_Menu_Squad_Friend_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UI_Menu_Squad_Friend_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UI_Menu_Squad_Friend_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UI_Menu_Squad_Friend_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function UI_Menu_Squad_Friend.UI_Menu_Squad_Friend_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UI_Menu_Squad_Friend_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Squad_Friend_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UI_Menu_Squad_Friend_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UI_Menu_Squad_Friend_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UI_Menu_Squad_Friend_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UI_Menu_Squad_Friend_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UI_Menu_Squad_Friend_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UI_Menu_Squad_Friend.UI_Menu_Squad_Friend_C.ExecuteUbergraph_UI_Menu_Squad_Friend
// 0x0300 (0x0300 - 0x0000)
struct UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3414[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3415[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3416[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, const struct FUniqueNetIdRepl& MemberId)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3417[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UserEntry_C*                        K2Node_DynamicCast_AsBP_User_Entry;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3418[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3419[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_LocalUserId_3;                  // 0x0070(0x0030)(HasGetValueTypeHash)
	class UPartyId*                               K2Node_CustomEvent_PartyId_3;                      // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_MemberId_1;                     // 0x00A8(0x0030)(HasGetValueTypeHash)
	class UOnlineFriendsSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FUniqueNetIdReplFUniqueNetIdRepl_ReturnValue; // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341A[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_LocalUserId_2;                  // 0x00E8(0x0030)(HasGetValueTypeHash)
	class UPartyId*                               K2Node_CustomEvent_PartyId_2;                      // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_MemberId;                       // 0x0120(0x0030)(HasGetValueTypeHash)
	EMemberExitedReason_                          K2Node_CustomEvent_Reason;                         // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341B[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0168(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0180(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_LocalUserId_1;                  // 0x0190(0x0030)(HasGetValueTypeHash)
	class UPartyId*                               K2Node_CustomEvent_PartyId_1;                      // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x01C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBlueprintPartyMember*>          CallFunc_GetPartyMembers_OutPartyMembersArray;     // 0x01E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetPartyMembers_ReturnValue;              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341C[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlueprintPartyMember*                  CallFunc_Array_Get_Item;                           // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetUserId_ReturnValue;                    // 0x0208(0x0030)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FUniqueNetIdReplFUniqueNetIdRepl_ReturnValue_1; // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341D[0x1];                                     // 0x0243(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FUniqueNetIdReplFUniqueNetIdRepl_ReturnValue_2; // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341E[0x3];                                     // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x024C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341F[0x4];                                     // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_LocalUserId;                    // 0x0260(0x0030)(HasGetValueTypeHash)
	class UPartyId*                               K2Node_CustomEvent_PartyId;                        // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3420[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3421[0x3];                                     // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FUniqueNetIdRepl& LocalUserId, class UPartyId* PartyId, const struct FUniqueNetIdRepl& MemberId, EMemberExitedReason_ Reason)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x02BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3422[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineFriendRef*                       CallFunc_GetFriend_ReturnValue;                    // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1; // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3423[0x6];                                     // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlinePartySubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RetriggerableDelay_Duration_ImplicitCast; // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend) == 0x000008, "Wrong alignment on UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend");
static_assert(sizeof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend) == 0x000300, "Wrong size on UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, EntryPoint) == 0x000000, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, Temp_bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, Temp_int_Array_Index_Variable) == 0x000014, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_Event_bIsExpanded) == 0x00003C, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_Event_bIsSelected) == 0x00003D, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_Event_ListItemObject) == 0x000040, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_DynamicCast_AsBP_User_Entry) == 0x000048, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_DynamicCast_AsBP_User_Entry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_GetPlayerController_ReturnValue) == 0x000058, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000060, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_CustomEvent_LocalUserId_3) == 0x000070, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_CustomEvent_LocalUserId_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_CustomEvent_PartyId_3) == 0x0000A0, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_CustomEvent_PartyId_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_CustomEvent_MemberId_1) == 0x0000A8, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_CustomEvent_MemberId_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000D8, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_EqualEqual_FUniqueNetIdReplFUniqueNetIdRepl_ReturnValue) == 0x0000E0, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_EqualEqual_FUniqueNetIdReplFUniqueNetIdRepl_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_CustomEvent_LocalUserId_2) == 0x0000E8, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_CustomEvent_LocalUserId_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_CustomEvent_PartyId_2) == 0x000118, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_CustomEvent_PartyId_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_CustomEvent_MemberId) == 0x000120, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_CustomEvent_MemberId' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_CustomEvent_Reason) == 0x000150, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_CustomEvent_Reason' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_GetDisplayName_ReturnValue) == 0x000158, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_Conv_StringToText_ReturnValue) == 0x000168, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_CreateDelegate_OutputDelegate_2) == 0x000180, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_CustomEvent_LocalUserId_1) == 0x000190, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_CustomEvent_LocalUserId_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_CustomEvent_PartyId_1) == 0x0001C0, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_CustomEvent_PartyId_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001C8, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0001D8, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x0001E0, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_GetPartyMembers_OutPartyMembersArray) == 0x0001E8, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_GetPartyMembers_OutPartyMembersArray' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_GetPartyMembers_ReturnValue) == 0x0001F8, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_GetPartyMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_Array_Get_Item) == 0x000200, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_GetUserId_ReturnValue) == 0x000208, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_GetUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_Array_Length_ReturnValue) == 0x000238, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, Temp_int_Loop_Counter_Variable) == 0x00023C, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_Less_IntInt_ReturnValue) == 0x000240, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_EqualEqual_FUniqueNetIdReplFUniqueNetIdRepl_ReturnValue_1) == 0x000241, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_EqualEqual_FUniqueNetIdReplFUniqueNetIdRepl_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_BooleanAND_ReturnValue) == 0x000242, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_Add_IntInt_ReturnValue) == 0x000244, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_EqualEqual_FUniqueNetIdReplFUniqueNetIdRepl_ReturnValue_2) == 0x000248, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_EqualEqual_FUniqueNetIdReplFUniqueNetIdRepl_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_CreateDelegate_OutputDelegate_4) == 0x00024C, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_CustomEvent_LocalUserId) == 0x000260, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_CustomEvent_LocalUserId' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_CustomEvent_PartyId) == 0x000290, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_CustomEvent_PartyId' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000298, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_DynamicCast_AsTexture_2D) == 0x0002A0, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_DynamicCast_bSuccess_2) == 0x0002A8, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0002B0, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_IsValid_ReturnValue) == 0x0002B8, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002BC, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_GetFriend_ReturnValue) == 0x0002D0, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_GetFriend_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_GetPlayerController_ReturnValue_1) == 0x0002D8, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1) == 0x0002E0, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_DynamicCast_bSuccess_3) == 0x0002E8, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, K2Node_SwitchEnum_CmpSuccess) == 0x0002E9, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x0002F0, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend, CallFunc_RetriggerableDelay_Duration_ImplicitCast) == 0x0002F8, "Member 'UI_Menu_Squad_Friend_C_ExecuteUbergraph_UI_Menu_Squad_Friend::CallFunc_RetriggerableDelay_Duration_ImplicitCast' has a wrong offset!");

// Function UI_Menu_Squad_Friend.UI_Menu_Squad_Friend_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UI_Menu_Squad_Friend_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Squad_Friend_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UI_Menu_Squad_Friend_C_OnListItemObjectSet");
static_assert(sizeof(UI_Menu_Squad_Friend_C_OnListItemObjectSet) == 0x000008, "Wrong size on UI_Menu_Squad_Friend_C_OnListItemObjectSet");
static_assert(offsetof(UI_Menu_Squad_Friend_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UI_Menu_Squad_Friend_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UI_Menu_Squad_Friend.UI_Menu_Squad_Friend_C.OnPartyExited_Event
// 0x0038 (0x0038 - 0x0000)
struct UI_Menu_Squad_Friend_C_OnPartyExited_Event final
{
public:
	struct FUniqueNetIdRepl                       LocalUserId;                                       // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UPartyId*                               PartyId;                                           // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Squad_Friend_C_OnPartyExited_Event) == 0x000008, "Wrong alignment on UI_Menu_Squad_Friend_C_OnPartyExited_Event");
static_assert(sizeof(UI_Menu_Squad_Friend_C_OnPartyExited_Event) == 0x000038, "Wrong size on UI_Menu_Squad_Friend_C_OnPartyExited_Event");
static_assert(offsetof(UI_Menu_Squad_Friend_C_OnPartyExited_Event, LocalUserId) == 0x000000, "Member 'UI_Menu_Squad_Friend_C_OnPartyExited_Event::LocalUserId' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_OnPartyExited_Event, PartyId) == 0x000030, "Member 'UI_Menu_Squad_Friend_C_OnPartyExited_Event::PartyId' has a wrong offset!");

// Function UI_Menu_Squad_Friend.UI_Menu_Squad_Friend_C.OnPartyJoined_Event
// 0x0038 (0x0038 - 0x0000)
struct UI_Menu_Squad_Friend_C_OnPartyJoined_Event final
{
public:
	struct FUniqueNetIdRepl                       LocalUserId;                                       // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UPartyId*                               PartyId;                                           // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Squad_Friend_C_OnPartyJoined_Event) == 0x000008, "Wrong alignment on UI_Menu_Squad_Friend_C_OnPartyJoined_Event");
static_assert(sizeof(UI_Menu_Squad_Friend_C_OnPartyJoined_Event) == 0x000038, "Wrong size on UI_Menu_Squad_Friend_C_OnPartyJoined_Event");
static_assert(offsetof(UI_Menu_Squad_Friend_C_OnPartyJoined_Event, LocalUserId) == 0x000000, "Member 'UI_Menu_Squad_Friend_C_OnPartyJoined_Event::LocalUserId' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_OnPartyJoined_Event, PartyId) == 0x000030, "Member 'UI_Menu_Squad_Friend_C_OnPartyJoined_Event::PartyId' has a wrong offset!");

// Function UI_Menu_Squad_Friend.UI_Menu_Squad_Friend_C.OnPartyMemberExited_Event
// 0x0070 (0x0070 - 0x0000)
struct UI_Menu_Squad_Friend_C_OnPartyMemberExited_Event final
{
public:
	struct FUniqueNetIdRepl                       LocalUserId;                                       // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UPartyId*                               PartyId;                                           // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       MemberId;                                          // 0x0038(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	EMemberExitedReason_                          Reason;                                            // 0x0068(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Squad_Friend_C_OnPartyMemberExited_Event) == 0x000008, "Wrong alignment on UI_Menu_Squad_Friend_C_OnPartyMemberExited_Event");
static_assert(sizeof(UI_Menu_Squad_Friend_C_OnPartyMemberExited_Event) == 0x000070, "Wrong size on UI_Menu_Squad_Friend_C_OnPartyMemberExited_Event");
static_assert(offsetof(UI_Menu_Squad_Friend_C_OnPartyMemberExited_Event, LocalUserId) == 0x000000, "Member 'UI_Menu_Squad_Friend_C_OnPartyMemberExited_Event::LocalUserId' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_OnPartyMemberExited_Event, PartyId) == 0x000030, "Member 'UI_Menu_Squad_Friend_C_OnPartyMemberExited_Event::PartyId' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_OnPartyMemberExited_Event, MemberId) == 0x000038, "Member 'UI_Menu_Squad_Friend_C_OnPartyMemberExited_Event::MemberId' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_OnPartyMemberExited_Event, Reason) == 0x000068, "Member 'UI_Menu_Squad_Friend_C_OnPartyMemberExited_Event::Reason' has a wrong offset!");

// Function UI_Menu_Squad_Friend.UI_Menu_Squad_Friend_C.OnPartyMemberJoined_Event
// 0x0068 (0x0068 - 0x0000)
struct UI_Menu_Squad_Friend_C_OnPartyMemberJoined_Event final
{
public:
	struct FUniqueNetIdRepl                       LocalUserId;                                       // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UPartyId*                               PartyId;                                           // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       MemberId;                                          // 0x0038(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Squad_Friend_C_OnPartyMemberJoined_Event) == 0x000008, "Wrong alignment on UI_Menu_Squad_Friend_C_OnPartyMemberJoined_Event");
static_assert(sizeof(UI_Menu_Squad_Friend_C_OnPartyMemberJoined_Event) == 0x000068, "Wrong size on UI_Menu_Squad_Friend_C_OnPartyMemberJoined_Event");
static_assert(offsetof(UI_Menu_Squad_Friend_C_OnPartyMemberJoined_Event, LocalUserId) == 0x000000, "Member 'UI_Menu_Squad_Friend_C_OnPartyMemberJoined_Event::LocalUserId' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_OnPartyMemberJoined_Event, PartyId) == 0x000030, "Member 'UI_Menu_Squad_Friend_C_OnPartyMemberJoined_Event::PartyId' has a wrong offset!");
static_assert(offsetof(UI_Menu_Squad_Friend_C_OnPartyMemberJoined_Event, MemberId) == 0x000038, "Member 'UI_Menu_Squad_Friend_C_OnPartyMemberJoined_Event::MemberId' has a wrong offset!");

}

