#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Gear_Watch_Selector

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "POLYGON_structs.hpp"
#include "ST_ItemInfo_structs.hpp"


namespace SDK::Params
{

// Function UI_Menu_Solder_Gear_Watch_Selector.UI_Menu_Solder_Gear_Watch_Selector_C.AddWatch
// 0x0090 (0x0090 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch final
{
public:
	struct FST_ItemInfo                           ItemInfo;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          L_Break;                                           // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F6[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F7[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Menu_Solder_Gear_Watch_Selector_Item_Entry_C* CallFunc_SpawnObject_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F8[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0034(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F9[0x1];                                     // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0040(0x0010)(ConstParm, ReferenceParm)
	TArray<class UObject*>                        K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0050(0x0010)(ConstParm, ReferenceParm)
	class UBP_Menu_Solder_Gear_Watch_Selector_Item_Entry_C* CallFunc_SpawnObject_ReturnValue_1;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_Menu_Solder_Gear_Watch_Selector_Item_Entry_C* K2Node_DynamicCast_AsBP_Menu_Solder_Gear_Watch_Selector_Item_Entry; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36FA[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36FB[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Menu_Solder_Gear_Watch_Selector_Item_Entry_C* CallFunc_SpawnObject_ReturnValue_2;                // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch) == 0x000008, "Wrong alignment on UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch");
static_assert(sizeof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch) == 0x000090, "Wrong size on UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, ItemInfo) == 0x000000, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::ItemInfo' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, L_Break) == 0x000010, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::L_Break' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, Temp_int_Array_Index_Variable) == 0x000014, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, Temp_bool_True_if_break_was_hit_Variable) == 0x000020, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, CallFunc_SpawnObject_ReturnValue) == 0x000028, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, CallFunc_Not_PreBool_ReturnValue_1) == 0x000031, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, Temp_name_Variable) == 0x000034, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, CallFunc_Map_Contains_ReturnValue) == 0x00003C, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::CallFunc_Map_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, CallFunc_IsValid_ReturnValue_1) == 0x00003D, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, CallFunc_Not_PreBool_ReturnValue_2) == 0x00003E, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, CallFunc_GetListItems_ReturnValue) == 0x000040, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000050, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, CallFunc_SpawnObject_ReturnValue_1) == 0x000060, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, CallFunc_Array_Get_Item) == 0x000068, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, K2Node_DynamicCast_AsBP_Menu_Solder_Gear_Watch_Selector_Item_Entry) == 0x000070, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::K2Node_DynamicCast_AsBP_Menu_Solder_Gear_Watch_Selector_Item_Entry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000079, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, CallFunc_BooleanAND_ReturnValue) == 0x000081, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch, CallFunc_SpawnObject_ReturnValue_2) == 0x000088, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_AddWatch::CallFunc_SpawnObject_ReturnValue_2' has a wrong offset!");

// Function UI_Menu_Solder_Gear_Watch_Selector.UI_Menu_Solder_Gear_Watch_Selector_C.ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector
// 0x00D0 (0x00D0 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36FC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTask_General_CameraTransition_C*       CallFunc_CreateAction_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<EModifiedData>& ModifiedData, const class FString& CustomString)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTask_General_CameraTransition_C*       CallFunc_CreateAction_ReturnValue_1;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36FD[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36FE[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_CustomEvent_ModifiedData;                   // 0x0050(0x0010)(ConstParm, ReferenceParm)
	class FString                                 K2Node_CustomEvent_CustomString;                   // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Menu_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Menu;      // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36FF[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3700[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ConstParm, ReferenceParm)
	class FName                                   Temp_name_Variable;                                // 0x00A0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_CameraTransitions_DarkenScreen_C*   CallFunc_Create_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00B8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_CameraTransitions_DarkenScreen_C*   CallFunc_Create_ReturnValue_1;                     // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector) == 0x000008, "Wrong alignment on UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector");
static_assert(sizeof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector) == 0x0000D0, "Wrong size on UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, EntryPoint) == 0x000000, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, CallFunc_CreateAction_ReturnValue) == 0x000008, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::CallFunc_CreateAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, CallFunc_CreateAction_ReturnValue_1) == 0x000020, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::CallFunc_CreateAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, Temp_bool_Has_Been_Initd_Variable) == 0x000028, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000038, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, Temp_bool_IsClosed_Variable) == 0x000041, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, K2Node_CustomEvent_ModifiedData) == 0x000050, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::K2Node_CustomEvent_ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, K2Node_CustomEvent_CustomString) == 0x000060, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::K2Node_CustomEvent_CustomString' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, K2Node_DynamicCast_AsBP_PG_Player_State_Menu) == 0x000070, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::K2Node_DynamicCast_AsBP_PG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000080, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, K2Node_MakeArray_Array) == 0x000090, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, Temp_name_Variable) == 0x0000A0, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000A8, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, CallFunc_Create_ReturnValue) == 0x0000B0, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, Temp_name_Variable_1) == 0x0000B8, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000C0, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector, CallFunc_Create_ReturnValue_1) == 0x0000C8, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ExecuteUbergraph_UI_Menu_Solder_Gear_Watch_Selector::CallFunc_Create_ReturnValue_1' has a wrong offset!");

// Function UI_Menu_Solder_Gear_Watch_Selector.UI_Menu_Solder_Gear_Watch_Selector_C.OnKeyDown
// 0x0208 (0x0208 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Selector_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0148(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Gear_Watch_Selector_C_OnKeyDown) == 0x000008, "Wrong alignment on UI_Menu_Solder_Gear_Watch_Selector_C_OnKeyDown");
static_assert(sizeof(UI_Menu_Solder_Gear_Watch_Selector_C_OnKeyDown) == 0x000208, "Wrong size on UI_Menu_Solder_Gear_Watch_Selector_C_OnKeyDown");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_OnKeyDown, ReturnValue) == 0x000078, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000130, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000148, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000200, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");

// Function UI_Menu_Solder_Gear_Watch_Selector.UI_Menu_Solder_Gear_Watch_Selector_C.OnUpdatePlayerCombinedInfo_Event
// 0x0020 (0x0020 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Selector_C_OnUpdatePlayerCombinedInfo_Event final
{
public:
	TArray<EModifiedData>                         ModifiedData;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 CustomString;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Gear_Watch_Selector_C_OnUpdatePlayerCombinedInfo_Event) == 0x000008, "Wrong alignment on UI_Menu_Solder_Gear_Watch_Selector_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(sizeof(UI_Menu_Solder_Gear_Watch_Selector_C_OnUpdatePlayerCombinedInfo_Event) == 0x000020, "Wrong size on UI_Menu_Solder_Gear_Watch_Selector_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_OnUpdatePlayerCombinedInfo_Event, ModifiedData) == 0x000000, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_OnUpdatePlayerCombinedInfo_Event::ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_OnUpdatePlayerCombinedInfo_Event, CustomString) == 0x000010, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_OnUpdatePlayerCombinedInfo_Event::CustomString' has a wrong offset!");

// Function UI_Menu_Solder_Gear_Watch_Selector.UI_Menu_Solder_Gear_Watch_Selector_C.ParsePlayerInventory
// 0x00C0 (0x00C0 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory final
{
public:
	class UPlayFabJsonObject*                     L_Iterator;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FST_ItemInfo                           L_ItemInfo;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3701[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Watch_General;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3702[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_1;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3703[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3704[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue;          // 0x0080(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FItemEntry                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x00A0(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3705[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory) == 0x000008, "Wrong alignment on UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory");
static_assert(sizeof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory) == 0x0000C0, "Wrong size on UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, L_Iterator) == 0x000000, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::L_Iterator' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, L_ItemInfo) == 0x000008, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::L_ItemInfo' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, Temp_int_Array_Index_Variable) == 0x000020, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, K2Node_ClassDynamicCast_AsItem_Watch_General) == 0x000028, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::K2Node_ClassDynamicCast_AsItem_Watch_General' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, K2Node_ClassDynamicCast_bSuccess) == 0x000030, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_GetObjectField_ReturnValue) == 0x000038, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_GetObjectField_ReturnValue_1) == 0x000040, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_GetBoolField_ReturnValue) == 0x000048, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_GetBoolField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_HasField_ReturnValue) == 0x000049, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_HasField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_HasField_ReturnValue_1) == 0x00004A, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_HasField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_BooleanAND_ReturnValue) == 0x00004B, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_BooleanAND_ReturnValue_1) == 0x00004C, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_GetStringField_ReturnValue) == 0x000050, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000060, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000068, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_GetStringField_ReturnValue_1) == 0x000070, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_GetObjectArrayField_ReturnValue) == 0x000080, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_GetObjectArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_Conv_StringToName_ReturnValue) == 0x000090, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_Array_Get_Item) == 0x000098, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000A0, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B0, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_Array_Length_ReturnValue) == 0x0000B4, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_ParsePlayerInventory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function UI_Menu_Solder_Gear_Watch_Selector.UI_Menu_Solder_Gear_Watch_Selector_C.Reset
// 0x0088 (0x0088 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Selector_C_Reset final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3706[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0010(0x0010)(ConstParm, ReferenceParm)
	TArray<class UObject*>                        K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0020(0x0010)(ConstParm, ReferenceParm)
	class UBP_Menu_Solder_Gear_Watch_Selector_Item_Entry_C* CallFunc_SpawnObject_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3707[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0040(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemEntry                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0058(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3708[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3709[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_ItemInfo                           K2Node_MakeStruct_ST_ItemInfo;                     // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Gear_Watch_Selector_C_Reset) == 0x000008, "Wrong alignment on UI_Menu_Solder_Gear_Watch_Selector_C_Reset");
static_assert(sizeof(UI_Menu_Solder_Gear_Watch_Selector_C_Reset) == 0x000088, "Wrong size on UI_Menu_Solder_Gear_Watch_Selector_C_Reset");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_Reset, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_Reset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_Reset, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_Reset::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_Reset, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_Reset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_Reset, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_Reset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_Reset, CallFunc_GetListItems_ReturnValue) == 0x000010, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_Reset::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_Reset, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000020, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_Reset::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_Reset, CallFunc_SpawnObject_ReturnValue) == 0x000030, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_Reset::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_Reset, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_Reset::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_Reset, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000040, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_Reset::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_Reset, CallFunc_Array_Get_Item) == 0x000050, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_Reset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_Reset, CallFunc_GetDataTableRowFromName_OutRow) == 0x000058, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_Reset::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_Reset, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000068, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_Reset::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_Reset, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_Reset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_Reset, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_Reset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_Reset, K2Node_MakeStruct_ST_ItemInfo) == 0x000078, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_Reset::K2Node_MakeStruct_ST_ItemInfo' has a wrong offset!");

// Function UI_Menu_Solder_Gear_Watch_Selector.UI_Menu_Solder_Gear_Watch_Selector_C.SetToolTipInfo
// 0x01B0 (0x01B0 - 0x0000)
struct UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo final
{
public:
	class UClass*                                 ItemClass;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 L_WatchClass;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_370A[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Watch_General;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_370B[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemRareType                                 Temp_byte_Variable;                                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_370C[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemRareType                                 Temp_byte_Variable_1;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_370D[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x00B8(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x00D0(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x00E8(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0100(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0118(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0130(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x0148(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_370E[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataContainerValue_Base*               CallFunc_FindDataContainerValue_ReturnValue;       // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDataContainerValue_FText*              K2Node_DynamicCast_AsFText;                        // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_370F[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x017C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3710[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0190(0x0018)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemRareType                                 Temp_byte_Variable_2;                              // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3711[0x2];                                     // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_2;                           // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo) == 0x000008, "Wrong alignment on UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo");
static_assert(sizeof(UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo) == 0x0001B0, "Wrong size on UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo, ItemClass) == 0x000000, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo::ItemClass' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo, L_WatchClass) == 0x000008, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo::L_WatchClass' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo, Temp_int_Variable) == 0x000010, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo, K2Node_ClassDynamicCast_AsItem_Watch_General) == 0x000018, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo::K2Node_ClassDynamicCast_AsItem_Watch_General' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo, K2Node_ClassDynamicCast_bSuccess) == 0x000020, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo, Temp_int_Variable_1) == 0x000024, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo, Temp_int_Variable_2) == 0x000028, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo, Temp_int_Variable_3) == 0x00002C, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo, Temp_int_Variable_4) == 0x000030, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo, Temp_int_Variable_5) == 0x000034, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo, Temp_int_Variable_6) == 0x000038, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo, Temp_byte_Variable) == 0x00003C, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo, Temp_struct_Variable) == 0x000040, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo, Temp_struct_Variable_1) == 0x000050, "Member 'UI_Menu_Solder_Gear_Watch_Selector_C_SetToolTipInfo::Temp_struct_Variable_1' has a wrong offset!");
