#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry.UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C.ParseCharacteristic
// 0x0108 (0x0108 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic final
{
public:
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE6[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0030(0x0018)()
	class FName                                   Temp_name_Variable;                                // 0x0048(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0060(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE7[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x007C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE8[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataContainerValue_Base*               CallFunc_Map_Find_Value;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BE9[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataContainerValue_Base*               K2Node_LowEntry_LocalVariable_Value__Object;       // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00A8(0x0014)()
	uint8                                         Pad_3BEA[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataContainerValue_Bool*               K2Node_DynamicCast_AsBool;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BEB[0x1];                                     // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x00CC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BEC[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataContainerValue_Base*               CallFunc_Map_Find_Value_1;                         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BED[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataContainerValue_Base*               K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BEE[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataContainerValue_FText*              K2Node_DynamicCast_AsFText;                        // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic) == 0x000108, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, Temp_struct_Variable) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, Temp_bool_Variable) == 0x000010, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, Temp_text_Variable) == 0x000018, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, Temp_text_Variable_1) == 0x000030, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, Temp_name_Variable) == 0x000048, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, Temp_struct_Variable_1) == 0x000050, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, K2Node_Select_Default) == 0x000060, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, Temp_bool_Variable_1) == 0x000078, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, K2Node_Select_Default_1) == 0x00007C, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, CallFunc_Map_Find_Value) == 0x000090, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, CallFunc_Map_Find_ReturnValue) == 0x000098, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, K2Node_LowEntry_LocalVariable_Value__Object) == 0x0000A0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, K2Node_MakeStruct_SlateColor) == 0x0000A8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, K2Node_DynamicCast_AsBool) == 0x0000C0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::K2Node_DynamicCast_AsBool' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, CallFunc_IsValid_ReturnValue) == 0x0000C9, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, CallFunc_IsValid_ReturnValue_1) == 0x0000CA, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, Temp_name_Variable_1) == 0x0000CC, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, CallFunc_Map_Find_Value_1) == 0x0000D8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, CallFunc_Map_Find_ReturnValue_1) == 0x0000E0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, K2Node_LowEntry_LocalVariable_Value__1_Object) == 0x0000E8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::K2Node_LowEntry_LocalVariable_Value__1_Object' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, CallFunc_IsValid_ReturnValue_2) == 0x0000F0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, K2Node_DynamicCast_AsFText) == 0x0000F8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::K2Node_DynamicCast_AsFText' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic, K2Node_DynamicCast_bSuccess_1) == 0x000100, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_Entry_C_ParseCharacteristic::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

