#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MainMenu_Shop_Premium_SpecialOffers

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_MainMenu_Shop_Premium_SpecialOffers.UI_MainMenu_Shop_Premium_SpecialOffers_C
// 0x0018 (0x0298 - 0x0280)
class UUI_MainMenu_Shop_Premium_SpecialOffers_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWrapBox*                               WrapBox_Offers;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APG_PlayerState_Menu*                   PlayerState;                                       // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_MainMenu_Shop_Premium_SpecialOffers(int32 EntryPoint);
	void OnUpdatePlayerCombinedInfo_Event(const TArray<EModifiedData>& ModifiedData, const class FString& CustomString);
	void RemoveOfferByClass(class UClass* OfferClass);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_MainMenu_Shop_Premium_SpecialOffers_C">();
	}
	static class UUI_MainMenu_Shop_Premium_SpecialOffers_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_MainMenu_Shop_Premium_SpecialOffers_C>();
	}
};
static_assert(alignof(UUI_MainMenu_Shop_Premium_SpecialOffers_C) == 0x000008, "Wrong alignment on UUI_MainMenu_Shop_Premium_SpecialOffers_C");
static_assert(sizeof(UUI_MainMenu_Shop_Premium_SpecialOffers_C) == 0x000298, "Wrong size on UUI_MainMenu_Shop_Premium_SpecialOffers_C");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_SpecialOffers_C, UberGraphFrame) == 0x000280, "Member 'UUI_MainMenu_Shop_Premium_SpecialOffers_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_SpecialOffers_C, WrapBox_Offers) == 0x000288, "Member 'UUI_MainMenu_Shop_Premium_SpecialOffers_C::WrapBox_Offers' has a wrong offset!");
static_assert(offsetof(UUI_MainMenu_Shop_Premium_SpecialOffers_C, PlayerState) == 0x000290, "Member 'UUI_MainMenu_Shop_Premium_SpecialOffers_C::PlayerState' has a wrong offset!");

}

