#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip.UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C
// 0x0128 (0x03A8 - 0x0280)
class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RequirementsPulse;                                 // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_XpColor;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_RequiredCredits;                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_RequiredCrowns;                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_RequiredLevel;                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_RequiredXp;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_UnlockHold;                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_HoldUnlock;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrentFreeXp;                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ModuleName;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ModuleType;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_RequiredCredits;                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_RequiredCrowns;                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_RequiredLevel;                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_RequiredXp_1;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_RequiredXp_2;                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ItemCharacteristic_Parameter_C*     UI_GunParameter_AccuracyHip;                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ItemCharacteristic_Parameter_C*     UI_GunParameter_Damage;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ItemCharacteristic_Parameter_C*     UI_GunParameter_FirstShotKick;                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ItemCharacteristic_Parameter_C*     UI_GunParameter_MagazineCapacity;                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ItemCharacteristic_Parameter_C*     UI_GunParameter_Mobility;                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ItemCharacteristic_Parameter_C*     UI_GunParameter_RateOfFire;                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ItemCharacteristic_Parameter_C*     UI_GunParameter_Recoil;                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ItemCharacteristic_Parameter_C*     UI_GunParameter_RecoilControl;                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary_C* UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary;  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Characteristics;                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Lock;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Unlock;                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Xp;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C* Parent;                                            // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, AdvancedDisplay, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsHold;                                            // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_3716[0x7];                                     // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        UnlockProgress;                                    // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UClass*                                 GunClass;                                          // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UCurveFloat*                            CurveItemParameterMultiplier;                      // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip(int32 EntryPoint);
	void FindModuleCharacteristic(const struct FDataContainerObjectWrapper& CustomData, const class FString& Key, float* Value);
	void GrabBaseInfo();
	void OnPressed_Event(bool IsPressed);
	void ParseCharacteristics();
	void PreConstruct(bool IsDesignTime);
	void Reset();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Unlock();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C">();
	}
	static class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C>();
	}
};
static_assert(alignof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C) == 0x000008, "Wrong alignment on UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C");
static_assert(sizeof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C) == 0x0003A8, "Wrong size on UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, UberGraphFrame) == 0x000280, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, RequirementsPulse) == 0x000288, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::RequirementsPulse' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, Border_XpColor) == 0x000290, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::Border_XpColor' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, Image_Icon) == 0x000298, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, Overlay_RequiredCredits) == 0x0002A0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::Overlay_RequiredCredits' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, Overlay_RequiredCrowns) == 0x0002A8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::Overlay_RequiredCrowns' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, Overlay_RequiredLevel) == 0x0002B0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::Overlay_RequiredLevel' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, Overlay_RequiredXp) == 0x0002B8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::Overlay_RequiredXp' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, ProgressBar_UnlockHold) == 0x0002C0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::ProgressBar_UnlockHold' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, SizeBox_HoldUnlock) == 0x0002C8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::SizeBox_HoldUnlock' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, TextBlock_CurrentFreeXp) == 0x0002D0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::TextBlock_CurrentFreeXp' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, TextBlock_ModuleName) == 0x0002D8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::TextBlock_ModuleName' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, TextBlock_ModuleType) == 0x0002E0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::TextBlock_ModuleType' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, TextBlock_RequiredCredits) == 0x0002E8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::TextBlock_RequiredCredits' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, TextBlock_RequiredCrowns) == 0x0002F0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::TextBlock_RequiredCrowns' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, TextBlock_RequiredLevel) == 0x0002F8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::TextBlock_RequiredLevel' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, TextBlock_RequiredXp_1) == 0x000300, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::TextBlock_RequiredXp_1' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, TextBlock_RequiredXp_2) == 0x000308, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::TextBlock_RequiredXp_2' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, UI_GunParameter_AccuracyHip) == 0x000310, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::UI_GunParameter_AccuracyHip' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, UI_GunParameter_Damage) == 0x000318, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::UI_GunParameter_Damage' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, UI_GunParameter_FirstShotKick) == 0x000320, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::UI_GunParameter_FirstShotKick' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, UI_GunParameter_MagazineCapacity) == 0x000328, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::UI_GunParameter_MagazineCapacity' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, UI_GunParameter_Mobility) == 0x000330, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::UI_GunParameter_Mobility' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, UI_GunParameter_RateOfFire) == 0x000338, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::UI_GunParameter_RateOfFire' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, UI_GunParameter_Recoil) == 0x000340, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::UI_GunParameter_Recoil' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, UI_GunParameter_RecoilControl) == 0x000348, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::UI_GunParameter_RecoilControl' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary) == 0x000350, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::UI_Menu_Solder_Weapon_Gun_Gunsmith_ModuleSummary' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, VerticalBox_Characteristics) == 0x000358, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::VerticalBox_Characteristics' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, WidgetSwitcher_Lock) == 0x000360, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::WidgetSwitcher_Lock' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, WidgetSwitcher_Unlock) == 0x000368, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::WidgetSwitcher_Unlock' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, WidgetSwitcher_Xp) == 0x000370, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::WidgetSwitcher_Xp' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, Parent) == 0x000378, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::Parent' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, IsHold) == 0x000380, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::IsHold' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, UnlockProgress) == 0x000388, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::UnlockProgress' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, GunClass) == 0x000390, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::GunClass' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, CurveItemParameterMultiplier) == 0x000398, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::CurveItemParameterMultiplier' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C, DeltaTime) == 0x0003A0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_Tooltip_C::DeltaTime' has a wrong offset!");

}

