#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Tutorial_Close

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Tutorial_Close.UI_Menu_Tutorial_Close_C
// 0x0040 (0x02C0 - 0x0280)
class UUI_Menu_Tutorial_Close_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_No;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_OK;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClickYes;                                        // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnClickNo;                                         // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__UI_Menu_Tutorial_Show_Button_No_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Menu_Tutorial_Show_Button_Ok_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_Menu_Tutorial_Close(int32 EntryPoint);
	void OnClickNo__DelegateSignature();
	void OnClickYes__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Menu_Tutorial_Close_C">();
	}
	static class UUI_Menu_Tutorial_Close_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Tutorial_Close_C>();
	}
};
static_assert(alignof(UUI_Menu_Tutorial_Close_C) == 0x000008, "Wrong alignment on UUI_Menu_Tutorial_Close_C");
static_assert(sizeof(UUI_Menu_Tutorial_Close_C) == 0x0002C0, "Wrong size on UUI_Menu_Tutorial_Close_C");
static_assert(offsetof(UUI_Menu_Tutorial_Close_C, UberGraphFrame) == 0x000280, "Member 'UUI_Menu_Tutorial_Close_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Tutorial_Close_C, Show) == 0x000288, "Member 'UUI_Menu_Tutorial_Close_C::Show' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Tutorial_Close_C, Button_No) == 0x000290, "Member 'UUI_Menu_Tutorial_Close_C::Button_No' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Tutorial_Close_C, Button_OK) == 0x000298, "Member 'UUI_Menu_Tutorial_Close_C::Button_OK' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Tutorial_Close_C, OnClickYes) == 0x0002A0, "Member 'UUI_Menu_Tutorial_Close_C::OnClickYes' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Tutorial_Close_C, OnClickNo) == 0x0002B0, "Member 'UUI_Menu_Tutorial_Close_C::OnClickNo' has a wrong offset!");

}

