#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress

#include "Basic.hpp"

#include "POLYGON_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress.UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C.ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress
// 0x00E0 (0x00E0 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A5[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A6[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EModifiedData>                         K2Node_CustomEvent_ModifiedData;                   // 0x0018(0x0010)(ConstParm, ReferenceParm)
	class FString                                 K2Node_CustomEvent_CustomString;                   // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WithEditor_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A7[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C* K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Tree_Container; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A8[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           K2Node_DynamicCast_AsPanel_Widget;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A9[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37AA[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C* K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37AB[0x2];                                     // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x009C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_C*  CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress) == 0x0000E0, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, EntryPoint) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, Temp_bool_IsClosed_Variable) == 0x00000C, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, K2Node_Event_IsDesignTime) == 0x000014, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, K2Node_CustomEvent_ModifiedData) == 0x000018, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::K2Node_CustomEvent_ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, K2Node_CustomEvent_CustomString) == 0x000028, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::K2Node_CustomEvent_CustomString' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, CallFunc_GetChildAt_ReturnValue) == 0x000038, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, CallFunc_WithEditor_ReturnValue) == 0x000040, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::CallFunc_WithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Tree_Container) == 0x000048, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Tree_Container' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, Temp_bool_Has_Been_Initd_Variable) == 0x000051, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, CallFunc_GetChildAt_ReturnValue_1) == 0x000058, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, K2Node_DynamicCast_AsPanel_Widget) == 0x000060, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::K2Node_DynamicCast_AsPanel_Widget' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, CallFunc_GetAllChildren_ReturnValue) == 0x000070, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, CallFunc_Array_Get_Item) == 0x000080, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry) == 0x000090, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, CallFunc_Less_IntInt_ReturnValue) == 0x000099, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, K2Node_Event_MyGeometry) == 0x00009C, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, K2Node_Event_InDeltaTime) == 0x0000D4, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress, CallFunc_FindParentWidgetOfType_ReturnValue) == 0x0000D8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress::CallFunc_FindParentWidgetOfType_ReturnValue' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress.UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C.OnUpdateGunData
// 0x0068 (0x0068 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData final
{
public:
	class UPlayFabJsonObject*                     L_ProgressDataContainer_CustomData;                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 L_GunClass;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChildAt_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37AC[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Gun_General;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37AD[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37AE[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C* K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Tree_Container; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37AF[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData) == 0x000068, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData, L_ProgressDataContainer_CustomData) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData::L_ProgressDataContainer_CustomData' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData, L_GunClass) == 0x000008, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData::L_GunClass' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData, CallFunc_RemoveChildAt_ReturnValue) == 0x000010, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData::CallFunc_RemoveChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData, K2Node_ClassDynamicCast_AsItem_Gun_General) == 0x000018, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData::K2Node_ClassDynamicCast_AsItem_Gun_General' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData, K2Node_ClassDynamicCast_bSuccess) == 0x000020, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000028, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData, K2Node_ClassDynamicCast_AsUser_Widget) == 0x000038, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData::K2Node_ClassDynamicCast_AsUser_Widget' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData, K2Node_ClassDynamicCast_bSuccess_1) == 0x000040, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData, CallFunc_Create_ReturnValue) == 0x000048, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData, K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Tree_Container) == 0x000050, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData::K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Tree_Container' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData, CallFunc_AddChildToOverlay_ReturnValue) == 0x000060, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdateGunData::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress.UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C.OnUpdatePlayerCombinedInfo_Event
// 0x0020 (0x0020 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdatePlayerCombinedInfo_Event final
{
public:
	TArray<EModifiedData>                         ModifiedData;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 CustomString;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdatePlayerCombinedInfo_Event) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdatePlayerCombinedInfo_Event) == 0x000020, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdatePlayerCombinedInfo_Event, ModifiedData) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdatePlayerCombinedInfo_Event::ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdatePlayerCombinedInfo_Event, CustomString) == 0x000010, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_OnUpdatePlayerCombinedInfo_Event::CustomString' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress.UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_PreConstruct");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_PreConstruct) == 0x000001, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_PreConstruct");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress.UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C.Reset
// 0x0001 (0x0001 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_Reset final
{
public:
	bool                                          CallFunc_RemoveChildAt_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_Reset) == 0x000001, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_Reset");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_Reset) == 0x000001, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_Reset");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_Reset, CallFunc_RemoveChildAt_ReturnValue) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_Reset::CallFunc_RemoveChildAt_ReturnValue' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress.UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_Tick) == 0x000004, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_Tick");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_Tick) == 0x00003C, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_Tick");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_Tick, MyGeometry) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C_Tick::InDeltaTime' has a wrong offset!");

}

