#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Weapon_Gun_Gunsmith

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ST_ItemInfo_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Solder_Weapon_Gun_Gunsmith.UI_Menu_Solder_Weapon_Gun_Gunsmith_C
// 0x00C8 (0x0348 - 0x0280)
class UUI_Menu_Solder_Weapon_Gun_Gunsmith_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverHideUiButton;                                 // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_HideUI;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_ResetRotation;                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ProgressBar;                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_GunProgress;                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrentLevel_1;                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrentLevel_2;                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrentLevel_3;                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_GunFreeXp;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_GunName;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_GunRequiredTotalXpForNextLevel;          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_GunTotalXp;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           UI_Button_Attachments;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           UI_Button_Progress;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_C* UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress;       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_C* UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector;       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Progress;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FST_ItemInfo                           GunRef;                                            // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClickBack;                                       // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         TotalGunExperience;                                // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FreeGunExperience;                                 // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrectGunLevel;                                   // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_Button_HideUI_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_Button_HideUI_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_Button_HideUI_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_Button_ResetRotation_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_UI_Button_Attachments_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature(class UUI_Button_C* Button);
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_UI_Button_Progress_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature(class UUI_Button_C* Button);
	void BndEvt__UI_Menu_Solder_Weapon_Gun_Gunsmith_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_K2Node_ComponentBoundEvent_0_OnClickBack__DelegateSignature();
	void ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith(int32 EntryPoint);
	void OnClickBack__DelegateSignature();
	void OnUpdateGunData();
	void OnUpdatePlayerCombinedInfo_Event(const TArray<EModifiedData>& ModifiedData, const class FString& CustomString);
	void OnWidgetActivate();
	void OnWidgetDeactivate();
	void ParseGunProgress();
	void Reset();
	void Set_Gun_Current_Level(int32 Level);
	void SetGunInfo(const struct FST_ItemInfo& Param_GunRef);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Menu_Solder_Weapon_Gun_Gunsmith_C">();
	}
	static class UUI_Menu_Solder_Weapon_Gun_Gunsmith_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Solder_Weapon_Gun_Gunsmith_C>();
	}
};
static_assert(alignof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C) == 0x000008, "Wrong alignment on UUI_Menu_Solder_Weapon_Gun_Gunsmith_C");
static_assert(sizeof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C) == 0x000348, "Wrong size on UUI_Menu_Solder_Weapon_Gun_Gunsmith_C");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, UberGraphFrame) == 0x000280, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, HoverHideUiButton) == 0x000288, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::HoverHideUiButton' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, Button_HideUI) == 0x000290, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::Button_HideUI' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, Button_ResetRotation) == 0x000298, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::Button_ResetRotation' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, HorizontalBox_ProgressBar) == 0x0002A0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::HorizontalBox_ProgressBar' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, ProgressBar_GunProgress) == 0x0002A8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::ProgressBar_GunProgress' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, TextBlock_CurrentLevel_1) == 0x0002B0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::TextBlock_CurrentLevel_1' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, TextBlock_CurrentLevel_2) == 0x0002B8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::TextBlock_CurrentLevel_2' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, TextBlock_CurrentLevel_3) == 0x0002C0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::TextBlock_CurrentLevel_3' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, TextBlock_GunFreeXp) == 0x0002C8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::TextBlock_GunFreeXp' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, TextBlock_GunName) == 0x0002D0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::TextBlock_GunName' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, TextBlock_GunRequiredTotalXpForNextLevel) == 0x0002D8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::TextBlock_GunRequiredTotalXpForNextLevel' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, TextBlock_GunTotalXp) == 0x0002E0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::TextBlock_GunTotalXp' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, UI_Button_Attachments) == 0x0002E8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::UI_Button_Attachments' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, UI_Button_Progress) == 0x0002F0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::UI_Button_Progress' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress) == 0x0002F8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector) == 0x000300, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, VerticalBox_Progress) == 0x000308, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::VerticalBox_Progress' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, WidgetSwitcher) == 0x000310, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, GunRef) == 0x000318, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::GunRef' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, OnClickBack) == 0x000328, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::OnClickBack' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, TotalGunExperience) == 0x000338, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::TotalGunExperience' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, FreeGunExperience) == 0x00033C, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::FreeGunExperience' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_C, CurrectGunLevel) == 0x000340, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_C::CurrectGunLevel' has a wrong offset!");

}

