#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Weapon_Gun_Selector_Item

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "PlayFab_structs.hpp"
#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_Menu_Solder_Weapon_Gun_Selector_Item.UI_Menu_Solder_Weapon_Gun_Selector_Item_C.AsyncLoadIcon
// 0x0030 (0x0030 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Selector_Item_C_AsyncLoadIcon final
{
public:
	TSoftObjectPtr<class UObject>                 ItemIcon;                                          // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_AsyncLoadIcon) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_AsyncLoadIcon");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_AsyncLoadIcon) == 0x000030, "Wrong size on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_AsyncLoadIcon");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_AsyncLoadIcon, ItemIcon) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_AsyncLoadIcon::ItemIcon' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Selector_Item.UI_Menu_Solder_Weapon_Gun_Selector_Item_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Selector_Item_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Selector_Item.UI_Menu_Solder_Weapon_Gun_Selector_Item_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Selector_Item_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Selector_Item.UI_Menu_Solder_Weapon_Gun_Selector_Item_C.ExecuteCloudScript_Failure
// 0x0040 (0x0040 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Failure final
{
public:
	struct FPlayFabError                          Error;                                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Failure) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Failure");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Failure) == 0x000040, "Wrong size on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Failure");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Failure, Error) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Failure::Error' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Failure, CustomData) == 0x000038, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Failure::CustomData' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Selector_Item.UI_Menu_Solder_Weapon_Gun_Selector_Item_C.ExecuteCloudScript_Success
// 0x0068 (0x0068 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Success final
{
public:
	struct FClientExecuteCloudScriptResult        Result;                                            // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Success) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Success");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Success) == 0x000068, "Wrong size on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Success");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Success, Result) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Success::Result' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Success, CustomData) == 0x000060, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteCloudScript_Success::CustomData' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Selector_Item.UI_Menu_Solder_Weapon_Gun_Selector_Item_C.ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item
// 0x03C0 (0x03C0 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B1[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B2[0x5];                                     // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B3[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptRequest       K2Node_MakeStruct_ClientExecuteCloudScriptRequest; // 0x0088(0x0030)()
	class UPlayFabClientAPI*                      CallFunc_ExecuteCloudScript_ReturnValue;           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B4[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x00C8(0x0040)()
	class UObject*                                Temp_object_Variable_1;                            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result;                         // 0x0110(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B5[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x0180(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01C8(0x0018)()
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1; // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B6[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01F0(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B7[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x0210(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B8[0x7];                                     // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue_1;        // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x0268(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0278(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Base*                   K2Node_DynamicCast_AsPG_Player_State_Base;         // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B9[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_2; // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37BA[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_Menu_Solder_Weapon_Gun_Selector_Item_Entry_C* K2Node_DynamicCast_AsBP_Menu_Solder_Weapon_Gun_Selector_Item_Entry; // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37BB[0x6];                                     // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C* CallFunc_GetEquippedGunByItemClass_Gun;            // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Solder_Weapon_Gun_Selector_EquippedGun_C* CallFunc_GetEquippedGunByItemClass_Gun_1;          // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ClassClass_ReturnValue;          // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37BC[0x7];                                     // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetSlotByItemClass_Slot;                  // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ToLower_ReturnValue;                      // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUI_Menu_Solder_Weapon_Gun_Slot_C*      K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Slot; // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37BD[0x7];                                     // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetSlotByItemClass_Slot_1;                // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37BE[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Menu_Solder_Weapon_Gun_Slot_C*      K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Slot_1; // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37BF[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Menu_Solder_Weapon_Gun_Slot_C*      K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Slot_2; // 0x0358(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_1;                   // 0x0362(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C0[0x5];                                     // 0x0363(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C1[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 K2Node_CustomEvent_ItemIcon;                       // 0x0378(0x0030)(HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x03A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item) == 0x0003C0, "Wrong size on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, EntryPoint) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_CustomEvent_Loaded) == 0x000030, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, Temp_object_Variable) == 0x000038, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_AsTexture_2D) == 0x000040, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_Event_bIsExpanded) == 0x000049, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_Event_bIsSelected) == 0x00004A, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000050, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000058, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_GetPlayerController_ReturnValue) == 0x000060, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_ConstructJsonObject_ReturnValue) == 0x000068, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000070, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000080, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_MakeStruct_ClientExecuteCloudScriptRequest) == 0x000088, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_MakeStruct_ClientExecuteCloudScriptRequest' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_ExecuteCloudScript_ReturnValue) == 0x0000B8, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_ExecuteCloudScript_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, Temp_struct_Variable) == 0x0000C8, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, Temp_object_Variable_1) == 0x000108, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_CustomEvent_result) == 0x000110, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_CustomEvent_result' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_CustomEvent_customData_1) == 0x000170, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_CustomEvent_customData_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_GetBoolField_ReturnValue) == 0x000178, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_GetBoolField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_CustomEvent_error) == 0x000180, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_CustomEvent_error' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_CustomEvent_customData) == 0x0001B8, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_CustomEvent_customData' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_GetPlayerController_ReturnValue_1) == 0x0001C0, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_Conv_StringToText_ReturnValue) == 0x0001C8, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1) == 0x0001E0, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_bSuccess_2) == 0x0001E8, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001F0, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, Temp_bool_Variable) == 0x000208, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_CustomEvent_response) == 0x000210, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_CustomEvent_customData_2) == 0x000250, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_CustomEvent_customData_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_CustomEvent_successful) == 0x000258, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_ConstructJsonObject_ReturnValue_1) == 0x000260, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_ConstructJsonObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_MakeArray_Array) == 0x000268, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_CreateDelegate_OutputDelegate_2) == 0x000278, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_GetPlayerController_ReturnValue_2) == 0x000288, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_AsPG_Player_State_Base) == 0x000290, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_AsPG_Player_State_Base' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_bSuccess_3) == 0x000298, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_GetPlayerController_ReturnValue_3) == 0x0002A0, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_2) == 0x0002A8, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_bSuccess_4) == 0x0002B0, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_Event_ListItemObject) == 0x0002B8, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_AsBP_Menu_Solder_Weapon_Gun_Selector_Item_Entry) == 0x0002C0, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_AsBP_Menu_Solder_Weapon_Gun_Selector_Item_Entry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_bSuccess_5) == 0x0002C8, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_IsValid_ReturnValue_1) == 0x0002C9, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_GetEquippedGunByItemClass_Gun) == 0x0002D0, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_GetEquippedGunByItemClass_Gun' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_GetEquippedGunByItemClass_Gun_1) == 0x0002D8, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_GetEquippedGunByItemClass_Gun_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_NotEqual_ClassClass_ReturnValue) == 0x0002E0, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_NotEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_GetStringField_ReturnValue) == 0x0002E8, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_GetStringField_ReturnValue_1) == 0x0002F8, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_GetSlotByItemClass_Slot) == 0x000308, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_GetSlotByItemClass_Slot' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_ToLower_ReturnValue) == 0x000310, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_ToLower_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Slot) == 0x000320, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Slot' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_bSuccess_6) == 0x000328, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_GetObjectField_ReturnValue) == 0x000330, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_GetSlotByItemClass_Slot_1) == 0x000338, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_GetSlotByItemClass_Slot_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_IsValid_ReturnValue_2) == 0x000340, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Slot_1) == 0x000348, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Slot_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_bSuccess_7) == 0x000350, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Slot_2) == 0x000358, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Slot_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_DynamicCast_bSuccess_8) == 0x000360, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_HasField_ReturnValue) == 0x000361, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_HasField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_HasField_ReturnValue_1) == 0x000362, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_HasField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_GetObjectField_ReturnValue_1) == 0x000368, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_IsValid_ReturnValue_3) == 0x000370, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_CustomEvent_ItemIcon) == 0x000378, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_CustomEvent_ItemIcon' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, K2Node_CreateDelegate_OutputDelegate_3) == 0x0003A8, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item, CallFunc_IsValid_ReturnValue_4) == 0x0003B8, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Selector_Item::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Selector_Item.UI_Menu_Solder_Weapon_Gun_Selector_Item_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnListItemObjectSet");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnListItemObjectSet) == 0x000008, "Wrong size on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnListItemObjectSet");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Selector_Item.UI_Menu_Solder_Weapon_Gun_Selector_Item_C.OnLoaded_E497B4384B301222317152BD4E72D8E6
// 0x0008 (0x0008 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnLoaded_E497B4384B301222317152BD4E72D8E6 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnLoaded_E497B4384B301222317152BD4E72D8E6) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnLoaded_E497B4384B301222317152BD4E72D8E6");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnLoaded_E497B4384B301222317152BD4E72D8E6) == 0x000008, "Wrong size on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnLoaded_E497B4384B301222317152BD4E72D8E6");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnLoaded_E497B4384B301222317152BD4E72D8E6, Loaded) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnLoaded_E497B4384B301222317152BD4E72D8E6::Loaded' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Selector_Item.UI_Menu_Solder_Weapon_Gun_Selector_Item_C.OnPlayFabResponse_DC2AAA7343F70E47F780C6A0BD4D6CE7
// 0x0050 (0x0050 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnPlayFabResponse_DC2AAA7343F70E47F780C6A0BD4D6CE7 final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnPlayFabResponse_DC2AAA7343F70E47F780C6A0BD4D6CE7) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnPlayFabResponse_DC2AAA7343F70E47F780C6A0BD4D6CE7");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnPlayFabResponse_DC2AAA7343F70E47F780C6A0BD4D6CE7) == 0x000050, "Wrong size on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnPlayFabResponse_DC2AAA7343F70E47F780C6A0BD4D6CE7");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnPlayFabResponse_DC2AAA7343F70E47F780C6A0BD4D6CE7, Response) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnPlayFabResponse_DC2AAA7343F70E47F780C6A0BD4D6CE7::Response' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnPlayFabResponse_DC2AAA7343F70E47F780C6A0BD4D6CE7, CustomData) == 0x000040, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnPlayFabResponse_DC2AAA7343F70E47F780C6A0BD4D6CE7::CustomData' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnPlayFabResponse_DC2AAA7343F70E47F780C6A0BD4D6CE7, Successful) == 0x000048, "Member 'UI_Menu_Solder_Weapon_Gun_Selector_Item_C_OnPlayFabResponse_DC2AAA7343F70E47F780C6A0BD4D6CE7::Successful' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Selector_Item.UI_Menu_Solder_Weapon_Gun_Selector_Item_C.ParseItemnfo
// 0x0100 (0x0100 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ParseItemnfo final
{
public:
	class UPlayFabJsonObject*                     L_ProgressCustomData;                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 L_GunClass;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                L_GeneralItemData;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C2[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C3[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Temp_int_Variable;                                 // 0x0030(0x0010)(ReferenceParm)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_2;             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C4[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Temp_int_Variable_1;                               // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C5[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C6[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C7[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Temp_int_Variable_2;                               // 0x0098(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00A8(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C8[0x2];                                     // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C9[0x5];                                     // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_3;             // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_1;                   // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37CA[0x5];                                     // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Gun_General;        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37CB[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ParseItemnfo) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Selector_Item_C_ParseItemnfo");
