#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry

#include "Basic.hpp"

#include "POLYGON_structs.hpp"
#include "PlayFab_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry.UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C.ConstructRequestForUnlockModule
// 0x0078 (0x0078 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule final
{
public:
	class UPlayFabJsonObject*                     Request;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     L_Json;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_373B[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_373C[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast;       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule) == 0x000078, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule, Request) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule::Request' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule, L_Json) == 0x000008, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule::L_Json' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule, CallFunc_GetObjectField_ReturnValue) == 0x000018, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule, CallFunc_GetObjectField_ReturnValue_1) == 0x000020, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule, CallFunc_GetStringField_ReturnValue) == 0x000028, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000038, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000048, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule, CallFunc_IsEmpty_ReturnValue) == 0x000050, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule, CallFunc_GetStringField_ReturnValue_1) == 0x000058, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule, CallFunc_ConstructJsonObject_ReturnValue) == 0x000068, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule, CallFunc_SetNumberField_Number_ImplicitCast) == 0x000070, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ConstructRequestForUnlockModule::CallFunc_SetNumberField_Number_ImplicitCast' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry.UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C.ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry
// 0x0808 (0x0808 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_373D[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x0018(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_4;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_373E[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_373F[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x0080(0x0040)()
	class FString                                 Temp_string_Variable;                              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3740[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_1;                            // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3741[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3742[0x2];                                     // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffset_ReturnValue_1;            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3743[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue_1;       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3744[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3745[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3746[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3747[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3748[0x2];                                     // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x015C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3749[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_Texture;                        // 0x01A0(0x0030)(HasGetValueTypeHash)
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C* CallFunc_GetFarLockedParent_NotUnlockedModule;     // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C* K2Node_LowEntry_LocalVariable_Value__Object;       // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374A[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374B[0x2];                                     // 0x01F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374C[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C* CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374D[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu_1;       // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374E[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374F[0x4];                                     // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      Temp_struct_Variable_1;                            // 0x0258(0x0040)()
	TDelegate<void(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0298(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3750[0x5];                                     // 0x02C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_2;             // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_3;             // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_4;             // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_5;             // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_6;             // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3751[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_ConstructRequestForUnlockModule_Request;  // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptRequest       K2Node_MakeStruct_ClientExecuteCloudScriptRequest; // 0x0308(0x0030)()
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3752[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x0348(0x0010)(ConstParm, ReferenceParm)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3753[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response_1;                     // 0x0360(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_5;                   // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful_1;                   // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3754[0x7];                                     // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1; // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3755[0x7];                                     // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error_1;                        // 0x03D0(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_3;                   // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_2; // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3756[0x7];                                     // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0420(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0438(0x0018)()
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result_1;                       // 0x0450(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3757[0x7];                                     // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x04C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x04D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_1;                   // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x04E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x04EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3758[0x5];                                     // 0x04EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_3; // 0x04F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3759[0x7];                                     // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0510(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0520(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0530(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_4; // 0x0538(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375A[0x7];                                     // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0550(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_5; // 0x0558(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375B[0x7];                                     // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EModifiedData>                         K2Node_MakeArray_Array_1;                          // 0x0568(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375C[0x3];                                     // 0x0579(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x057C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375D[0x4];                                     // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_1;                           // 0x0590(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x05A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x05B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                      CallFunc_ExecuteCloudScript_ReturnValue;           // 0x05B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu_2;       // 0x05C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x05C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375E[0x6];                                     // 0x05CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_1;      // 0x05D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x05D8(0x0018)()
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_7;             // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_8;             // 0x05F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_1;             // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_2;             // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue;          // 0x0618(0x0010)(ReferenceParm)
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x0628(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x0660(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result;                         // 0x0668(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x06C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x06D0(0x0018)()
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_9;             // 0x06E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_2;             // 0x06F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue_1;        // 0x0700(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0710(0x0018)()
	TArray<class UPlayFabJsonObject*>             K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x0728(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetBoolField_ReturnValue_1;               // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375F[0x7];                                     // 0x0739(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0740(0x0018)()
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue_1;        // 0x0758(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__2_Object;     // 0x0760(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptRequest       K2Node_MakeStruct_ClientExecuteCloudScriptRequest_1; // 0x0768(0x0030)()
	class UPlayFabClientAPI*                      CallFunc_ExecuteCloudScript_ReturnValue_1;         // 0x0798(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3760[0x7];                                     // 0x07A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast; // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_Current_ImplicitCast;  // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3761[0x4];                                     // 0x07CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Option_0_ImplicitCast;               // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast;       // 0x07E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3762[0x4];                                     // 0x07EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_2;   // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast_1;     // 0x0800(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast_2;     // 0x0804(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry) == 0x000808, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, EntryPoint) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, K2Node_CustomEvent_response) == 0x000018, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, K2Node_CustomEvent_customData_4) == 0x000058, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::K2Node_CustomEvent_customData_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, K2Node_CustomEvent_successful) == 0x000060, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, K2Node_CreateDelegate_OutputDelegate_1) == 0x000064, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, Temp_bool_Variable) == 0x000074, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, Temp_object_Variable) == 0x000078, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, Temp_struct_Variable) == 0x000080, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, Temp_string_Variable) == 0x0000C0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, Temp_bool_Has_Been_Initd_Variable) == 0x0000D0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, Temp_string_Variable_1) == 0x0000D8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, Temp_real_Variable) == 0x0000E8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, Temp_bool_Variable_1) == 0x0000F0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x0000F4, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_GetScrollOffset_ReturnValue) == 0x0000F8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000FC, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x0000FD, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_GetScrollOffset_ReturnValue_1) == 0x000100, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_GetScrollOffset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000108, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_GetScrollOffsetOfEnd_ReturnValue_1) == 0x000110, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_GetScrollOffsetOfEnd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000114, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, Temp_object_Variable_1) == 0x000118, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, K2Node_DynamicCast_AsTexture_2D) == 0x000120, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, K2Node_CustomEvent_Loaded) == 0x000130, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, K2Node_Event_IsDesignTime) == 0x000138, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_GetPlayerController_ReturnValue) == 0x000140, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_Not_PreBool_ReturnValue) == 0x000148, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000150, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, K2Node_DynamicCast_bSuccess_1) == 0x000158, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, Temp_bool_Has_Been_Initd_Variable_1) == 0x000159, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, K2Node_Event_MyGeometry) == 0x00015C, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, K2Node_Event_InDeltaTime) == 0x000194, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_IsValid_ReturnValue) == 0x000198, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, K2Node_CustomEvent_Texture) == 0x0001A0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::K2Node_CustomEvent_Texture' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_GetFarLockedParent_NotUnlockedModule) == 0x0001D0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_GetFarLockedParent_NotUnlockedModule' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, K2Node_LowEntry_LocalVariable_Value__Object) == 0x0001D8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001E0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_PlayAnimation_ReturnValue) == 0x0001E8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_IsValid_ReturnValue_1) == 0x0001F0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001F1, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_Not_PreBool_ReturnValue_3) == 0x0001F2, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_BooleanAND_ReturnValue) == 0x0001F3, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001F4, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001F5, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry, Temp_real_Variable_1) == 0x0001F8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry::Temp_real_Variable_1' has a wrong offset!");
