#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer.UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C.ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer
// 0x0068 (0x0068 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C1[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Current_ImplicitCast;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer) == 0x000068, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer, EntryPoint) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer, CallFunc_GetScrollOffset_ReturnValue) == 0x000004, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer, K2Node_Event_MyGeometry) == 0x000008, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer, K2Node_Event_InDeltaTime) == 0x000040, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer, CallFunc_FInterpTo_ReturnValue) == 0x000048, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer, CallFunc_FInterpTo_Current_ImplicitCast) == 0x000050, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer::CallFunc_FInterpTo_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer, CallFunc_FInterpTo_DeltaTime_ImplicitCast) == 0x000058, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer::CallFunc_FInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast) == 0x000060, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer.UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C.InitEntries
// 0x00E0 (0x00E0 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries final
{
public:
	class UUniformGridSlot*                       L_UniformSlotIt;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UDataContainerValue_UObjectArray*> L_GridColumns;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C2[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataContainerValue_UObjectArray*       CallFunc_SpawnObject_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetSlotContent_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C3[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataContainerValue_UObjectArray*       CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C4[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C* K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C5[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C6[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataContainerValue_UObjectArray*       CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDataContainerValue_UObjectArray*       CallFunc_Array_Get_Item_3;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C7[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformGridPanel*                      K2Node_DynamicCast_AsUniform_Grid_Panel;           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C8[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_4;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C9[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_SlotAsUniformGridSlot_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries) == 0x0000E0, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, L_UniformSlotIt) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::L_UniformSlotIt' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, L_GridColumns) == 0x000008, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::L_GridColumns' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, Temp_int_Array_Index_Variable) == 0x000018, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_SpawnObject_ReturnValue) == 0x000020, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, Temp_int_Array_Index_Variable_2) == 0x000034, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_GetSlotContent_ReturnValue) == 0x000038, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_GetSlotContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, Temp_int_Loop_Counter_Variable_1) == 0x000040, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, Temp_int_Loop_Counter_Variable_2) == 0x000048, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_Array_Get_Item) == 0x000050, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry) == 0x000068, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_Array_Length_ReturnValue_1) == 0x000074, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_Less_IntInt_ReturnValue_1) == 0x000078, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_Add_IntInt_ReturnValue_2) == 0x00007C, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_Array_Get_Item_3) == 0x000088, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000091, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_BooleanAND_ReturnValue) == 0x000092, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_GetChildAt_ReturnValue) == 0x000098, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, K2Node_DynamicCast_AsUniform_Grid_Panel) == 0x0000A0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::K2Node_DynamicCast_AsUniform_Grid_Panel' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_IsValid_ReturnValue_1) == 0x0000A9, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_GetAllChildren_ReturnValue) == 0x0000B0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_Array_Get_Item_4) == 0x0000C0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_Array_Length_ReturnValue_2) == 0x0000C8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_SlotAsUniformGridSlot_ReturnValue) == 0x0000D0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_SlotAsUniformGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000D8, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_InitEntries::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer.UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C.OnMouseWheel
// 0x0250 (0x0250 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	float                                         CallFunc_PointerEvent_GetWheelDelta_ReturnValue;   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0178(0x00B8)()
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Max_ImplicitCast;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel) == 0x000250, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel, MyGeometry) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel, MouseEvent) == 0x000038, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel::MouseEvent' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel, ReturnValue) == 0x0000B0, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel, CallFunc_PointerEvent_GetWheelDelta_ReturnValue) == 0x000168, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel::CallFunc_PointerEvent_GetWheelDelta_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x00016C, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000170, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel, CallFunc_Handled_ReturnValue) == 0x000178, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000230, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel, CallFunc_FClamp_ReturnValue) == 0x000238, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000240, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel, CallFunc_FClamp_Max_ImplicitCast) == 0x000248, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnMouseWheel::CallFunc_FClamp_Max_ImplicitCast' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer.UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_Tick) == 0x000004, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_Tick");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_Tick) == 0x00003C, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_Tick");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_Tick, MyGeometry) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_Tick::InDeltaTime' has a wrong offset!");

// Function UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer.UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C.OnPaint
// 0x0290 (0x0290 - 0x0000)
struct UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnPaint final
{
public:
	struct FPaintContext                          Context;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FPaintContext                          L_Context;                                         // 0x0030(0x0030)(Edit, BlueprintVisible, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30CA[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue_1;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30CB[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           K2Node_DynamicCast_AsPanel_Widget;                 // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30CC[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30CD[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C* K2Node_DynamicCast_AsUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry; // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30CE[0x6];                                     // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_Entry_C* CallFunc_Array_Get_Item_1;                         // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetTickSpaceGeometry_ReturnValue;         // 0x00FC(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FGeometry                              CallFunc_GetTickSpaceGeometry_ReturnValue_1;       // 0x0134(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30CF[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalTopLeft_ReturnValue;              // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue_1;               // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalTopLeft_ReturnValue_1;            // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D0[0x4];                                     // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D1[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D2[0x3];                                     // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnPaint) == 0x000008, "Wrong alignment on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnPaint");
static_assert(sizeof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnPaint) == 0x000290, "Wrong size on UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnPaint");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnPaint, Context) == 0x000000, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnPaint::Context' has a wrong offset!");
static_assert(offsetof(UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnPaint, L_Context) == 0x000030, "Member 'UI_Menu_Solder_Weapon_Gun_Gunsmith_Progress_TreeContainer_C_OnPaint::L_Context' has a wrong offset!");
