#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_GeneralMenuScreen

#include "Basic.hpp"

#include "POLYGON_structs.hpp"
#include "PlayFab_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PingQoS_structs.hpp"


namespace SDK::Params
{

// Function UI_Menu_GeneralMenuScreen.UI_Menu_GeneralMenuScreen_C.BndEvt__UI_Button_CreateServer_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_CreateServer_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature final
{
public:
	class UUI_Button_Line_C*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_CreateServer_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_CreateServer_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(sizeof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_CreateServer_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000008, "Wrong size on UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_CreateServer_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_CreateServer_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature, Button) == 0x000000, "Member 'UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_CreateServer_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature::Button' has a wrong offset!");

// Function UI_Menu_GeneralMenuScreen.UI_Menu_GeneralMenuScreen_C.BndEvt__UI_Button_ServerSearch_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_ServerSearch_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature final
{
public:
	class UUI_Button_Line_C*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_ServerSearch_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_ServerSearch_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(sizeof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_ServerSearch_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000008, "Wrong size on UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_ServerSearch_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_ServerSearch_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature, Button) == 0x000000, "Member 'UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_ServerSearch_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature::Button' has a wrong offset!");

// Function UI_Menu_GeneralMenuScreen.UI_Menu_GeneralMenuScreen_C.BndEvt__UI_Button_Shop_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_Shop_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature final
{
public:
	class UUI_Button_Line_C*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_Shop_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_Shop_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature");
static_assert(sizeof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_Shop_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature) == 0x000008, "Wrong size on UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_Shop_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_Shop_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature, Button) == 0x000000, "Member 'UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_Shop_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature::Button' has a wrong offset!");

// Function UI_Menu_GeneralMenuScreen.UI_Menu_GeneralMenuScreen_C.BndEvt__UI_Button_Soldier_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_Soldier_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature final
{
public:
	class UUI_Button_Line_C*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_Soldier_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_Soldier_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature");
static_assert(sizeof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_Soldier_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature) == 0x000008, "Wrong size on UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_Soldier_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_Soldier_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature, Button) == 0x000000, "Member 'UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Button_Soldier_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature::Button' has a wrong offset!");

// Function UI_Menu_GeneralMenuScreen.UI_Menu_GeneralMenuScreen_C.BndEvt__UI_Counter_PremiumCoin_K2Node_ComponentBoundEvent_9_OnClickDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Counter_PremiumCoin_K2Node_ComponentBoundEvent_9_OnClickDelegate__DelegateSignature final
{
public:
	class UUI_Counter_C*                          Counter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Counter_PremiumCoin_K2Node_ComponentBoundEvent_9_OnClickDelegate__DelegateSignature) == 0x000008, "Wrong alignment on UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Counter_PremiumCoin_K2Node_ComponentBoundEvent_9_OnClickDelegate__DelegateSignature");
static_assert(sizeof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Counter_PremiumCoin_K2Node_ComponentBoundEvent_9_OnClickDelegate__DelegateSignature) == 0x000008, "Wrong size on UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Counter_PremiumCoin_K2Node_ComponentBoundEvent_9_OnClickDelegate__DelegateSignature");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Counter_PremiumCoin_K2Node_ComponentBoundEvent_9_OnClickDelegate__DelegateSignature, Counter) == 0x000000, "Member 'UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Counter_PremiumCoin_K2Node_ComponentBoundEvent_9_OnClickDelegate__DelegateSignature::Counter' has a wrong offset!");

// Function UI_Menu_GeneralMenuScreen.UI_Menu_GeneralMenuScreen_C.BndEvt__UI_GeneralMenuScreen_UI_Counter_Coin_K2Node_ComponentBoundEvent_8_OnClickDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Menu_GeneralMenuScreen_C_BndEvt__UI_GeneralMenuScreen_UI_Counter_Coin_K2Node_ComponentBoundEvent_8_OnClickDelegate__DelegateSignature final
{
public:
	class UUI_Counter_C*                          Counter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_GeneralMenuScreen_UI_Counter_Coin_K2Node_ComponentBoundEvent_8_OnClickDelegate__DelegateSignature) == 0x000008, "Wrong alignment on UI_Menu_GeneralMenuScreen_C_BndEvt__UI_GeneralMenuScreen_UI_Counter_Coin_K2Node_ComponentBoundEvent_8_OnClickDelegate__DelegateSignature");
static_assert(sizeof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_GeneralMenuScreen_UI_Counter_Coin_K2Node_ComponentBoundEvent_8_OnClickDelegate__DelegateSignature) == 0x000008, "Wrong size on UI_Menu_GeneralMenuScreen_C_BndEvt__UI_GeneralMenuScreen_UI_Counter_Coin_K2Node_ComponentBoundEvent_8_OnClickDelegate__DelegateSignature");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_GeneralMenuScreen_UI_Counter_Coin_K2Node_ComponentBoundEvent_8_OnClickDelegate__DelegateSignature, Counter) == 0x000000, "Member 'UI_Menu_GeneralMenuScreen_C_BndEvt__UI_GeneralMenuScreen_UI_Counter_Coin_K2Node_ComponentBoundEvent_8_OnClickDelegate__DelegateSignature::Counter' has a wrong offset!");

// Function UI_Menu_GeneralMenuScreen.UI_Menu_GeneralMenuScreen_C.BndEvt__UI_Menu_GeneralMenuScreen_UI_Button_BattlePass_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Menu_GeneralMenuScreen_UI_Button_BattlePass_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	class UUI_Button_Line_C*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Menu_GeneralMenuScreen_UI_Button_BattlePass_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Menu_GeneralMenuScreen_UI_Button_BattlePass_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Menu_GeneralMenuScreen_UI_Button_BattlePass_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong size on UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Menu_GeneralMenuScreen_UI_Button_BattlePass_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Menu_GeneralMenuScreen_UI_Button_BattlePass_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, Button) == 0x000000, "Member 'UI_Menu_GeneralMenuScreen_C_BndEvt__UI_Menu_GeneralMenuScreen_UI_Button_BattlePass_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::Button' has a wrong offset!");

// Function UI_Menu_GeneralMenuScreen.UI_Menu_GeneralMenuScreen_C.ExecuteUbergraph_UI_Menu_GeneralMenuScreen
// 0x05E8 (0x05E8 - 0x0000)
struct UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F18[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTask_Menu_GeneralMenuScreen_SetActivePage_C* CallFunc_CreateAction_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTask_Menu_GeneralMenuScreen_SetActivePage_C* CallFunc_CreateAction_ReturnValue_1;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTask_Menu_GeneralMenuScreen_SetActivePage_C* CallFunc_CreateAction_ReturnValue_2;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTask_Menu_GeneralMenuScreen_SetActivePage_C* CallFunc_CreateAction_ReturnValue_3;               // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTask_Menu_GeneralMenuScreen_SetActivePage_C* CallFunc_CreateAction_ReturnValue_4;               // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTask_Menu_GeneralMenuScreen_SetActivePage_C* CallFunc_CreateAction_ReturnValue_5;               // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FClientGetTimeResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                      CallFunc_GetTime_ReturnValue;                      // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x00D0(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_4;                   // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F19[0x5];                                     // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x0128(0x0040)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1A[0x3];                                     // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1B[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTask_Menu_GeneralMenuScreen_SetActivePage_C* CallFunc_CreateAction_ReturnValue_6;               // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response_1;                     // 0x0190(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_5;                   // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful_1;                   // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1C[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1D[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Button_Line_C*                      K2Node_ComponentBoundEvent_Button_4;               // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_Line_C*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_Line_C*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Menu_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Menu;      // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1E[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Button_Line_C*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0230(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_DynamicCast_AsUI_Button;                    // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1F[0x3];                                     // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F20[0x7];                                     // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0260(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F21[0x4];                                     // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Button_Line_C*                      K2Node_DynamicCast_AsUI_Button_Line;               // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F22[0x6];                                     // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Counter_C*                          K2Node_ComponentBoundEvent_Counter_1;              // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_CustomEvent_ModifiedData;                   // 0x0298(0x0010)(ConstParm, ReferenceParm)
	class FString                                 K2Node_CustomEvent_CustomString;                   // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_PG_GameInstance_C*                  CallFunc_GetGameInstance_MyGameIntance;            // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_KickReason_C*                       CallFunc_Create_ReturnValue;                       // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F23[0x6];                                     // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Counter_C*                          K2Node_ComponentBoundEvent_Counter;                // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x02E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x02F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_CurrencyConversion_C*               CallFunc_Create_ReturnValue_1;                     // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMultiplayerListQosServersForTitleResponse K2Node_CustomEvent_result_1;                       // 0x0318(0x0030)()
	class UObject*                                K2Node_CustomEvent_customData_3;                   // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMultiplayerListQosServersForTitleRequest K2Node_MakeStruct_MultiplayerListQosServersForTitleRequest; // 0x0350(0x0018)(NoDestructor)
	struct FPlayFabError                          K2Node_CustomEvent_error_1;                        // 0x0368(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x03B0(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F24[0x3];                                     // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x03D0(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F25[0x7];                                     // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPingQoSInfo>                   K2Node_MakeArray_Array;                            // 0x0400(0x0010)(ReferenceParm)
	class UPingQoSSubsystem*                      CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPingQoSInfo>                   K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0418(0x0010)(ReferenceParm)
	bool                                          CallFunc_Update_ReturnValue;                       // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F26[0x7];                                     // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPingQoSSubsystem*                      CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0438(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FMultiplayerListQosServersForTitleResponse& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x0448(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabMultiplayerAPI*                 CallFunc_ListQosServersForTitle_ReturnValue;       // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F27[0x7];                                     // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      Temp_struct_Variable_1;                            // 0x0468(0x0040)()
	class UObject*                                Temp_object_Variable_1;                            // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F28[0x3];                                     // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_Line_C*                      K2Node_ComponentBoundEvent_Button;                 // 0x04B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_Array_Get_Item_2;                         // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x04C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x04D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FPingQoSInfo                           K2Node_MakeStruct_PingQoSInfo;                     // 0x04E8(0x0040)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F29[0x4];                                     // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientGetTimeResult                   K2Node_CustomEvent_result;                         // 0x0530(0x0018)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x0550(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x0588(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_PG_GameInstance_C*                  CallFunc_GetGameInstance_MyGameIntance_1;          // 0x0590(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_DateTimeFromIsoString_Result;             // 0x0598(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DateTimeFromIsoString_ReturnValue;        // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F2A[0x7];                                     // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClientGameInstance*                    CallFunc_GetClientGameInstance_ReturnValue;        // 0x05A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x05B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<EModifiedData>& ModifiedData, const class FString& CustomString)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x05C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x05D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x05D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F2B[0x5];                                     // 0x05D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x05D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen) == 0x000008, "Wrong alignment on UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen");
static_assert(sizeof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen) == 0x0005E8, "Wrong size on UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, EntryPoint) == 0x000000, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_CreateAction_ReturnValue) == 0x000018, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_CreateAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_CreateAction_ReturnValue_1) == 0x000030, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_CreateAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_CreateAction_ReturnValue_2) == 0x000048, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_CreateAction_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CreateDelegate_OutputDelegate_3) == 0x000050, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_CreateAction_ReturnValue_3) == 0x000060, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_CreateAction_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CreateDelegate_OutputDelegate_4) == 0x000068, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_CreateAction_ReturnValue_4) == 0x000078, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_CreateAction_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CreateDelegate_OutputDelegate_5) == 0x000080, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_CreateAction_ReturnValue_5) == 0x000090, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_CreateAction_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CreateDelegate_OutputDelegate_6) == 0x000098, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000A8, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000B8, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_GetTime_ReturnValue) == 0x0000C8, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_GetTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CustomEvent_response) == 0x0000D0, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CustomEvent_customData_4) == 0x000110, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CustomEvent_customData_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CustomEvent_successful) == 0x000118, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_IsValid_ReturnValue) == 0x000119, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, Temp_bool_Variable) == 0x00011A, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, Temp_object_Variable) == 0x000120, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, Temp_struct_Variable) == 0x000128, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, Temp_int_Loop_Counter_Variable) == 0x000168, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_Add_IntInt_ReturnValue) == 0x00016C, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, Temp_int_Array_Index_Variable) == 0x000170, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, Temp_bool_Has_Been_Initd_Variable) == 0x000174, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, Temp_int_Loop_Counter_Variable_1) == 0x000178, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_Add_IntInt_ReturnValue_1) == 0x00017C, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, Temp_int_Array_Index_Variable_1) == 0x000180, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_CreateAction_ReturnValue_6) == 0x000188, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_CreateAction_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CustomEvent_response_1) == 0x000190, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CustomEvent_response_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CustomEvent_customData_5) == 0x0001D0, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CustomEvent_customData_5' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CustomEvent_successful_1) == 0x0001D8, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CustomEvent_successful_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_GetOwningPlayer_ReturnValue) == 0x0001E0, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_Event_IsDesignTime) == 0x0001E8, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_ComponentBoundEvent_Button_4) == 0x0001F0, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0001F8, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_ComponentBoundEvent_Button_3) == 0x000200, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000208, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_ComponentBoundEvent_Button_2) == 0x000210, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_DynamicCast_AsBP_PG_Player_State_Menu) == 0x000218, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_DynamicCast_AsBP_PG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_DynamicCast_bSuccess) == 0x000220, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_ComponentBoundEvent_Button_1) == 0x000228, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_GetAllChildren_ReturnValue) == 0x000230, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_Array_Get_Item) == 0x000240, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_DynamicCast_AsUI_Button) == 0x000248, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_DynamicCast_AsUI_Button' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_DynamicCast_bSuccess_1) == 0x000250, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_Array_Length_ReturnValue) == 0x000254, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_Less_IntInt_ReturnValue) == 0x000258, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_GetAllChildren_ReturnValue_1) == 0x000260, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_Array_Get_Item_1) == 0x000270, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_Array_Length_ReturnValue_1) == 0x000278, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_DynamicCast_AsUI_Button_Line) == 0x000280, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_DynamicCast_AsUI_Button_Line' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_DynamicCast_bSuccess_2) == 0x000288, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_Less_IntInt_ReturnValue_1) == 0x000289, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_ComponentBoundEvent_Counter_1) == 0x000290, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_ComponentBoundEvent_Counter_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CustomEvent_ModifiedData) == 0x000298, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CustomEvent_ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CustomEvent_CustomString) == 0x0002A8, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CustomEvent_CustomString' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_GetGameInstance_MyGameIntance) == 0x0002B8, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_GetGameInstance_MyGameIntance' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_GetPlayerController_ReturnValue) == 0x0002C0, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_Create_ReturnValue) == 0x0002C8, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_TextIsEmpty_ReturnValue) == 0x0002D0, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_Not_PreBool_ReturnValue) == 0x0002D1, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_ComponentBoundEvent_Counter) == 0x0002D8, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_ComponentBoundEvent_Counter' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CreateDelegate_OutputDelegate_9) == 0x0002E0, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CreateDelegate_OutputDelegate_10) == 0x0002F0, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_GetPlayerController_ReturnValue_1) == 0x000300, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_Create_ReturnValue_1) == 0x000308, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_PlayAnimationForward_ReturnValue) == 0x000310, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CustomEvent_result_1) == 0x000318, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CustomEvent_result_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CustomEvent_customData_3) == 0x000348, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CustomEvent_customData_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_MakeStruct_MultiplayerListQosServersForTitleRequest) == 0x000350, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_MakeStruct_MultiplayerListQosServersForTitleRequest' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CustomEvent_error_1) == 0x000368, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CustomEvent_error_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_CustomEvent_customData_2) == 0x0003A0, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_CustomEvent_customData_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_Array_Length_ReturnValue_2) == 0x0003A8, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, Temp_int_Loop_Counter_Variable_2) == 0x0003AC, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_Conv_StringToText_ReturnValue) == 0x0003B0, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_Less_IntInt_ReturnValue_2) == 0x0003C8, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_Add_IntInt_ReturnValue_2) == 0x0003CC, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0003D0, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_GetPlayerController_ReturnValue_2) == 0x0003E8, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x0003F0, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_DynamicCast_bSuccess_3) == 0x0003F8, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, K2Node_MakeArray_Array) == 0x000400, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000410, "Member 'UI_Menu_GeneralMenuScreen_C_ExecuteUbergraph_UI_Menu_GeneralMenuScreen::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
