#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo.UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C
// 0x0030 (0x02B0 - 0x0280)
class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DiscordHover;                                      // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Discord;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_OK;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     Data;                                              // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_Shop_SteamOverlayIsDisabled_Button_Discord_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Shop_SteamOverlayIsDisabled_Button_Discord_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Shop_SteamOverlayIsDisabled_Button_Discord_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_WarningNoPC_Button_Yes_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo(int32 EntryPoint);
	void OnPlayFabResponse_DF281D914773FAE75CBA5AB421B11AE5(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void UpdateUserData_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void UpdateUserData_Success(const struct FClientUpdateUserDataResult& Result, class UObject* CustomData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C">();
	}
	static class UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C>();
	}
};
static_assert(alignof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C) == 0x000008, "Wrong alignment on UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C");
static_assert(sizeof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C) == 0x0002B0, "Wrong size on UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C, UberGraphFrame) == 0x000280, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C, DiscordHover) == 0x000288, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C::DiscordHover' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C, Show) == 0x000290, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C::Show' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C, Button_Discord) == 0x000298, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C::Button_Discord' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C, Button_OK) == 0x0002A0, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C::Button_OK' has a wrong offset!");
static_assert(offsetof(UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C, Data) == 0x0002A8, "Member 'UUI_Menu_Solder_Weapon_Gun_Gunsmith_Selector_OldModulesInfo_C::Data' has a wrong offset!");

}

