#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage

#include "Basic.hpp"

#include "SteamCore_structs.hpp"
#include "PlayFab_structs.hpp"
#include "SlateCore_structs.hpp"
#include "POLYGON_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage.UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C.ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage
// 0x0A38 (0x0A38 - 0x0000)
struct UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FClientUpdateUserDataResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3378[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Shop_SteamOverlayIsDisabled_C*      CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response_1;                     // 0x0040(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_9;                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful_1;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3379[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x0098(0x0040)()
	TDelegate<void(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUser*                                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FMicroTxnAuthorizationResponse& Data)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x0120(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_8;                   // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_337A[0x6];                                     // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable_1;                            // 0x0178(0x0040)()
	TDelegate<void(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_MicroTxnError_C*               CallFunc_Create_ReturnValue_1;                     // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x01D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_337B[0x3];                                     // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_337C[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable_2;                            // 0x01F8(0x0040)()
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_337D[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_2;                            // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_337E[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_1;      // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_2;             // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_337F[0x4];                                     // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_2;      // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_3;             // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_1;             // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3380[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x02B8(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response_2;                     // 0x02D0(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_10;                  // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful_2;                   // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3381[0x7];                                     // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3382[0x7];                                     // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientWriteClientPlayerEventRequest   K2Node_MakeStruct_ClientWriteClientPlayerEventRequest; // 0x0338(0x0038)()
	struct FClientWriteEventResponse              K2Node_CustomEvent_result_3;                       // 0x0370(0x0018)()
	class UObject*                                K2Node_CustomEvent_customData_7;                   // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error_3;                        // 0x0390(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_6;                   // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3383[0x7];                                     // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientUpdateUserDataResult            K2Node_CustomEvent_result_2;                       // 0x03D8(0x0010)(NoDestructor)
	class UObject*                                K2Node_CustomEvent_customData_5;                   // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error_2;                        // 0x03F0(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_4;                   // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0440(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientUpdateUserDataRequest           K2Node_MakeStruct_ClientUpdateUserDataRequest;     // 0x0450(0x0030)()
	class UPlayFabClientAPI*                      CallFunc_UpdateUserData_ReturnValue;               // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3384[0x7];                                     // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1; // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3385[0x3];                                     // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x04A4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x04E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x04F0(0x0018)()
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0508(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_MainMenu_Shop_Premium_Offers_StarterPack_C* K2Node_DynamicCast_AsUI_Main_Menu_Shop_Premium_Offers_Starter_Pack; // 0x0510(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3386[0x7];                                     // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3387[0x3];                                     // 0x0529(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlayEnabled_ReturnValue;             // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0531(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3388[0x6];                                     // 0x0532(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue_1;        // 0x0538(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0548(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptRequest       K2Node_MakeStruct_ClientExecuteCloudScriptRequest; // 0x0558(0x0030)()
	class UPlayFabClientAPI*                      CallFunc_ExecuteCloudScript_ReturnValue;           // 0x0588(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result_1;                       // 0x0590(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData_3;                   // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x05F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_2;             // 0x0608(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3389[0x3];                                     // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNumberField_ReturnValue_2;             // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0624(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_338A[0x3];                                     // 0x0625(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabError                          K2Node_MakeStruct_PlayFabError;                    // 0x0628(0x0038)()
	struct FPlayFabError                          K2Node_CustomEvent_error_1;                        // 0x0660(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x0698(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FClientWriteEventResponse& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x06A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSteamUILanguage_ReturnValue;           // 0x06B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                      CallFunc_WritePlayerEvent_ReturnValue;             // 0x06C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_338B[0x7];                                     // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      Temp_struct_Variable_3;                            // 0x06D0(0x0040)()
	class UObject*                                Temp_object_Variable_3;                            // 0x0710(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMicroTxnAuthorizationResponse         K2Node_CustomEvent_Data;                           // 0x0718(0x0020)(ConstParm)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue_2;        // 0x0738(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_338C[0x7];                                     // 0x0741(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__2_Object;     // 0x0748(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptRequest       K2Node_MakeStruct_ClientExecuteCloudScriptRequest_1; // 0x0750(0x0030)()
	class UPlayFabClientAPI*                      CallFunc_ExecuteCloudScript_ReturnValue_1;         // 0x0780(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_338D[0x7];                                     // 0x0789(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result;                         // 0x0790(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x07F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x07F8(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x0830(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue_1;               // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_338E[0x3];                                     // 0x0839(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNumberField_ReturnValue_3;             // 0x083C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response_3;                     // 0x0840(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_11;                  // 0x0880(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful_3;                   // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_338F[0x3];                                     // 0x0889(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x088C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_MakeStruct_PlayFabError_1;                  // 0x0890(0x0038)()
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x08C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_PlayFabError;                   // 0x08D8(0x0038)(ConstParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0910(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0918(0x0018)()
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_2; // 0x0930(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0938(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3390[0x7];                                     // 0x0939(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0940(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0950(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3391[0x7];                                     // 0x0951(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0958(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0968(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0978(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0988(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x09A0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x09B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x09C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3392[0x7];                                     // 0x09C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_StringToDouble_ReturnValue;          // 0x09D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x09D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x09E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3393[0x3];                                     // 0x09E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x09E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x09E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x09F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3394[0x3];                                     // 0x09F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x09F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x09F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3395[0x3];                                     // 0x09F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x09FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0A00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3396[0x7];                                     // 0x0A01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0A08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast;       // 0x0A10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3397[0x4];                                     // 0x0A14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x0A18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast_1;     // 0x0A20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3398[0x4];                                     // 0x0A24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0A28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_1;                  // 0x0A30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage) == 0x000008, "Wrong alignment on UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage");
static_assert(sizeof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage) == 0x000A38, "Wrong size on UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, EntryPoint) == 0x000000, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_Create_ReturnValue) == 0x000028, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CustomEvent_response_1) == 0x000040, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CustomEvent_response_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CustomEvent_customData_9) == 0x000080, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CustomEvent_customData_9' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CustomEvent_successful_1) == 0x000088, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CustomEvent_successful_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, Temp_bool_Variable) == 0x000089, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, Temp_object_Variable) == 0x000090, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, Temp_struct_Variable) == 0x000098, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D8, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000E8, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000F0, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CreateDelegate_OutputDelegate_5) == 0x000100, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CreateDelegate_OutputDelegate_6) == 0x000110, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CustomEvent_response) == 0x000120, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CustomEvent_customData_8) == 0x000160, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CustomEvent_customData_8' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CustomEvent_successful) == 0x000168, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, Temp_bool_Variable_1) == 0x000169, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, Temp_object_Variable_1) == 0x000170, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, Temp_struct_Variable_1) == 0x000178, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001B8, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_Create_ReturnValue_1) == 0x0001C8, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CreateDelegate_OutputDelegate_8) == 0x0001D0, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, Temp_bool_True_if_break_was_hit_Variable) == 0x0001E0, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, Temp_int_Array_Index_Variable) == 0x0001E4, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_Not_PreBool_ReturnValue) == 0x0001E8, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_GetPlayerController_ReturnValue) == 0x0001F0, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, Temp_struct_Variable_2) == 0x0001F8, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_DynamicCast_AsPG_Player_State_Menu) == 0x000238, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_DynamicCast_AsPG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_DynamicCast_bSuccess) == 0x000240, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, Temp_object_Variable_2) == 0x000248, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, Temp_bool_Variable_2) == 0x000250, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000258, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_GetObjectField_ReturnValue) == 0x000260, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_GetPlayerCombinedInfo_ReturnValue_1) == 0x000268, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_GetPlayerCombinedInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_GetObjectField_ReturnValue_1) == 0x000270, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_GetObjectField_ReturnValue_2) == 0x000278, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_GetObjectField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_GetStringField_ReturnValue) == 0x000280, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_GetNumberField_ReturnValue) == 0x000290, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_GetPlayerCombinedInfo_ReturnValue_2) == 0x000298, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_GetPlayerCombinedInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0002A0, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_GetObjectField_ReturnValue_3) == 0x0002A8, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_GetObjectField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_GetNumberField_ReturnValue_1) == 0x0002B0, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_GetNumberField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_MakeArray_Array) == 0x0002B8, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0002C8, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CustomEvent_response_2) == 0x0002D0, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CustomEvent_response_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CustomEvent_customData_10) == 0x000310, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CustomEvent_customData_10' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CustomEvent_successful_2) == 0x000318, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CustomEvent_successful_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_GetPlayerController_ReturnValue_1) == 0x000320, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000328, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_DynamicCast_bSuccess_1) == 0x000330, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_MakeStruct_ClientWriteClientPlayerEventRequest) == 0x000338, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_MakeStruct_ClientWriteClientPlayerEventRequest' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CustomEvent_result_3) == 0x000370, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CustomEvent_result_3' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CustomEvent_customData_7) == 0x000388, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CustomEvent_customData_7' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CustomEvent_error_3) == 0x000390, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CustomEvent_error_3' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CustomEvent_customData_6) == 0x0003C8, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CustomEvent_customData_6' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, Temp_byte_Variable) == 0x0003D0, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CustomEvent_result_2) == 0x0003D8, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CustomEvent_result_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CustomEvent_customData_5) == 0x0003E8, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CustomEvent_customData_5' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CustomEvent_error_2) == 0x0003F0, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CustomEvent_error_2' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CustomEvent_customData_4) == 0x000428, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CustomEvent_customData_4' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_ConstructJsonObject_ReturnValue) == 0x000430, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000438, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_CreateDelegate_OutputDelegate_9) == 0x000440, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, K2Node_MakeStruct_ClientUpdateUserDataRequest) == 0x000450, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::K2Node_MakeStruct_ClientUpdateUserDataRequest' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_UpdateUserData_ReturnValue) == 0x000480, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_UpdateUserData_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_IsValid_ReturnValue) == 0x000488, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage, CallFunc_GetPlayerController_ReturnValue_2) == 0x000490, "Member 'UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage_C_ExecuteUbergraph_UI_MainMenu_Shop_Premium_Offers_StarterPack_BuyPage::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
