#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Options_InputRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Options_InputRow.UI_Options_InputRow_C
// 0x0030 (0x02B0 - 0x0280)
class UUI_Options_InputRow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             Content_Keyboard;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LabelText;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x0298(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_UI_Options_InputRow(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Options_InputRow_C">();
	}
	static class UUI_Options_InputRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Options_InputRow_C>();
	}
};
static_assert(alignof(UUI_Options_InputRow_C) == 0x000008, "Wrong alignment on UUI_Options_InputRow_C");
static_assert(sizeof(UUI_Options_InputRow_C) == 0x0002B0, "Wrong size on UUI_Options_InputRow_C");
static_assert(offsetof(UUI_Options_InputRow_C, UberGraphFrame) == 0x000280, "Member 'UUI_Options_InputRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Options_InputRow_C, Content_Keyboard) == 0x000288, "Member 'UUI_Options_InputRow_C::Content_Keyboard' has a wrong offset!");
static_assert(offsetof(UUI_Options_InputRow_C, LabelText) == 0x000290, "Member 'UUI_Options_InputRow_C::LabelText' has a wrong offset!");
static_assert(offsetof(UUI_Options_InputRow_C, Label) == 0x000298, "Member 'UUI_Options_InputRow_C::Label' has a wrong offset!");

}

