#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Options_Slider

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Options_Slider.UI_Options_Slider_C
// 0x0048 (0x02C8 - 0x0280)
class UUI_Options_Slider_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USlider*                                Slider;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   CVarName;                                          // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        MinValue;                                          // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        MaxValue;                                          // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        SelectValue;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnValueChanged;                                    // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          AutoApply;                                         // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ApplyValue();
	void BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__Slider_K2Node_ComponentBoundEvent_1_OnMouseCaptureEndEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_Options_Slider(int32 EntryPoint);
	void GetValue(double* Value);
	void OnValueChanged__DelegateSignature(double Value);
	void PreConstruct(bool IsDesignTime);
	void SetValue(double Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Options_Slider_C">();
	}
	static class UUI_Options_Slider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Options_Slider_C>();
	}
};
static_assert(alignof(UUI_Options_Slider_C) == 0x000008, "Wrong alignment on UUI_Options_Slider_C");
static_assert(sizeof(UUI_Options_Slider_C) == 0x0002C8, "Wrong size on UUI_Options_Slider_C");
static_assert(offsetof(UUI_Options_Slider_C, UberGraphFrame) == 0x000280, "Member 'UUI_Options_Slider_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Options_Slider_C, Slider) == 0x000288, "Member 'UUI_Options_Slider_C::Slider' has a wrong offset!");
static_assert(offsetof(UUI_Options_Slider_C, CVarName) == 0x000290, "Member 'UUI_Options_Slider_C::CVarName' has a wrong offset!");
static_assert(offsetof(UUI_Options_Slider_C, MinValue) == 0x000298, "Member 'UUI_Options_Slider_C::MinValue' has a wrong offset!");
static_assert(offsetof(UUI_Options_Slider_C, MaxValue) == 0x0002A0, "Member 'UUI_Options_Slider_C::MaxValue' has a wrong offset!");
static_assert(offsetof(UUI_Options_Slider_C, SelectValue) == 0x0002A8, "Member 'UUI_Options_Slider_C::SelectValue' has a wrong offset!");
static_assert(offsetof(UUI_Options_Slider_C, OnValueChanged) == 0x0002B0, "Member 'UUI_Options_Slider_C::OnValueChanged' has a wrong offset!");
static_assert(offsetof(UUI_Options_Slider_C, AutoApply) == 0x0002C0, "Member 'UUI_Options_Slider_C::AutoApply' has a wrong offset!");

}

