#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Options

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "AutoSettingsInput_structs.hpp"
#include "UMG_structs.hpp"
#include "AutoSettings_structs.hpp"


namespace SDK::Params
{

// Function UI_Options.UI_Options_C.BndEvt__ComboBoxString_255_K2Node_ComponentBoundEvent_11_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_Options_C_BndEvt__ComboBoxString_255_K2Node_ComponentBoundEvent_11_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__ComboBoxString_255_K2Node_ComponentBoundEvent_11_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__ComboBoxString_255_K2Node_ComponentBoundEvent_11_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__ComboBoxString_255_K2Node_ComponentBoundEvent_11_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on UI_Options_C_BndEvt__ComboBoxString_255_K2Node_ComponentBoundEvent_11_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__ComboBoxString_255_K2Node_ComponentBoundEvent_11_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'UI_Options_C_BndEvt__ComboBoxString_255_K2Node_ComponentBoundEvent_11_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(UI_Options_C_BndEvt__ComboBoxString_255_K2Node_ComponentBoundEvent_11_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'UI_Options_C_BndEvt__ComboBoxString_255_K2Node_ComponentBoundEvent_11_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Button_Apply_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Button_Apply_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Button_Apply_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Button_Apply_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Button_Apply_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Button_Apply_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Button_Apply_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Button_Apply_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Button_Audio_K2Node_ComponentBoundEvent_8_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Button_Audio_K2Node_ComponentBoundEvent_8_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Button_Audio_K2Node_ComponentBoundEvent_8_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Button_Audio_K2Node_ComponentBoundEvent_8_OnClick__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Button_Audio_K2Node_ComponentBoundEvent_8_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Button_Audio_K2Node_ComponentBoundEvent_8_OnClick__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Button_Audio_K2Node_ComponentBoundEvent_8_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Button_Audio_K2Node_ComponentBoundEvent_8_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Button_Back_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Button_Back_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Button_Back_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Button_Back_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Button_Back_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Button_Back_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Button_Back_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Button_Back_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Button_Controls_K2Node_ComponentBoundEvent_10_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Button_Controls_K2Node_ComponentBoundEvent_10_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Button_Controls_K2Node_ComponentBoundEvent_10_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Button_Controls_K2Node_ComponentBoundEvent_10_OnClick__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Button_Controls_K2Node_ComponentBoundEvent_10_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Button_Controls_K2Node_ComponentBoundEvent_10_OnClick__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Button_Controls_K2Node_ComponentBoundEvent_10_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Button_Controls_K2Node_ComponentBoundEvent_10_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Button_HIGH_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Button_HIGH_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Button_HIGH_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Button_HIGH_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Button_HIGH_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Button_HIGH_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Button_HIGH_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Button_HIGH_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Button_Low_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Button_Low_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Button_Low_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Button_Low_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Button_Low_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Button_Low_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Button_Low_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Button_Low_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Button_Medium_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Button_Medium_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Button_Medium_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Button_Medium_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Button_Medium_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Button_Medium_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Button_Medium_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Button_Medium_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Button_Ultra_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Button_Ultra_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Button_Ultra_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Button_Ultra_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Button_Ultra_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Button_Ultra_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Button_Ultra_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Button_Ultra_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Button_Video_K2Node_ComponentBoundEvent_9_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Button_Video_K2Node_ComponentBoundEvent_9_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Button_Video_K2Node_ComponentBoundEvent_9_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Button_Video_K2Node_ComponentBoundEvent_9_OnClick__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Button_Video_K2Node_ComponentBoundEvent_9_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Button_Video_K2Node_ComponentBoundEvent_9_OnClick__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Button_Video_K2Node_ComponentBoundEvent_9_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Button_Video_K2Node_ComponentBoundEvent_9_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Options_EffectsVolume_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Options_EffectsVolume_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Options_EffectsVolume_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Options_EffectsVolume_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Options_EffectsVolume_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Options_EffectsVolume_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Options_EffectsVolume_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Options_EffectsVolume_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Options_MasterVolume_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Options_MasterVolume_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Options_MasterVolume_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Options_MasterVolume_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Options_MasterVolume_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Options_MasterVolume_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Options_MasterVolume_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Options_MasterVolume_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Options_MusicVolume_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Options_MusicVolume_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Options_MusicVolume_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Options_MusicVolume_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Options_MusicVolume_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Options_MusicVolume_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Options_MusicVolume_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Options_MusicVolume_K2Node_ComponentBoundEvent_14_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Options_Slider_K2Node_ComponentBoundEvent_15_OnValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Options_Slider_K2Node_ComponentBoundEvent_15_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Options_Slider_K2Node_ComponentBoundEvent_15_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Options_Slider_K2Node_ComponentBoundEvent_15_OnValueChanged__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Options_Slider_K2Node_ComponentBoundEvent_15_OnValueChanged__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Options_Slider_K2Node_ComponentBoundEvent_15_OnValueChanged__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Options_Slider_K2Node_ComponentBoundEvent_15_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Options_Slider_K2Node_ComponentBoundEvent_15_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Options_UI_Button_Reset_K2Node_ComponentBoundEvent_17_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Options_UI_Button_Reset_K2Node_ComponentBoundEvent_17_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Options_UI_Button_Reset_K2Node_ComponentBoundEvent_17_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Options_UI_Button_Reset_K2Node_ComponentBoundEvent_17_OnClick__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Options_UI_Button_Reset_K2Node_ComponentBoundEvent_17_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Options_UI_Button_Reset_K2Node_ComponentBoundEvent_17_OnClick__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Options_UI_Button_Reset_K2Node_ComponentBoundEvent_17_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Options_UI_Button_Reset_K2Node_ComponentBoundEvent_17_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Options_UI_Button_Sharpen_High_K2Node_ComponentBoundEvent_18_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_High_K2Node_ComponentBoundEvent_18_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_High_K2Node_ComponentBoundEvent_18_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_High_K2Node_ComponentBoundEvent_18_OnClick__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_High_K2Node_ComponentBoundEvent_18_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_High_K2Node_ComponentBoundEvent_18_OnClick__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_High_K2Node_ComponentBoundEvent_18_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_High_K2Node_ComponentBoundEvent_18_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Options_UI_Button_Sharpen_Low_K2Node_ComponentBoundEvent_12_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_Low_K2Node_ComponentBoundEvent_12_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_Low_K2Node_ComponentBoundEvent_12_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_Low_K2Node_ComponentBoundEvent_12_OnClick__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_Low_K2Node_ComponentBoundEvent_12_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_Low_K2Node_ComponentBoundEvent_12_OnClick__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_Low_K2Node_ComponentBoundEvent_12_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_Low_K2Node_ComponentBoundEvent_12_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Options_UI_Button_Sharpen_Medium_K2Node_ComponentBoundEvent_16_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_Medium_K2Node_ComponentBoundEvent_16_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_Medium_K2Node_ComponentBoundEvent_16_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_Medium_K2Node_ComponentBoundEvent_16_OnClick__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_Medium_K2Node_ComponentBoundEvent_16_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_Medium_K2Node_ComponentBoundEvent_16_OnClick__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_Medium_K2Node_ComponentBoundEvent_16_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Options_UI_Button_Sharpen_Medium_K2Node_ComponentBoundEvent_16_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Options.UI_Options_C.BndEvt__UI_Options_UI_Options_Slider_MouseSensitivity_Scoped_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_C_BndEvt__UI_Options_UI_Options_Slider_MouseSensitivity_Scoped_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_BndEvt__UI_Options_UI_Options_Slider_MouseSensitivity_Scoped_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_C_BndEvt__UI_Options_UI_Options_Slider_MouseSensitivity_Scoped_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature");
static_assert(sizeof(UI_Options_C_BndEvt__UI_Options_UI_Options_Slider_MouseSensitivity_Scoped_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature) == 0x000008, "Wrong size on UI_Options_C_BndEvt__UI_Options_UI_Options_Slider_MouseSensitivity_Scoped_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature");
static_assert(offsetof(UI_Options_C_BndEvt__UI_Options_UI_Options_Slider_MouseSensitivity_Scoped_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'UI_Options_C_BndEvt__UI_Options_UI_Options_Slider_MouseSensitivity_Scoped_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeAimMode
// 0x0004 (0x0004 - 0x0000)
struct UI_Options_C_ChangeAimMode final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeAimMode) == 0x000004, "Wrong alignment on UI_Options_C_ChangeAimMode");
static_assert(sizeof(UI_Options_C_ChangeAimMode) == 0x000004, "Wrong size on UI_Options_C_ChangeAimMode");
static_assert(offsetof(UI_Options_C_ChangeAimMode, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeAimMode::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeAntiAliasingMethod
// 0x0004 (0x0004 - 0x0000)
struct UI_Options_C_ChangeAntiAliasingMethod final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeAntiAliasingMethod) == 0x000004, "Wrong alignment on UI_Options_C_ChangeAntiAliasingMethod");
static_assert(sizeof(UI_Options_C_ChangeAntiAliasingMethod) == 0x000004, "Wrong size on UI_Options_C_ChangeAntiAliasingMethod");
static_assert(offsetof(UI_Options_C_ChangeAntiAliasingMethod, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeAntiAliasingMethod::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeCrouchMode
// 0x0004 (0x0004 - 0x0000)
struct UI_Options_C_ChangeCrouchMode final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeCrouchMode) == 0x000004, "Wrong alignment on UI_Options_C_ChangeCrouchMode");
static_assert(sizeof(UI_Options_C_ChangeCrouchMode) == 0x000004, "Wrong size on UI_Options_C_ChangeCrouchMode");
static_assert(offsetof(UI_Options_C_ChangeCrouchMode, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeCrouchMode::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeEffectsQuality
// 0x0004 (0x0004 - 0x0000)
struct UI_Options_C_ChangeEffectsQuality final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeEffectsQuality) == 0x000004, "Wrong alignment on UI_Options_C_ChangeEffectsQuality");
static_assert(sizeof(UI_Options_C_ChangeEffectsQuality) == 0x000004, "Wrong size on UI_Options_C_ChangeEffectsQuality");
static_assert(offsetof(UI_Options_C_ChangeEffectsQuality, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeEffectsQuality::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeEffectsVolume
// 0x0004 (0x0004 - 0x0000)
struct UI_Options_C_ChangeEffectsVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeEffectsVolume) == 0x000004, "Wrong alignment on UI_Options_C_ChangeEffectsVolume");
static_assert(sizeof(UI_Options_C_ChangeEffectsVolume) == 0x000004, "Wrong size on UI_Options_C_ChangeEffectsVolume");
static_assert(offsetof(UI_Options_C_ChangeEffectsVolume, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeEffectsVolume::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeFOVEvent
// 0x0004 (0x0004 - 0x0000)
struct UI_Options_C_ChangeFOVEvent final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeFOVEvent) == 0x000004, "Wrong alignment on UI_Options_C_ChangeFOVEvent");
static_assert(sizeof(UI_Options_C_ChangeFOVEvent) == 0x000004, "Wrong size on UI_Options_C_ChangeFOVEvent");
static_assert(offsetof(UI_Options_C_ChangeFOVEvent, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeFOVEvent::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeGameFPSLimit
// 0x0004 (0x0004 - 0x0000)
struct UI_Options_C_ChangeGameFPSLimit final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeGameFPSLimit) == 0x000004, "Wrong alignment on UI_Options_C_ChangeGameFPSLimit");
static_assert(sizeof(UI_Options_C_ChangeGameFPSLimit) == 0x000004, "Wrong size on UI_Options_C_ChangeGameFPSLimit");
static_assert(offsetof(UI_Options_C_ChangeGameFPSLimit, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeGameFPSLimit::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeGeneralQuality
// 0x0004 (0x0004 - 0x0000)
struct UI_Options_C_ChangeGeneralQuality final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeGeneralQuality) == 0x000004, "Wrong alignment on UI_Options_C_ChangeGeneralQuality");
static_assert(sizeof(UI_Options_C_ChangeGeneralQuality) == 0x000004, "Wrong size on UI_Options_C_ChangeGeneralQuality");
static_assert(offsetof(UI_Options_C_ChangeGeneralQuality, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeGeneralQuality::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeInvertMouse
// 0x0001 (0x0001 - 0x0000)
struct UI_Options_C_ChangeInvertMouse final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeInvertMouse) == 0x000001, "Wrong alignment on UI_Options_C_ChangeInvertMouse");
static_assert(sizeof(UI_Options_C_ChangeInvertMouse) == 0x000001, "Wrong size on UI_Options_C_ChangeInvertMouse");
static_assert(offsetof(UI_Options_C_ChangeInvertMouse, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeInvertMouse::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeLeanMode
// 0x0004 (0x0004 - 0x0000)
struct UI_Options_C_ChangeLeanMode final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeLeanMode) == 0x000004, "Wrong alignment on UI_Options_C_ChangeLeanMode");
static_assert(sizeof(UI_Options_C_ChangeLeanMode) == 0x000004, "Wrong size on UI_Options_C_ChangeLeanMode");
static_assert(offsetof(UI_Options_C_ChangeLeanMode, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeLeanMode::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeMasterVolume
// 0x0004 (0x0004 - 0x0000)
struct UI_Options_C_ChangeMasterVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeMasterVolume) == 0x000004, "Wrong alignment on UI_Options_C_ChangeMasterVolume");
static_assert(sizeof(UI_Options_C_ChangeMasterVolume) == 0x000004, "Wrong size on UI_Options_C_ChangeMasterVolume");
static_assert(offsetof(UI_Options_C_ChangeMasterVolume, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeMasterVolume::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeMouseSensitivity
// 0x0004 (0x0004 - 0x0000)
struct UI_Options_C_ChangeMouseSensitivity final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeMouseSensitivity) == 0x000004, "Wrong alignment on UI_Options_C_ChangeMouseSensitivity");
static_assert(sizeof(UI_Options_C_ChangeMouseSensitivity) == 0x000004, "Wrong size on UI_Options_C_ChangeMouseSensitivity");
static_assert(offsetof(UI_Options_C_ChangeMouseSensitivity, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeMouseSensitivity::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeMusicVolume
// 0x0004 (0x0004 - 0x0000)
struct UI_Options_C_ChangeMusicVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeMusicVolume) == 0x000004, "Wrong alignment on UI_Options_C_ChangeMusicVolume");
static_assert(sizeof(UI_Options_C_ChangeMusicVolume) == 0x000004, "Wrong size on UI_Options_C_ChangeMusicVolume");
static_assert(offsetof(UI_Options_C_ChangeMusicVolume, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeMusicVolume::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeResolutionQuality
// 0x0004 (0x0004 - 0x0000)
struct UI_Options_C_ChangeResolutionQuality final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeResolutionQuality) == 0x000004, "Wrong alignment on UI_Options_C_ChangeResolutionQuality");
static_assert(sizeof(UI_Options_C_ChangeResolutionQuality) == 0x000004, "Wrong size on UI_Options_C_ChangeResolutionQuality");
static_assert(offsetof(UI_Options_C_ChangeResolutionQuality, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeResolutionQuality::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeSharpen
// 0x0004 (0x0004 - 0x0000)
struct UI_Options_C_ChangeSharpen final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeSharpen) == 0x000004, "Wrong alignment on UI_Options_C_ChangeSharpen");
static_assert(sizeof(UI_Options_C_ChangeSharpen) == 0x000004, "Wrong size on UI_Options_C_ChangeSharpen");
static_assert(offsetof(UI_Options_C_ChangeSharpen, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeSharpen::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeSprintCancelReload
// 0x0001 (0x0001 - 0x0000)
struct UI_Options_C_ChangeSprintCancelReload final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeSprintCancelReload) == 0x000001, "Wrong alignment on UI_Options_C_ChangeSprintCancelReload");
static_assert(sizeof(UI_Options_C_ChangeSprintCancelReload) == 0x000001, "Wrong size on UI_Options_C_ChangeSprintCancelReload");
static_assert(offsetof(UI_Options_C_ChangeSprintCancelReload, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeSprintCancelReload::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeSprintMode
// 0x0004 (0x0004 - 0x0000)
struct UI_Options_C_ChangeSprintMode final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeSprintMode) == 0x000004, "Wrong alignment on UI_Options_C_ChangeSprintMode");
static_assert(sizeof(UI_Options_C_ChangeSprintMode) == 0x000004, "Wrong size on UI_Options_C_ChangeSprintMode");
static_assert(offsetof(UI_Options_C_ChangeSprintMode, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeSprintMode::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeTextureQuality
// 0x0004 (0x0004 - 0x0000)
struct UI_Options_C_ChangeTextureQuality final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeTextureQuality) == 0x000004, "Wrong alignment on UI_Options_C_ChangeTextureQuality");
static_assert(sizeof(UI_Options_C_ChangeTextureQuality) == 0x000004, "Wrong size on UI_Options_C_ChangeTextureQuality");
static_assert(offsetof(UI_Options_C_ChangeTextureQuality, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeTextureQuality::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ChangeViewDistanceQuality
// 0x0004 (0x0004 - 0x0000)
struct UI_Options_C_ChangeViewDistanceQuality final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_C_ChangeViewDistanceQuality) == 0x000004, "Wrong alignment on UI_Options_C_ChangeViewDistanceQuality");
static_assert(sizeof(UI_Options_C_ChangeViewDistanceQuality) == 0x000004, "Wrong size on UI_Options_C_ChangeViewDistanceQuality");
static_assert(offsetof(UI_Options_C_ChangeViewDistanceQuality, NewValue) == 0x000000, "Member 'UI_Options_C_ChangeViewDistanceQuality::NewValue' has a wrong offset!");

// Function UI_Options.UI_Options_C.ExecuteUbergraph_UI_Options
// 0x05D8 (0x05D8 - 0x0000)
struct UI_Options_C_ExecuteUbergraph_UI_Options final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewValue)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewValue)>               K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewValue)>               K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewValue)>               K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewValue)>               K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewValue)>               K2Node_CreateDelegate_OutputDelegate_5;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B78[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float NewValue)>               K2Node_CreateDelegate_OutputDelegate_6;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool NewValue)>                K2Node_CreateDelegate_OutputDelegate_7;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B79[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B7A[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NewValue)>               K2Node_CreateDelegate_OutputDelegate_8;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B7B[0x2];                                     // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NewValue)>               K2Node_CreateDelegate_OutputDelegate_9;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewValue)>               K2Node_CreateDelegate_OutputDelegate_10;           // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewValue)>               K2Node_CreateDelegate_OutputDelegate_11;           // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool NewValue)>                K2Node_CreateDelegate_OutputDelegate_12;           // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B7C[0x2];                                     // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B7D[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AUltra_Dynamic_Sky_C*>           CallFunc_GetAllActorsOfClass_OutActors;            // 0x0120(0x0010)(ReferenceParm)
	class AUltra_Dynamic_Sky_C*                   CallFunc_Array_Get_Item;                           // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringCVar_ReturnValue;                // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B7E[0x2];                                     // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NewValue)>               K2Node_CreateDelegate_OutputDelegate_13;           // 0x014C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float NewValue)>               K2Node_CreateDelegate_OutputDelegate_14;           // 0x015C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B7F[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AUltra_Dynamic_Sky_C*                   Temp_wildcard_Variable;                            // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B80[0x3];                                     // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AUltra_Dynamic_Sky_C*>           CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0180(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetStringCVar_ReturnValue_1;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AUltra_Dynamic_Sky_C*                   CallFunc_Array_Get_Item_1;                         // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B81[0x6];                                     // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AUltra_Dynamic_Sky_C*                   Temp_wildcard_Variable_1;                          // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewValue)>               K2Node_CreateDelegate_OutputDelegate_15;           // 0x01B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B82[0x6];                                     // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_12;              // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue_19;                    // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B83[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_11;              // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_10;              // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_9;               // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_8;               // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_7;               // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Value;                          // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_6;               // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_5;               // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_4;               // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_18;                    // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_17;                    // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewValue_16;                    // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B84[0x4];                                     // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value_4;                // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_3;                // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0278(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0290(0x0018)()
	double                                        K2Node_ComponentBoundEvent_Value_2;                // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B85[0x4];                                     // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x02C0(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue_15;                    // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B86[0x4];                                     // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAutoSettingData                       K2Node_MakeStruct_AutoSettingData;                 // 0x02F0(0x0038)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_1;                // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerController_Base*              K2Node_DynamicCast_AsPG_Player_Controller_Base;    // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B87[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B88[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0358(0x0018)()
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0370(0x0010)(ZeroConstructor, HasGetValueTypeHash)
