#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Options_Spinner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ST_Option_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Options_Spinner.UI_Options_Spinner_C
// 0x0058 (0x02D8 - 0x0280)
class UUI_Options_Spinner_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                LeftButton;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RightButton;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Label;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 SelectValue;                                       // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   CVarName;                                          // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<struct FST_Option>                     Options;                                           // 0x02B8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	FMulticastInlineDelegateProperty_             OnChangedValue;                                    // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ApplyValue();
	void BndEvt__LeftButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__RightButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_Options_Spinner(int32 EntryPoint);
	void GetValue(class FString* NewParam);
	void Next();
	void OnChangedValue__DelegateSignature(const class FString& Value);
	void Previous();
	void SetValue(const class FString& Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Options_Spinner_C">();
	}
	static class UUI_Options_Spinner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Options_Spinner_C>();
	}
};
static_assert(alignof(UUI_Options_Spinner_C) == 0x000008, "Wrong alignment on UUI_Options_Spinner_C");
static_assert(sizeof(UUI_Options_Spinner_C) == 0x0002D8, "Wrong size on UUI_Options_Spinner_C");
static_assert(offsetof(UUI_Options_Spinner_C, UberGraphFrame) == 0x000280, "Member 'UUI_Options_Spinner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Options_Spinner_C, LeftButton) == 0x000288, "Member 'UUI_Options_Spinner_C::LeftButton' has a wrong offset!");
static_assert(offsetof(UUI_Options_Spinner_C, RightButton) == 0x000290, "Member 'UUI_Options_Spinner_C::RightButton' has a wrong offset!");
static_assert(offsetof(UUI_Options_Spinner_C, TextBlock_Label) == 0x000298, "Member 'UUI_Options_Spinner_C::TextBlock_Label' has a wrong offset!");
static_assert(offsetof(UUI_Options_Spinner_C, SelectValue) == 0x0002A0, "Member 'UUI_Options_Spinner_C::SelectValue' has a wrong offset!");
static_assert(offsetof(UUI_Options_Spinner_C, CVarName) == 0x0002B0, "Member 'UUI_Options_Spinner_C::CVarName' has a wrong offset!");
static_assert(offsetof(UUI_Options_Spinner_C, Options) == 0x0002B8, "Member 'UUI_Options_Spinner_C::Options' has a wrong offset!");
static_assert(offsetof(UUI_Options_Spinner_C, OnChangedValue) == 0x0002C8, "Member 'UUI_Options_Spinner_C::OnChangedValue' has a wrong offset!");

}

