#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Options_Spinner

#include "Basic.hpp"

#include "AutoSettings_structs.hpp"
#include "ST_Option_structs.hpp"


namespace SDK::Params
{

// Function UI_Options_Spinner.UI_Options_Spinner_C.ApplyValue
// 0x0040 (0x0040 - 0x0000)
struct UI_Options_Spinner_C_ApplyValue final
{
public:
	struct FAutoSettingData                       K2Node_MakeStruct_AutoSettingData;                 // 0x0000(0x0038)()
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_Spinner_C_ApplyValue) == 0x000008, "Wrong alignment on UI_Options_Spinner_C_ApplyValue");
static_assert(sizeof(UI_Options_Spinner_C_ApplyValue) == 0x000040, "Wrong size on UI_Options_Spinner_C_ApplyValue");
static_assert(offsetof(UI_Options_Spinner_C_ApplyValue, K2Node_MakeStruct_AutoSettingData) == 0x000000, "Member 'UI_Options_Spinner_C_ApplyValue::K2Node_MakeStruct_AutoSettingData' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_ApplyValue, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000038, "Member 'UI_Options_Spinner_C_ApplyValue::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");

// Function UI_Options_Spinner.UI_Options_Spinner_C.ExecuteUbergraph_UI_Options_Spinner
// 0x0018 (0x0018 - 0x0000)
struct UI_Options_Spinner_C_ExecuteUbergraph_UI_Options_Spinner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38F7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringCVar_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_Spinner_C_ExecuteUbergraph_UI_Options_Spinner) == 0x000008, "Wrong alignment on UI_Options_Spinner_C_ExecuteUbergraph_UI_Options_Spinner");
static_assert(sizeof(UI_Options_Spinner_C_ExecuteUbergraph_UI_Options_Spinner) == 0x000018, "Wrong size on UI_Options_Spinner_C_ExecuteUbergraph_UI_Options_Spinner");
static_assert(offsetof(UI_Options_Spinner_C_ExecuteUbergraph_UI_Options_Spinner, EntryPoint) == 0x000000, "Member 'UI_Options_Spinner_C_ExecuteUbergraph_UI_Options_Spinner::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_ExecuteUbergraph_UI_Options_Spinner, CallFunc_GetStringCVar_ReturnValue) == 0x000008, "Member 'UI_Options_Spinner_C_ExecuteUbergraph_UI_Options_Spinner::CallFunc_GetStringCVar_ReturnValue' has a wrong offset!");

// Function UI_Options_Spinner.UI_Options_Spinner_C.GetValue
// 0x0010 (0x0010 - 0x0000)
struct UI_Options_Spinner_C_GetValue final
{
public:
	class FString                                 NewParam;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_Spinner_C_GetValue) == 0x000008, "Wrong alignment on UI_Options_Spinner_C_GetValue");
static_assert(sizeof(UI_Options_Spinner_C_GetValue) == 0x000010, "Wrong size on UI_Options_Spinner_C_GetValue");
static_assert(offsetof(UI_Options_Spinner_C_GetValue, NewParam) == 0x000000, "Member 'UI_Options_Spinner_C_GetValue::NewParam' has a wrong offset!");

// Function UI_Options_Spinner.UI_Options_Spinner_C.Next
// 0x0050 (0x0050 - 0x0000)
struct UI_Options_Spinner_C_Next final
{
public:
	int32                                         L_Index;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38F8[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_Option                             CallFunc_Array_Get_Item;                           // 0x0018(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38F9[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_Spinner_C_Next) == 0x000008, "Wrong alignment on UI_Options_Spinner_C_Next");
static_assert(sizeof(UI_Options_Spinner_C_Next) == 0x000050, "Wrong size on UI_Options_Spinner_C_Next");
static_assert(offsetof(UI_Options_Spinner_C_Next, L_Index) == 0x000000, "Member 'UI_Options_Spinner_C_Next::L_Index' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Next, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UI_Options_Spinner_C_Next::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Next, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UI_Options_Spinner_C_Next::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Next, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UI_Options_Spinner_C_Next::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Next, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'UI_Options_Spinner_C_Next::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Next, CallFunc_Array_Get_Item) == 0x000018, "Member 'UI_Options_Spinner_C_Next::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Next, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'UI_Options_Spinner_C_Next::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Next, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'UI_Options_Spinner_C_Next::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Next, CallFunc_Add_IntInt_ReturnValue_2) == 0x000048, "Member 'UI_Options_Spinner_C_Next::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Next, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00004C, "Member 'UI_Options_Spinner_C_Next::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Next, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00004D, "Member 'UI_Options_Spinner_C_Next::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function UI_Options_Spinner.UI_Options_Spinner_C.OnChangedValue__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_Options_Spinner_C_OnChangedValue__DelegateSignature final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_Spinner_C_OnChangedValue__DelegateSignature) == 0x000008, "Wrong alignment on UI_Options_Spinner_C_OnChangedValue__DelegateSignature");
static_assert(sizeof(UI_Options_Spinner_C_OnChangedValue__DelegateSignature) == 0x000010, "Wrong size on UI_Options_Spinner_C_OnChangedValue__DelegateSignature");
static_assert(offsetof(UI_Options_Spinner_C_OnChangedValue__DelegateSignature, Value) == 0x000000, "Member 'UI_Options_Spinner_C_OnChangedValue__DelegateSignature::Value' has a wrong offset!");

// Function UI_Options_Spinner.UI_Options_Spinner_C.Previous
// 0x0050 (0x0050 - 0x0000)
struct UI_Options_Spinner_C_Previous final
{
public:
	int32                                         L_Index;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38FA[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_Option                             CallFunc_Array_Get_Item;                           // 0x0020(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_Spinner_C_Previous) == 0x000008, "Wrong alignment on UI_Options_Spinner_C_Previous");
static_assert(sizeof(UI_Options_Spinner_C_Previous) == 0x000050, "Wrong size on UI_Options_Spinner_C_Previous");
static_assert(offsetof(UI_Options_Spinner_C_Previous, L_Index) == 0x000000, "Member 'UI_Options_Spinner_C_Previous::L_Index' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Previous, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UI_Options_Spinner_C_Previous::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Previous, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UI_Options_Spinner_C_Previous::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Previous, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UI_Options_Spinner_C_Previous::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Previous, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'UI_Options_Spinner_C_Previous::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Previous, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000014, "Member 'UI_Options_Spinner_C_Previous::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Previous, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000018, "Member 'UI_Options_Spinner_C_Previous::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Previous, CallFunc_Array_Get_Item) == 0x000020, "Member 'UI_Options_Spinner_C_Previous::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Previous, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'UI_Options_Spinner_C_Previous::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Previous, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'UI_Options_Spinner_C_Previous::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_Previous, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00004D, "Member 'UI_Options_Spinner_C_Previous::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function UI_Options_Spinner.UI_Options_Spinner_C.SetValue
// 0x0078 (0x0078 - 0x0000)
struct UI_Options_Spinner_C_SetValue final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         L_Index;                                           // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38FB[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 L_Value;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38FC[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38FD[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38FE[0x2];                                     // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_Option                             CallFunc_Array_Get_Item;                           // 0x0048(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_Spinner_C_SetValue) == 0x000008, "Wrong alignment on UI_Options_Spinner_C_SetValue");
static_assert(sizeof(UI_Options_Spinner_C_SetValue) == 0x000078, "Wrong size on UI_Options_Spinner_C_SetValue");
static_assert(offsetof(UI_Options_Spinner_C_SetValue, Value) == 0x000000, "Member 'UI_Options_Spinner_C_SetValue::Value' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_SetValue, L_Index) == 0x000010, "Member 'UI_Options_Spinner_C_SetValue::L_Index' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_SetValue, L_Value) == 0x000018, "Member 'UI_Options_Spinner_C_SetValue::L_Value' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_SetValue, Temp_bool_True_if_break_was_hit_Variable) == 0x000028, "Member 'UI_Options_Spinner_C_SetValue::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_SetValue, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'UI_Options_Spinner_C_SetValue::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_SetValue, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'UI_Options_Spinner_C_SetValue::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_SetValue, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'UI_Options_Spinner_C_SetValue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_SetValue, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'UI_Options_Spinner_C_SetValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_SetValue, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'UI_Options_Spinner_C_SetValue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_SetValue, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'UI_Options_Spinner_C_SetValue::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_SetValue, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000044, "Member 'UI_Options_Spinner_C_SetValue::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_SetValue, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000045, "Member 'UI_Options_Spinner_C_SetValue::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_SetValue, CallFunc_Array_Get_Item) == 0x000048, "Member 'UI_Options_Spinner_C_SetValue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_SetValue, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'UI_Options_Spinner_C_SetValue::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_SetValue, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'UI_Options_Spinner_C_SetValue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_SetValue, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000075, "Member 'UI_Options_Spinner_C_SetValue::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Options_Spinner_C_SetValue, CallFunc_BooleanAND_ReturnValue) == 0x000076, "Member 'UI_Options_Spinner_C_SetValue::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

