#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Options_InputRow

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_Options_InputRow.UI_Options_InputRow_C.ExecuteUbergraph_UI_Options_InputRow
// 0x0008 (0x0008 - 0x0000)
struct UI_Options_InputRow_C_ExecuteUbergraph_UI_Options_InputRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_InputRow_C_ExecuteUbergraph_UI_Options_InputRow) == 0x000004, "Wrong alignment on UI_Options_InputRow_C_ExecuteUbergraph_UI_Options_InputRow");
static_assert(sizeof(UI_Options_InputRow_C_ExecuteUbergraph_UI_Options_InputRow) == 0x000008, "Wrong size on UI_Options_InputRow_C_ExecuteUbergraph_UI_Options_InputRow");
static_assert(offsetof(UI_Options_InputRow_C_ExecuteUbergraph_UI_Options_InputRow, EntryPoint) == 0x000000, "Member 'UI_Options_InputRow_C_ExecuteUbergraph_UI_Options_InputRow::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Options_InputRow_C_ExecuteUbergraph_UI_Options_InputRow, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UI_Options_InputRow_C_ExecuteUbergraph_UI_Options_InputRow::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Options_InputRow_C_ExecuteUbergraph_UI_Options_InputRow, CallFunc_TextIsEmpty_ReturnValue) == 0x000005, "Member 'UI_Options_InputRow_C_ExecuteUbergraph_UI_Options_InputRow::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Options_InputRow_C_ExecuteUbergraph_UI_Options_InputRow, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'UI_Options_InputRow_C_ExecuteUbergraph_UI_Options_InputRow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function UI_Options_InputRow.UI_Options_InputRow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Options_InputRow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Options_InputRow_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Options_InputRow_C_PreConstruct");
static_assert(sizeof(UI_Options_InputRow_C_PreConstruct) == 0x000001, "Wrong size on UI_Options_InputRow_C_PreConstruct");
static_assert(offsetof(UI_Options_InputRow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Options_InputRow_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

