#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PromoCode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_PromoCode.UI_PromoCode_C
// 0x0040 (0x02C0 - 0x0280)
class UUI_PromoCode_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowErrorMessage;                                  // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Cancel;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_OK;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Redeem;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_Code;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ErrorMessage;                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Main;                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ActivatePromoCode_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void ActivatePromoCode_Success(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData);
	void BndEvt__UI_PromoCode_Button_Cancel_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_PromoCode_Button_OK_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_PromoCode_Button_Redeem_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_UI_PromoCode(int32 EntryPoint);
	void GiveRewardForPromoCode(TArray<class UPlayFabJsonObject*>& GrantedItems);
	void OnPlayFabResponse_A63AC9924A800319BAD27F87EEB79850(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_PromoCode_C">();
	}
	static class UUI_PromoCode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_PromoCode_C>();
	}
};
static_assert(alignof(UUI_PromoCode_C) == 0x000008, "Wrong alignment on UUI_PromoCode_C");
static_assert(sizeof(UUI_PromoCode_C) == 0x0002C0, "Wrong size on UUI_PromoCode_C");
static_assert(offsetof(UUI_PromoCode_C, UberGraphFrame) == 0x000280, "Member 'UUI_PromoCode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_PromoCode_C, ShowErrorMessage) == 0x000288, "Member 'UUI_PromoCode_C::ShowErrorMessage' has a wrong offset!");
static_assert(offsetof(UUI_PromoCode_C, Button_Cancel) == 0x000290, "Member 'UUI_PromoCode_C::Button_Cancel' has a wrong offset!");
static_assert(offsetof(UUI_PromoCode_C, Button_OK) == 0x000298, "Member 'UUI_PromoCode_C::Button_OK' has a wrong offset!");
static_assert(offsetof(UUI_PromoCode_C, Button_Redeem) == 0x0002A0, "Member 'UUI_PromoCode_C::Button_Redeem' has a wrong offset!");
static_assert(offsetof(UUI_PromoCode_C, EditableTextBox_Code) == 0x0002A8, "Member 'UUI_PromoCode_C::EditableTextBox_Code' has a wrong offset!");
static_assert(offsetof(UUI_PromoCode_C, TextBlock_ErrorMessage) == 0x0002B0, "Member 'UUI_PromoCode_C::TextBlock_ErrorMessage' has a wrong offset!");
static_assert(offsetof(UUI_PromoCode_C, WidgetSwitcher_Main) == 0x0002B8, "Member 'UUI_PromoCode_C::WidgetSwitcher_Main' has a wrong offset!");

}

