#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PlayerMarker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_PlayerMarker.UI_PlayerMarker_C
// 0x0070 (0x02F0 - 0x0280)
class UUI_PlayerMarker_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HealthProtectionDisabled;                          // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HealthProtectionScale;                             // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HiddenAnimation;                                   // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Illumination_01;                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Illumination_02;                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HealthProtection;                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlayerStatus_1;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlayerStatus_2;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Health;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PlayerName;                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_PlayerStatus;                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APG_Game_Character*                     OwnerCharacter;                                    // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_PlayerMarker(int32 EntryPoint);
	void OnChangeHealth_Event();
	void OnHealthProtection_Event();
	void OnSetPlayerState_Event();
	void SetActiveIndex(int32 Param_Index);
	void SetOwnerCharacter(class APG_Game_Character* Param_OwnerCharacter);
	void SetupAsEnemy();
	void SetupAsFriendly();
	void SetupAsSquadMember();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_PlayerMarker_C">();
	}
	static class UUI_PlayerMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_PlayerMarker_C>();
	}
};
static_assert(alignof(UUI_PlayerMarker_C) == 0x000008, "Wrong alignment on UUI_PlayerMarker_C");
static_assert(sizeof(UUI_PlayerMarker_C) == 0x0002F0, "Wrong size on UUI_PlayerMarker_C");
static_assert(offsetof(UUI_PlayerMarker_C, UberGraphFrame) == 0x000280, "Member 'UUI_PlayerMarker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_PlayerMarker_C, HealthProtectionDisabled) == 0x000288, "Member 'UUI_PlayerMarker_C::HealthProtectionDisabled' has a wrong offset!");
static_assert(offsetof(UUI_PlayerMarker_C, HealthProtectionScale) == 0x000290, "Member 'UUI_PlayerMarker_C::HealthProtectionScale' has a wrong offset!");
static_assert(offsetof(UUI_PlayerMarker_C, HiddenAnimation) == 0x000298, "Member 'UUI_PlayerMarker_C::HiddenAnimation' has a wrong offset!");
static_assert(offsetof(UUI_PlayerMarker_C, Border_Illumination_01) == 0x0002A0, "Member 'UUI_PlayerMarker_C::Border_Illumination_01' has a wrong offset!");
static_assert(offsetof(UUI_PlayerMarker_C, Border_Illumination_02) == 0x0002A8, "Member 'UUI_PlayerMarker_C::Border_Illumination_02' has a wrong offset!");
static_assert(offsetof(UUI_PlayerMarker_C, Image_HealthProtection) == 0x0002B0, "Member 'UUI_PlayerMarker_C::Image_HealthProtection' has a wrong offset!");
static_assert(offsetof(UUI_PlayerMarker_C, Image_PlayerStatus_1) == 0x0002B8, "Member 'UUI_PlayerMarker_C::Image_PlayerStatus_1' has a wrong offset!");
static_assert(offsetof(UUI_PlayerMarker_C, Image_PlayerStatus_2) == 0x0002C0, "Member 'UUI_PlayerMarker_C::Image_PlayerStatus_2' has a wrong offset!");
static_assert(offsetof(UUI_PlayerMarker_C, ProgressBar_Health) == 0x0002C8, "Member 'UUI_PlayerMarker_C::ProgressBar_Health' has a wrong offset!");
static_assert(offsetof(UUI_PlayerMarker_C, TextBlock_PlayerName) == 0x0002D0, "Member 'UUI_PlayerMarker_C::TextBlock_PlayerName' has a wrong offset!");
static_assert(offsetof(UUI_PlayerMarker_C, WidgetSwitcher) == 0x0002D8, "Member 'UUI_PlayerMarker_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UUI_PlayerMarker_C, WidgetSwitcher_PlayerStatus) == 0x0002E0, "Member 'UUI_PlayerMarker_C::WidgetSwitcher_PlayerStatus' has a wrong offset!");
static_assert(offsetof(UUI_PlayerMarker_C, OwnerCharacter) == 0x0002E8, "Member 'UUI_PlayerMarker_C::OwnerCharacter' has a wrong offset!");

}

