#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PopUpMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_PopUpMenu.UI_PopUpMenu_C
// 0x0038 (0x02B8 - 0x0280)
class UUI_PopUpMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Discord;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Hide;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Options;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_PromoCode;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Quit;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__UI_PopUpMenu_Button_Discord_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_PopUpMenu_Button_Hide_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__UI_PopUpMenu_Button_Options_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_PopUpMenu_Button_PromoCode_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_PopUpMenu_Button_Quit_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_PopUpMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_PopUpMenu_C">();
	}
	static class UUI_PopUpMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_PopUpMenu_C>();
	}
};
static_assert(alignof(UUI_PopUpMenu_C) == 0x000008, "Wrong alignment on UUI_PopUpMenu_C");
static_assert(sizeof(UUI_PopUpMenu_C) == 0x0002B8, "Wrong size on UUI_PopUpMenu_C");
static_assert(offsetof(UUI_PopUpMenu_C, UberGraphFrame) == 0x000280, "Member 'UUI_PopUpMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_PopUpMenu_C, Show) == 0x000288, "Member 'UUI_PopUpMenu_C::Show' has a wrong offset!");
static_assert(offsetof(UUI_PopUpMenu_C, Button_Discord) == 0x000290, "Member 'UUI_PopUpMenu_C::Button_Discord' has a wrong offset!");
static_assert(offsetof(UUI_PopUpMenu_C, Button_Hide) == 0x000298, "Member 'UUI_PopUpMenu_C::Button_Hide' has a wrong offset!");
static_assert(offsetof(UUI_PopUpMenu_C, Button_Options) == 0x0002A0, "Member 'UUI_PopUpMenu_C::Button_Options' has a wrong offset!");
static_assert(offsetof(UUI_PopUpMenu_C, Button_PromoCode) == 0x0002A8, "Member 'UUI_PopUpMenu_C::Button_PromoCode' has a wrong offset!");
static_assert(offsetof(UUI_PopUpMenu_C, Button_Quit) == 0x0002B0, "Member 'UUI_PopUpMenu_C::Button_Quit' has a wrong offset!");

}

