#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PlayerMarker

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_PlayerMarker.UI_PlayerMarker_C.ExecuteUbergraph_UI_PlayerMarker
// 0x00B8 (0x00B8 - 0x0000)
struct UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9C[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9D[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APG_Game_Character*                     K2Node_CustomEvent_OwnerCharacter;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9E[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
	int32                                         CallFunc_GetHealth_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHealthProtection_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9F[0x2];                                     // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue_1;       // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHealthProtection_ReturnValue_1;        // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA0[0x1];                                     // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker) == 0x000008, "Wrong alignment on UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker");
static_assert(sizeof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker) == 0x0000B8, "Wrong size on UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, EntryPoint) == 0x000000, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000004, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, Temp_bool_Variable) == 0x00003C, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, Temp_int_Variable) == 0x000040, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, Temp_int_Variable_1) == 0x000044, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, K2Node_CustomEvent_OwnerCharacter) == 0x000048, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::K2Node_CustomEvent_OwnerCharacter' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, CallFunc_GetPlayerName_ReturnValue) == 0x000050, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, CallFunc_GetHealth_ReturnValue) == 0x000080, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, K2Node_CustomEvent_Index) == 0x000084, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000088, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000090, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, CallFunc_GetHealthProtection_ReturnValue) == 0x000098, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::CallFunc_GetHealthProtection_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, CallFunc_Not_PreBool_ReturnValue) == 0x000099, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, CallFunc_GetActiveWidgetIndex_ReturnValue_1) == 0x00009C, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::CallFunc_GetActiveWidgetIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, CallFunc_BooleanAND_ReturnValue) == 0x0000A1, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, CallFunc_GetHealthProtection_ReturnValue_1) == 0x0000A2, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::CallFunc_GetHealthProtection_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, K2Node_Select_Default) == 0x0000A4, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000A8, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0000B0, "Member 'UI_PlayerMarker_C_ExecuteUbergraph_UI_PlayerMarker::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function UI_PlayerMarker.UI_PlayerMarker_C.SetActiveIndex
// 0x0004 (0x0004 - 0x0000)
struct UI_PlayerMarker_C_SetActiveIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PlayerMarker_C_SetActiveIndex) == 0x000004, "Wrong alignment on UI_PlayerMarker_C_SetActiveIndex");
static_assert(sizeof(UI_PlayerMarker_C_SetActiveIndex) == 0x000004, "Wrong size on UI_PlayerMarker_C_SetActiveIndex");
static_assert(offsetof(UI_PlayerMarker_C_SetActiveIndex, Param_Index) == 0x000000, "Member 'UI_PlayerMarker_C_SetActiveIndex::Param_Index' has a wrong offset!");

// Function UI_PlayerMarker.UI_PlayerMarker_C.SetOwnerCharacter
// 0x0008 (0x0008 - 0x0000)
struct UI_PlayerMarker_C_SetOwnerCharacter final
{
public:
	class APG_Game_Character*                     Param_OwnerCharacter;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PlayerMarker_C_SetOwnerCharacter) == 0x000008, "Wrong alignment on UI_PlayerMarker_C_SetOwnerCharacter");
static_assert(sizeof(UI_PlayerMarker_C_SetOwnerCharacter) == 0x000008, "Wrong size on UI_PlayerMarker_C_SetOwnerCharacter");
static_assert(offsetof(UI_PlayerMarker_C_SetOwnerCharacter, Param_OwnerCharacter) == 0x000000, "Member 'UI_PlayerMarker_C_SetOwnerCharacter::Param_OwnerCharacter' has a wrong offset!");

// Function UI_PlayerMarker.UI_PlayerMarker_C.SetupAsEnemy
// 0x0014 (0x0014 - 0x0000)
struct UI_PlayerMarker_C_SetupAsEnemy final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
};
static_assert(alignof(UI_PlayerMarker_C_SetupAsEnemy) == 0x000004, "Wrong alignment on UI_PlayerMarker_C_SetupAsEnemy");
static_assert(sizeof(UI_PlayerMarker_C_SetupAsEnemy) == 0x000014, "Wrong size on UI_PlayerMarker_C_SetupAsEnemy");
static_assert(offsetof(UI_PlayerMarker_C_SetupAsEnemy, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'UI_PlayerMarker_C_SetupAsEnemy::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function UI_PlayerMarker.UI_PlayerMarker_C.SetupAsFriendly
// 0x0014 (0x0014 - 0x0000)
struct UI_PlayerMarker_C_SetupAsFriendly final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
};
static_assert(alignof(UI_PlayerMarker_C_SetupAsFriendly) == 0x000004, "Wrong alignment on UI_PlayerMarker_C_SetupAsFriendly");
static_assert(sizeof(UI_PlayerMarker_C_SetupAsFriendly) == 0x000014, "Wrong size on UI_PlayerMarker_C_SetupAsFriendly");
static_assert(offsetof(UI_PlayerMarker_C_SetupAsFriendly, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'UI_PlayerMarker_C_SetupAsFriendly::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function UI_PlayerMarker.UI_PlayerMarker_C.SetupAsSquadMember
// 0x0014 (0x0014 - 0x0000)
struct UI_PlayerMarker_C_SetupAsSquadMember final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
};
static_assert(alignof(UI_PlayerMarker_C_SetupAsSquadMember) == 0x000004, "Wrong alignment on UI_PlayerMarker_C_SetupAsSquadMember");
static_assert(sizeof(UI_PlayerMarker_C_SetupAsSquadMember) == 0x000014, "Wrong size on UI_PlayerMarker_C_SetupAsSquadMember");
static_assert(offsetof(UI_PlayerMarker_C_SetupAsSquadMember, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'UI_PlayerMarker_C_SetupAsSquadMember::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

