#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PopUpMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_PopUpMenu.UI_PopUpMenu_C.ExecuteUbergraph_UI_PopUpMenu
// 0x0048 (0x0048 - 0x0000)
struct UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_ExitGame_C*                         CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_PromoCode_C*                        CallFunc_Create_ReturnValue_1;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu) == 0x000008, "Wrong alignment on UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu");
static_assert(sizeof(UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu) == 0x000048, "Wrong size on UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu");
static_assert(offsetof(UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu, EntryPoint) == 0x000000, "Member 'UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu, CallFunc_Create_ReturnValue) == 0x000018, "Member 'UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000020, "Member 'UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu, CallFunc_Create_ReturnValue_1) == 0x000028, "Member 'UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000038, "Member 'UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'UI_PopUpMenu_C_ExecuteUbergraph_UI_PopUpMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

