#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PromoCode

#include "Basic.hpp"

#include "POLYGON_structs.hpp"
#include "PlayFab_structs.hpp"


namespace SDK::Params
{

// Function UI_PromoCode.UI_PromoCode_C.ActivatePromoCode_Failure
// 0x0040 (0x0040 - 0x0000)
struct UI_PromoCode_C_ActivatePromoCode_Failure final
{
public:
	struct FPlayFabError                          Error;                                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PromoCode_C_ActivatePromoCode_Failure) == 0x000008, "Wrong alignment on UI_PromoCode_C_ActivatePromoCode_Failure");
static_assert(sizeof(UI_PromoCode_C_ActivatePromoCode_Failure) == 0x000040, "Wrong size on UI_PromoCode_C_ActivatePromoCode_Failure");
static_assert(offsetof(UI_PromoCode_C_ActivatePromoCode_Failure, Error) == 0x000000, "Member 'UI_PromoCode_C_ActivatePromoCode_Failure::Error' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ActivatePromoCode_Failure, CustomData) == 0x000038, "Member 'UI_PromoCode_C_ActivatePromoCode_Failure::CustomData' has a wrong offset!");

// Function UI_PromoCode.UI_PromoCode_C.ActivatePromoCode_Success
// 0x0068 (0x0068 - 0x0000)
struct UI_PromoCode_C_ActivatePromoCode_Success final
{
public:
	struct FClientExecuteCloudScriptResult        Result;                                            // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PromoCode_C_ActivatePromoCode_Success) == 0x000008, "Wrong alignment on UI_PromoCode_C_ActivatePromoCode_Success");
static_assert(sizeof(UI_PromoCode_C_ActivatePromoCode_Success) == 0x000068, "Wrong size on UI_PromoCode_C_ActivatePromoCode_Success");
static_assert(offsetof(UI_PromoCode_C_ActivatePromoCode_Success, Result) == 0x000000, "Member 'UI_PromoCode_C_ActivatePromoCode_Success::Result' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ActivatePromoCode_Success, CustomData) == 0x000060, "Member 'UI_PromoCode_C_ActivatePromoCode_Success::CustomData' has a wrong offset!");

// Function UI_PromoCode.UI_PromoCode_C.ExecuteUbergraph_UI_PromoCode
// 0x0320 (0x0320 - 0x0000)
struct UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3844[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x0020(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3845[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x0078(0x0040)()
	TDelegate<void(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate;              // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3846[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x00E0(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x00F8(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0110(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0128(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0140(0x0018)()
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0168(0x0018)()
	struct FClientExecuteCloudScriptRequest       K2Node_MakeStruct_ClientExecuteCloudScriptRequest; // 0x0180(0x0030)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                      CallFunc_ExecuteCloudScript_ReturnValue;           // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3847[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result;                         // 0x01D0(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x0238(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue;          // 0x0280(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0290(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x02A8(0x0018)()
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3848[0x3];                                     // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue;                        // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3849[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x02D8(0x0018)()
	class APG_PlayerController_Menu*              K2Node_DynamicCast_AsPG_Player_Controller_Menu;    // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384A[0x3];                                     // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x02FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384B[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode) == 0x000008, "Wrong alignment on UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode");
static_assert(sizeof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode) == 0x000320, "Wrong size on UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, EntryPoint) == 0x000000, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, K2Node_CustomEvent_response) == 0x000020, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, K2Node_CustomEvent_customData_2) == 0x000060, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::K2Node_CustomEvent_customData_2' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, K2Node_CustomEvent_successful) == 0x000068, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, CallFunc_TextIsEmpty_ReturnValue) == 0x000069, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, Temp_bool_Variable) == 0x00006A, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, CallFunc_Not_PreBool_ReturnValue) == 0x00006B, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, Temp_object_Variable) == 0x000070, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, Temp_struct_Variable) == 0x000078, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C8, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, Temp_int_Variable) == 0x0000D8, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, Temp_text_Variable) == 0x0000E0, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, Temp_text_Variable_1) == 0x0000F8, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, Temp_text_Variable_2) == 0x000110, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, Temp_text_Variable_3) == 0x000128, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, Temp_text_Variable_4) == 0x000140, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, CallFunc_ConstructJsonObject_ReturnValue) == 0x000158, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000160, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, CallFunc_GetText_ReturnValue_1) == 0x000168, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, K2Node_MakeStruct_ClientExecuteCloudScriptRequest) == 0x000180, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::K2Node_MakeStruct_ClientExecuteCloudScriptRequest' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, CallFunc_Conv_TextToString_ReturnValue) == 0x0001B0, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, CallFunc_ExecuteCloudScript_ReturnValue) == 0x0001C0, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::CallFunc_ExecuteCloudScript_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, CallFunc_IsValid_ReturnValue) == 0x0001C8, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, K2Node_CustomEvent_result) == 0x0001D0, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::K2Node_CustomEvent_result' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, K2Node_CustomEvent_customData_1) == 0x000230, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::K2Node_CustomEvent_customData_1' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, K2Node_CustomEvent_error) == 0x000238, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::K2Node_CustomEvent_error' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, K2Node_CustomEvent_customData) == 0x000270, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::K2Node_CustomEvent_customData' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, K2Node_LowEntry_LocalVariable_Value__1_Object) == 0x000278, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::K2Node_LowEntry_LocalVariable_Value__1_Object' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, CallFunc_GetObjectArrayField_ReturnValue) == 0x000280, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::CallFunc_GetObjectArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, CallFunc_Conv_StringToText_ReturnValue) == 0x000290, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0002A8, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, CallFunc_GetNumberField_ReturnValue) == 0x0002C0, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, CallFunc_GetBoolField_ReturnValue) == 0x0002C4, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::CallFunc_GetBoolField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, CallFunc_Round_ReturnValue) == 0x0002C8, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, CallFunc_GetOwningPlayer_ReturnValue) == 0x0002D0, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, K2Node_Select_Default) == 0x0002D8, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, K2Node_DynamicCast_AsPG_Player_Controller_Menu) == 0x0002F0, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::K2Node_DynamicCast_AsPG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, K2Node_DynamicCast_bSuccess) == 0x0002F8, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002FC, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, CallFunc_PlayAnimationForward_ReturnValue) == 0x000310, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode, CallFunc_Round_A_ImplicitCast) == 0x000318, "Member 'UI_PromoCode_C_ExecuteUbergraph_UI_PromoCode::CallFunc_Round_A_ImplicitCast' has a wrong offset!");

// Function UI_PromoCode.UI_PromoCode_C.GiveRewardForPromoCode
// 0x00B8 (0x00B8 - 0x0000)
struct UI_PromoCode_C_GiveRewardForPromoCode final
{
public:
	TArray<class UPlayFabJsonObject*>             GrantedItems;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class ABP_PG_PlayerState_Menu_C*              L_PlayerState;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>             L_GrantedItems;                                    // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384C[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue;          // 0x0050(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384D[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384E[0x2];                                     // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ConstParm, ReferenceParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Menu_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Menu;      // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PromoCode_C_GiveRewardForPromoCode) == 0x000008, "Wrong alignment on UI_PromoCode_C_GiveRewardForPromoCode");
static_assert(sizeof(UI_PromoCode_C_GiveRewardForPromoCode) == 0x0000B8, "Wrong size on UI_PromoCode_C_GiveRewardForPromoCode");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, GrantedItems) == 0x000000, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::GrantedItems' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, L_PlayerState) == 0x000010, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::L_PlayerState' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, L_GrantedItems) == 0x000018, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::L_GrantedItems' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, Temp_int_Array_Index_Variable) == 0x000028, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000038, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, CallFunc_GetPlayerCombinedInfo_ReturnValue_1) == 0x000040, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::CallFunc_GetPlayerCombinedInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, CallFunc_Array_Get_Item) == 0x000048, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, CallFunc_GetObjectArrayField_ReturnValue) == 0x000050, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::CallFunc_GetObjectArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, CallFunc_GetStringField_ReturnValue) == 0x000060, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, CallFunc_GetStringField_ReturnValue_1) == 0x000078, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00008C, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, CallFunc_Less_IntInt_ReturnValue) == 0x00008D, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, K2Node_MakeArray_Array) == 0x000090, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000A0, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, K2Node_DynamicCast_AsBP_PG_Player_State_Menu) == 0x0000A8, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::K2Node_DynamicCast_AsBP_PG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_GiveRewardForPromoCode, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'UI_PromoCode_C_GiveRewardForPromoCode::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UI_PromoCode.UI_PromoCode_C.OnPlayFabResponse_A63AC9924A800319BAD27F87EEB79850
// 0x0050 (0x0050 - 0x0000)
struct UI_PromoCode_C_OnPlayFabResponse_A63AC9924A800319BAD27F87EEB79850 final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_PromoCode_C_OnPlayFabResponse_A63AC9924A800319BAD27F87EEB79850) == 0x000008, "Wrong alignment on UI_PromoCode_C_OnPlayFabResponse_A63AC9924A800319BAD27F87EEB79850");
static_assert(sizeof(UI_PromoCode_C_OnPlayFabResponse_A63AC9924A800319BAD27F87EEB79850) == 0x000050, "Wrong size on UI_PromoCode_C_OnPlayFabResponse_A63AC9924A800319BAD27F87EEB79850");
static_assert(offsetof(UI_PromoCode_C_OnPlayFabResponse_A63AC9924A800319BAD27F87EEB79850, Response) == 0x000000, "Member 'UI_PromoCode_C_OnPlayFabResponse_A63AC9924A800319BAD27F87EEB79850::Response' has a wrong offset!");
static_assert(offsetof(UI_PromoCode_C_OnPlayFabResponse_A63AC9924A800319BAD27F87EEB79850, CustomData) == 0x000040, "Member 'UI_PromoCode_C_OnPlayFabResponse_A63AC9924A800319BAD27F87EEB79850::CustomData' has a wrong offset!");
