#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_QuickMatchWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_QuickMatchWidget.UI_QuickMatchWidget_C.ExecuteUbergraph_UI_QuickMatchWidget
// 0x0190 (0x0190 - 0x0000)
struct UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34E2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34E3[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0024(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x004C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0060(0x0014)()
	uint8                                         Pad_34E4[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34E5[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34E6[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapInfo                               CallFunc_GetDataTableRowFromName_OutRow;           // 0x00A0(0x00E8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget) == 0x000008, "Wrong alignment on UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget");
static_assert(sizeof(UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget) == 0x000190, "Wrong size on UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget");
static_assert(offsetof(UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget, EntryPoint) == 0x000000, "Member 'UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget, Temp_object_Variable) == 0x000010, "Member 'UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget, K2Node_DynamicCast_AsTexture_2D) == 0x000018, "Member 'UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget, K2Node_MakeStruct_SlateColor) == 0x000024, "Member 'UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget, K2Node_MakeStruct_SlateColor_2) == 0x00004C, "Member 'UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget, K2Node_MakeStruct_SlateColor_3) == 0x000060, "Member 'UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000078, "Member 'UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000080, "Member 'UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget, K2Node_Event_IsDesignTime) == 0x000088, "Member 'UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget, K2Node_CreateDelegate_OutputDelegate) == 0x00008C, "Member 'UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000A0, "Member 'UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000188, "Member 'UI_QuickMatchWidget_C_ExecuteUbergraph_UI_QuickMatchWidget::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function UI_QuickMatchWidget.UI_QuickMatchWidget_C.GetServerWithMinPing
// 0x0078 (0x0078 - 0x0000)
struct UI_QuickMatchWidget_C_GetServerWithMinPing final
{
public:
	TArray<class UUI_ServerInfo_C*>               ServersInfo;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UUI_ServerInfo_C*                       ServerInfo;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_ServerInfo_C*                       L_ServerIterator;                                  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_ServerInfo_C*                       L_ServerWithMinPing;                               // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34E7[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34E8[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_ServerInfo_C*                       CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34E9[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_QuickMatchWidget_C_GetServerWithMinPing) == 0x000008, "Wrong alignment on UI_QuickMatchWidget_C_GetServerWithMinPing");
static_assert(sizeof(UI_QuickMatchWidget_C_GetServerWithMinPing) == 0x000078, "Wrong size on UI_QuickMatchWidget_C_GetServerWithMinPing");
static_assert(offsetof(UI_QuickMatchWidget_C_GetServerWithMinPing, ServersInfo) == 0x000000, "Member 'UI_QuickMatchWidget_C_GetServerWithMinPing::ServersInfo' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_GetServerWithMinPing, ServerInfo) == 0x000010, "Member 'UI_QuickMatchWidget_C_GetServerWithMinPing::ServerInfo' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_GetServerWithMinPing, L_ServerIterator) == 0x000018, "Member 'UI_QuickMatchWidget_C_GetServerWithMinPing::L_ServerIterator' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_GetServerWithMinPing, L_ServerWithMinPing) == 0x000020, "Member 'UI_QuickMatchWidget_C_GetServerWithMinPing::L_ServerWithMinPing' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_GetServerWithMinPing, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'UI_QuickMatchWidget_C_GetServerWithMinPing::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_GetServerWithMinPing, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'UI_QuickMatchWidget_C_GetServerWithMinPing::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_GetServerWithMinPing, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'UI_QuickMatchWidget_C_GetServerWithMinPing::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_GetServerWithMinPing, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'UI_QuickMatchWidget_C_GetServerWithMinPing::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_GetServerWithMinPing, Temp_int_Array_Index_Variable) == 0x000038, "Member 'UI_QuickMatchWidget_C_GetServerWithMinPing::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_GetServerWithMinPing, CallFunc_Array_Get_Item) == 0x000040, "Member 'UI_QuickMatchWidget_C_GetServerWithMinPing::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_GetServerWithMinPing, CallFunc_GetStringField_ReturnValue) == 0x000048, "Member 'UI_QuickMatchWidget_C_GetServerWithMinPing::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_GetServerWithMinPing, CallFunc_Greater_IntInt_ReturnValue) == 0x000058, "Member 'UI_QuickMatchWidget_C_GetServerWithMinPing::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_GetServerWithMinPing, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'UI_QuickMatchWidget_C_GetServerWithMinPing::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_GetServerWithMinPing, CallFunc_Conv_NameToString_ReturnValue) == 0x000060, "Member 'UI_QuickMatchWidget_C_GetServerWithMinPing::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_GetServerWithMinPing, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000070, "Member 'UI_QuickMatchWidget_C_GetServerWithMinPing::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_GetServerWithMinPing, CallFunc_BooleanAND_ReturnValue) == 0x000071, "Member 'UI_QuickMatchWidget_C_GetServerWithMinPing::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_QuickMatchWidget_C_GetServerWithMinPing, CallFunc_Less_IntInt_ReturnValue_1) == 0x000072, "Member 'UI_QuickMatchWidget_C_GetServerWithMinPing::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function UI_QuickMatchWidget.UI_QuickMatchWidget_C.OnLoaded_BD0B885348BE191146D1EAAB5C9E2669
// 0x0008 (0x0008 - 0x0000)
struct UI_QuickMatchWidget_C_OnLoaded_BD0B885348BE191146D1EAAB5C9E2669 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_QuickMatchWidget_C_OnLoaded_BD0B885348BE191146D1EAAB5C9E2669) == 0x000008, "Wrong alignment on UI_QuickMatchWidget_C_OnLoaded_BD0B885348BE191146D1EAAB5C9E2669");
static_assert(sizeof(UI_QuickMatchWidget_C_OnLoaded_BD0B885348BE191146D1EAAB5C9E2669) == 0x000008, "Wrong size on UI_QuickMatchWidget_C_OnLoaded_BD0B885348BE191146D1EAAB5C9E2669");
static_assert(offsetof(UI_QuickMatchWidget_C_OnLoaded_BD0B885348BE191146D1EAAB5C9E2669, Loaded) == 0x000000, "Member 'UI_QuickMatchWidget_C_OnLoaded_BD0B885348BE191146D1EAAB5C9E2669::Loaded' has a wrong offset!");

// Function UI_QuickMatchWidget.UI_QuickMatchWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_QuickMatchWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_QuickMatchWidget_C_PreConstruct) == 0x000001, "Wrong alignment on UI_QuickMatchWidget_C_PreConstruct");
static_assert(sizeof(UI_QuickMatchWidget_C_PreConstruct) == 0x000001, "Wrong size on UI_QuickMatchWidget_C_PreConstruct");
static_assert(offsetof(UI_QuickMatchWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_QuickMatchWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

