#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_QuickMatchWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_QuickMatchWidget.UI_QuickMatchWidget_C
// 0x00B0 (0x0330 - 0x0280)
class UUI_QuickMatchWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hovered;                                           // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Create;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Footer;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Hovered;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Play;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Create;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Play;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MapPreview;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MatchmakingTimer;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Create;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_MapName;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Play;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ServerSearchTime;                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Play;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   MapID;                                             // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTimerHandle                           TimerGetMatchmakingTicket;                         // 0x0310(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerSearchServer;                                 // 0x0318(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerCalculateServerSearchTime;                    // 0x0320(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         SearchTime;                                        // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_Create_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Create_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_Create_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_Play_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_Play_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_Play_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_UI_QuickMatchWidget(int32 EntryPoint);
	void GetServerWithMinPing(TArray<class UUI_ServerInfo_C*>& ServersInfo, class UUI_ServerInfo_C** ServerInfo);
	void OnLoaded_BD0B885348BE191146D1EAAB5C9E2669(class UObject* Loaded);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_QuickMatchWidget_C">();
	}
	static class UUI_QuickMatchWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_QuickMatchWidget_C>();
	}
};
static_assert(alignof(UUI_QuickMatchWidget_C) == 0x000008, "Wrong alignment on UUI_QuickMatchWidget_C");
static_assert(sizeof(UUI_QuickMatchWidget_C) == 0x000330, "Wrong size on UUI_QuickMatchWidget_C");
static_assert(offsetof(UUI_QuickMatchWidget_C, UberGraphFrame) == 0x000280, "Member 'UUI_QuickMatchWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, Hovered) == 0x000288, "Member 'UUI_QuickMatchWidget_C::Hovered' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, Border) == 0x000290, "Member 'UUI_QuickMatchWidget_C::Border' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, Border_Create) == 0x000298, "Member 'UUI_QuickMatchWidget_C::Border_Create' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, Border_Footer) == 0x0002A0, "Member 'UUI_QuickMatchWidget_C::Border_Footer' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, Border_Hovered) == 0x0002A8, "Member 'UUI_QuickMatchWidget_C::Border_Hovered' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, Border_Play) == 0x0002B0, "Member 'UUI_QuickMatchWidget_C::Border_Play' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, Button) == 0x0002B8, "Member 'UUI_QuickMatchWidget_C::Button' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, Button_Create) == 0x0002C0, "Member 'UUI_QuickMatchWidget_C::Button_Create' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, Button_Play) == 0x0002C8, "Member 'UUI_QuickMatchWidget_C::Button_Play' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, Image_MapPreview) == 0x0002D0, "Member 'UUI_QuickMatchWidget_C::Image_MapPreview' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, Image_MatchmakingTimer) == 0x0002D8, "Member 'UUI_QuickMatchWidget_C::Image_MatchmakingTimer' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, TextBlock_Create) == 0x0002E0, "Member 'UUI_QuickMatchWidget_C::TextBlock_Create' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, TextBlock_MapName) == 0x0002E8, "Member 'UUI_QuickMatchWidget_C::TextBlock_MapName' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, TextBlock_Play) == 0x0002F0, "Member 'UUI_QuickMatchWidget_C::TextBlock_Play' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, TextBlock_ServerSearchTime) == 0x0002F8, "Member 'UUI_QuickMatchWidget_C::TextBlock_ServerSearchTime' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, WidgetSwitcher_Play) == 0x000300, "Member 'UUI_QuickMatchWidget_C::WidgetSwitcher_Play' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, MapID) == 0x000308, "Member 'UUI_QuickMatchWidget_C::MapID' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, TimerGetMatchmakingTicket) == 0x000310, "Member 'UUI_QuickMatchWidget_C::TimerGetMatchmakingTicket' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, TimerSearchServer) == 0x000318, "Member 'UUI_QuickMatchWidget_C::TimerSearchServer' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, TimerCalculateServerSearchTime) == 0x000320, "Member 'UUI_QuickMatchWidget_C::TimerCalculateServerSearchTime' has a wrong offset!");
static_assert(offsetof(UUI_QuickMatchWidget_C, SearchTime) == 0x000328, "Member 'UUI_QuickMatchWidget_C::SearchTime' has a wrong offset!");

}

