#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ShopItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_ShopItem.UI_ShopItem_C
// 0x00E0 (0x0360 - 0x0280)
class UUI_ShopItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       UpscaleImage;                                      // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Purchased;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_RequiredLevel;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Loupe;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Unavailable;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Price;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_RequiredLevel;                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Coin;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Corner;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Crowns;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ItemIcon;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Base;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Loading;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Buy;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemName;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Price;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Purchased;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_RequiredLevel;                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_PriceType;                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         PlayerController;                                  // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ItemClass;                                         // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             IsHoveredDelegate;                                 // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         ItemPrice;                                         // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPurchased;                                       // 0x0354(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAvailable;                                       // 0x0355(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPremium;                                         // 0x0356(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3640[0x1];                                     // 0x0357(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LevelRequired;                                     // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AsyncLoadIcon(TSoftObjectPtr<class UTexture2D> ItemIcon);
	void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_ShopItem_Button_Loupe_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_ShopItem_Button_Loupe_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_ShopItem(int32 EntryPoint);
	void GetCatalogVersionByItemType(class FString* Catalog);
	void IsHoveredDelegate__DelegateSignature(class UUI_ShopItem_C* Item, bool Param_IsHovered);
	void OnClicked_Event();
	void OnLoaded_2C5F359C4097A5010239688BB380D317(class UObject* Loaded);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnPlayFabResponse_09710F9A4237AB46170B1D960A630947(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void OnUpdatePlayerCombinedInfo_Event(const TArray<EModifiedData>& ModifiedData, const class FString& CustomString);
	void PreConstruct(bool IsDesignTime);
	void PurchaseItemFailure(const struct FPlayFabError& Error, class UObject* CustomData);
	void PurchaseItemSuccess(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData);
	void Set_Is_Purchased(bool Param_IsPurchased);
	void SetEnableLoupe();
	void SetItemInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_ShopItem_C">();
	}
	static class UUI_ShopItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_ShopItem_C>();
	}
};
static_assert(alignof(UUI_ShopItem_C) == 0x000008, "Wrong alignment on UUI_ShopItem_C");
static_assert(sizeof(UUI_ShopItem_C) == 0x000360, "Wrong size on UUI_ShopItem_C");
static_assert(offsetof(UUI_ShopItem_C, UberGraphFrame) == 0x000280, "Member 'UUI_ShopItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, UpscaleImage) == 0x000288, "Member 'UUI_ShopItem_C::UpscaleImage' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, Border) == 0x000290, "Member 'UUI_ShopItem_C::Border' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, Border_Purchased) == 0x000298, "Member 'UUI_ShopItem_C::Border_Purchased' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, Border_RequiredLevel) == 0x0002A0, "Member 'UUI_ShopItem_C::Border_RequiredLevel' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, Button) == 0x0002A8, "Member 'UUI_ShopItem_C::Button' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, Button_Loupe) == 0x0002B0, "Member 'UUI_ShopItem_C::Button_Loupe' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, Button_Unavailable) == 0x0002B8, "Member 'UUI_ShopItem_C::Button_Unavailable' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, HorizontalBox_Price) == 0x0002C0, "Member 'UUI_ShopItem_C::HorizontalBox_Price' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, HorizontalBox_RequiredLevel) == 0x0002C8, "Member 'UUI_ShopItem_C::HorizontalBox_RequiredLevel' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, Image_Coin) == 0x0002D0, "Member 'UUI_ShopItem_C::Image_Coin' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, Image_Corner) == 0x0002D8, "Member 'UUI_ShopItem_C::Image_Corner' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, Image_Crowns) == 0x0002E0, "Member 'UUI_ShopItem_C::Image_Crowns' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, Image_ItemIcon) == 0x0002E8, "Member 'UUI_ShopItem_C::Image_ItemIcon' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, Overlay_Base) == 0x0002F0, "Member 'UUI_ShopItem_C::Overlay_Base' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, Overlay_Loading) == 0x0002F8, "Member 'UUI_ShopItem_C::Overlay_Loading' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, TextBlock_Buy) == 0x000300, "Member 'UUI_ShopItem_C::TextBlock_Buy' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, TextBlock_ItemName) == 0x000308, "Member 'UUI_ShopItem_C::TextBlock_ItemName' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, TextBlock_Price) == 0x000310, "Member 'UUI_ShopItem_C::TextBlock_Price' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, TextBlock_Purchased) == 0x000318, "Member 'UUI_ShopItem_C::TextBlock_Purchased' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, TextBlock_RequiredLevel) == 0x000320, "Member 'UUI_ShopItem_C::TextBlock_RequiredLevel' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, WidgetSwitcher_PriceType) == 0x000328, "Member 'UUI_ShopItem_C::WidgetSwitcher_PriceType' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, PlayerController) == 0x000330, "Member 'UUI_ShopItem_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, ItemClass) == 0x000338, "Member 'UUI_ShopItem_C::ItemClass' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, IsHoveredDelegate) == 0x000340, "Member 'UUI_ShopItem_C::IsHoveredDelegate' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, ItemPrice) == 0x000350, "Member 'UUI_ShopItem_C::ItemPrice' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, IsPurchased) == 0x000354, "Member 'UUI_ShopItem_C::IsPurchased' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, IsAvailable) == 0x000355, "Member 'UUI_ShopItem_C::IsAvailable' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, IsPremium) == 0x000356, "Member 'UUI_ShopItem_C::IsPremium' has a wrong offset!");
static_assert(offsetof(UUI_ShopItem_C, LevelRequired) == 0x000358, "Member 'UUI_ShopItem_C::LevelRequired' has a wrong offset!");

}

