#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Shop_VIP

#include "Basic.hpp"

#include "POLYGON_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UI_Shop_VIP.UI_Shop_VIP_C.ExecuteUbergraph_UI_Shop_VIP
// 0x02A0 (0x02A0 - 0x0000)
struct UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35FB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Menu_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Menu;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35FC[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35FD[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35FE[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35FF[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_CustomEvent_ModifiedData;                   // 0x0058(0x0010)(ConstParm, ReferenceParm)
	class FString                                 K2Node_CustomEvent_CustomString;                   // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Menu_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Menu_1;    // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3600[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3601[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3602[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Menu_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Menu_2;    // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3603[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_1;      // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<EModifiedData>& ModifiedData, const class FString& CustomString)> K2Node_CreateDelegate_OutputDelegate;              // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue;          // 0x00E0(0x0010)(ReferenceParm)
	class UPlayFabJsonObject*                     CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3604[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3605[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_DateTimeFromIsoString_Result;             // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DateTimeFromIsoString_ReturnValue;        // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3606[0x6];                                     // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetDuration_ReturnValue;                  // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMinutes_ReturnValue;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3607[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3608[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0160(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3609[0x3];                                     // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHours_ReturnValue;                     // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDays_ReturnValue;                      // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_360A[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01C8(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0220(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0270(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0280(0x0018)()
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP) == 0x000008, "Wrong alignment on UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP");
static_assert(sizeof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP) == 0x0002A0, "Wrong size on UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, EntryPoint) == 0x000000, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, K2Node_DynamicCast_AsBP_PG_Player_State_Menu) == 0x000010, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::K2Node_DynamicCast_AsBP_PG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000028, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_GetObjectField_ReturnValue) == 0x000030, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_GetNumberField_ReturnValue) == 0x000038, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_Round_ReturnValue) == 0x00003C, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, Temp_bool_True_if_break_was_hit_Variable) == 0x000040, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000044, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_GetPlayerController_ReturnValue_1) == 0x000050, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, K2Node_CustomEvent_ModifiedData) == 0x000058, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::K2Node_CustomEvent_ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, K2Node_CustomEvent_CustomString) == 0x000068, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::K2Node_CustomEvent_CustomString' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, K2Node_DynamicCast_AsBP_PG_Player_State_Menu_1) == 0x000078, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::K2Node_DynamicCast_AsBP_PG_Player_State_Menu_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, Temp_bool_IsClosed_Variable) == 0x000081, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_GetPlayerController_ReturnValue_2) == 0x000088, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000090, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_UtcNow_ReturnValue) == 0x0000A0, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_UtcNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, Temp_bool_Has_Been_Initd_Variable) == 0x0000A8, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_GetPlayerController_ReturnValue_3) == 0x0000B0, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, K2Node_DynamicCast_AsBP_PG_Player_State_Menu_2) == 0x0000B8, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::K2Node_DynamicCast_AsBP_PG_Player_State_Menu_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, K2Node_DynamicCast_bSuccess_3) == 0x0000C0, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_GetPlayerCombinedInfo_ReturnValue_1) == 0x0000C8, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_GetPlayerCombinedInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, K2Node_CreateDelegate_OutputDelegate) == 0x0000D0, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_GetObjectArrayField_ReturnValue) == 0x0000E0, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_GetObjectArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_GetStringField_ReturnValue) == 0x000100, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_Less_IntInt_ReturnValue) == 0x000110, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_DateTimeFromIsoString_Result) == 0x000118, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_DateTimeFromIsoString_Result' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_DateTimeFromIsoString_ReturnValue) == 0x000120, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_DateTimeFromIsoString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_BooleanAND_ReturnValue) == 0x000121, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x000128, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_GetDuration_ReturnValue) == 0x000130, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_GetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_GetStringField_ReturnValue_1) == 0x000138, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_GetMinutes_ReturnValue) == 0x000148, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_GetMinutes_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00014C, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000150, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000158, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, K2Node_MakeStruct_FormatArgumentData) == 0x000160, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_BooleanOR_ReturnValue) == 0x0001B0, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_GetHours_ReturnValue) == 0x0001B4, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_GetHours_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0001B8, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_GetDays_ReturnValue) == 0x0001C0, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_GetDays_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001C8, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x000218, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, K2Node_MakeStruct_FormatArgumentData_2) == 0x000220, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, K2Node_MakeArray_Array) == 0x000270, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_Format_ReturnValue) == 0x000280, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP, CallFunc_Round_A_ImplicitCast) == 0x000298, "Member 'UI_Shop_VIP_C_ExecuteUbergraph_UI_Shop_VIP::CallFunc_Round_A_ImplicitCast' has a wrong offset!");

// Function UI_Shop_VIP.UI_Shop_VIP_C.OnUpdatePlayerCombinedInfo_Event
// 0x0020 (0x0020 - 0x0000)
struct UI_Shop_VIP_C_OnUpdatePlayerCombinedInfo_Event final
{
public:
	TArray<EModifiedData>                         ModifiedData;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 CustomString;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_VIP_C_OnUpdatePlayerCombinedInfo_Event) == 0x000008, "Wrong alignment on UI_Shop_VIP_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(sizeof(UI_Shop_VIP_C_OnUpdatePlayerCombinedInfo_Event) == 0x000020, "Wrong size on UI_Shop_VIP_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(offsetof(UI_Shop_VIP_C_OnUpdatePlayerCombinedInfo_Event, ModifiedData) == 0x000000, "Member 'UI_Shop_VIP_C_OnUpdatePlayerCombinedInfo_Event::ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_C_OnUpdatePlayerCombinedInfo_Event, CustomString) == 0x000010, "Member 'UI_Shop_VIP_C_OnUpdatePlayerCombinedInfo_Event::CustomString' has a wrong offset!");

}

