#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SpawnScreen_Squad_Player

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_SpawnScreen_Squad_Player.UI_SpawnScreen_Squad_Player_C.ExecuteUbergraph_UI_SpawnScreen_Squad_Player
// 0x0120 (0x0120 - 0x0000)
struct UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D5F[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D60[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D61[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APG_Game_Character*                     K2Node_DynamicCast_AsPG_Game_Character;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D62[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHealth_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D63[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D64[0x2];                                     // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D65[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D66[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Actor, EEndPlayReason EndPlayReason)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D67[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Game_SpawnScreen_Player_SquadMember_C* K2Node_DynamicCast_AsUI_Game_Spawn_Screen_Player_Squad_Member; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D68[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D69[0x5];                                     // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_CustomEvent_EndPlayReason;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D6A[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           K2Node_CustomEvent_Player;                         // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_NewPawn;                        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_OldPawn;                        // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player) == 0x000008, "Wrong alignment on UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player");
static_assert(sizeof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player) == 0x000120, "Wrong size on UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, EntryPoint) == 0x000000, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, Temp_bool_True_if_break_was_hit_Variable) == 0x00000C, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, Temp_int_Array_Index_Variable) == 0x000010, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_IsValid_ReturnValue) == 0x000015, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_GetPlayerName_ReturnValue) == 0x000018, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, K2Node_DynamicCast_AsPG_Game_Character) == 0x000048, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::K2Node_DynamicCast_AsPG_Game_Character' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_GetHealth_ReturnValue) == 0x000054, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_Greater_IntInt_ReturnValue) == 0x000058, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000060, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000068, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_GetIsEnabled_ReturnValue) == 0x000080, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000081, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, K2Node_CreateDelegate_OutputDelegate_1) == 0x000084, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_GetPlayerController_ReturnValue) == 0x000098, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x0000A0, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000AC, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000C8, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, K2Node_DynamicCast_AsUI_Game_Spawn_Screen_Player_Squad_Member) == 0x0000D8, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::K2Node_DynamicCast_AsUI_Game_Spawn_Screen_Player_Squad_Member' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, K2Node_DynamicCast_bSuccess_2) == 0x0000E0, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_Array_Length_ReturnValue) == 0x0000E4, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_Less_IntInt_ReturnValue) == 0x0000E8, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000E9, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_BooleanAND_ReturnValue) == 0x0000EA, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, K2Node_CustomEvent_Actor) == 0x0000F0, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, K2Node_CustomEvent_EndPlayReason) == 0x0000F8, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::K2Node_CustomEvent_EndPlayReason' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, K2Node_CustomEvent_Player) == 0x000100, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::K2Node_CustomEvent_Player' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, K2Node_CustomEvent_NewPawn) == 0x000108, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::K2Node_CustomEvent_NewPawn' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, K2Node_CustomEvent_OldPawn) == 0x000110, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::K2Node_CustomEvent_OldPawn' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000118, "Member 'UI_SpawnScreen_Squad_Player_C_ExecuteUbergraph_UI_SpawnScreen_Squad_Player::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function UI_SpawnScreen_Squad_Player.UI_SpawnScreen_Squad_Player_C.OnEndPlay_Event
// 0x0010 (0x0010 - 0x0000)
struct UI_SpawnScreen_Squad_Player_C_OnEndPlay_Event final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_SpawnScreen_Squad_Player_C_OnEndPlay_Event) == 0x000008, "Wrong alignment on UI_SpawnScreen_Squad_Player_C_OnEndPlay_Event");
static_assert(sizeof(UI_SpawnScreen_Squad_Player_C_OnEndPlay_Event) == 0x000010, "Wrong size on UI_SpawnScreen_Squad_Player_C_OnEndPlay_Event");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_OnEndPlay_Event, Actor) == 0x000000, "Member 'UI_SpawnScreen_Squad_Player_C_OnEndPlay_Event::Actor' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_OnEndPlay_Event, EndPlayReason) == 0x000008, "Member 'UI_SpawnScreen_Squad_Player_C_OnEndPlay_Event::EndPlayReason' has a wrong offset!");

// Function UI_SpawnScreen_Squad_Player.UI_SpawnScreen_Squad_Player_C.OnPawnSet_Event
// 0x0018 (0x0018 - 0x0000)
struct UI_SpawnScreen_Squad_Player_C_OnPawnSet_Event final
{
public:
	class APlayerState*                           Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  OldPawn;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_SpawnScreen_Squad_Player_C_OnPawnSet_Event) == 0x000008, "Wrong alignment on UI_SpawnScreen_Squad_Player_C_OnPawnSet_Event");
static_assert(sizeof(UI_SpawnScreen_Squad_Player_C_OnPawnSet_Event) == 0x000018, "Wrong size on UI_SpawnScreen_Squad_Player_C_OnPawnSet_Event");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_OnPawnSet_Event, Param_Player) == 0x000000, "Member 'UI_SpawnScreen_Squad_Player_C_OnPawnSet_Event::Param_Player' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_OnPawnSet_Event, NewPawn) == 0x000008, "Member 'UI_SpawnScreen_Squad_Player_C_OnPawnSet_Event::NewPawn' has a wrong offset!");
static_assert(offsetof(UI_SpawnScreen_Squad_Player_C_OnPawnSet_Event, OldPawn) == 0x000010, "Member 'UI_SpawnScreen_Squad_Player_C_OnPawnSet_Event::OldPawn' has a wrong offset!");

}

