#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Shop_VIP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Shop_VIP.UI_Shop_VIP_C
// 0x0040 (0x02C0 - 0x0280)
class UUI_Shop_VIP_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_VIPTimer;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Shop_VIP_Button_C*                  UI_Shop_VIP_Button_1Day;                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Shop_VIP_Button_C*                  UI_Shop_VIP_Button_30Days;                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Shop_VIP_Button_C*                  UI_Shop_VIP_Button_365Days;                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Shop_VIP_Button_C*                  UI_Shop_VIP_Button_7Days;                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Shop_VIP_Button_C*                  UI_Shop_VIP_Button_90Days;                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_ActiveState;                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_Shop_VIP(int32 EntryPoint);
	void OnUpdatePlayerCombinedInfo_Event(const TArray<EModifiedData>& ModifiedData, const class FString& CustomString);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Shop_VIP_C">();
	}
	static class UUI_Shop_VIP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Shop_VIP_C>();
	}
};
static_assert(alignof(UUI_Shop_VIP_C) == 0x000008, "Wrong alignment on UUI_Shop_VIP_C");
static_assert(sizeof(UUI_Shop_VIP_C) == 0x0002C0, "Wrong size on UUI_Shop_VIP_C");
static_assert(offsetof(UUI_Shop_VIP_C, UberGraphFrame) == 0x000280, "Member 'UUI_Shop_VIP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Shop_VIP_C, TextBlock_VIPTimer) == 0x000288, "Member 'UUI_Shop_VIP_C::TextBlock_VIPTimer' has a wrong offset!");
static_assert(offsetof(UUI_Shop_VIP_C, UI_Shop_VIP_Button_1Day) == 0x000290, "Member 'UUI_Shop_VIP_C::UI_Shop_VIP_Button_1Day' has a wrong offset!");
static_assert(offsetof(UUI_Shop_VIP_C, UI_Shop_VIP_Button_30Days) == 0x000298, "Member 'UUI_Shop_VIP_C::UI_Shop_VIP_Button_30Days' has a wrong offset!");
static_assert(offsetof(UUI_Shop_VIP_C, UI_Shop_VIP_Button_365Days) == 0x0002A0, "Member 'UUI_Shop_VIP_C::UI_Shop_VIP_Button_365Days' has a wrong offset!");
static_assert(offsetof(UUI_Shop_VIP_C, UI_Shop_VIP_Button_7Days) == 0x0002A8, "Member 'UUI_Shop_VIP_C::UI_Shop_VIP_Button_7Days' has a wrong offset!");
static_assert(offsetof(UUI_Shop_VIP_C, UI_Shop_VIP_Button_90Days) == 0x0002B0, "Member 'UUI_Shop_VIP_C::UI_Shop_VIP_Button_90Days' has a wrong offset!");
static_assert(offsetof(UUI_Shop_VIP_C, WidgetSwitcher_ActiveState) == 0x0002B8, "Member 'UUI_Shop_VIP_C::WidgetSwitcher_ActiveState' has a wrong offset!");

}

