#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Shop_Crowns_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DataContainer_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Shop_Crowns_Item.UI_Shop_Crowns_Item_C
// 0x0128 (0x03A8 - 0x0280)
class UUI_Shop_Crowns_Item_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Bonus;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Price;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_Icon;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Discount;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Loading;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Bonus;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CrownsWithoutBonus;                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrencySign_1;                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrencySign_2;                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrencySign_3;                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrencySign_4;                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_DiscountPercent;                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Price;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Price_Discount_1;                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Price_Discount_2;                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Price_WithoutDiscount;                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_TotalCrownsNumber;                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Discount;                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 ItemId;                                            // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         TotalCrownsNumber;                                 // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         CrownsWithoutBonus;                                // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Bonus;                                             // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_353D[0x4];                                     // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Price;                                             // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         DiscountPercent;                                   // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_353E[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DiscountPrice;                                     // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUI_Shop_Crowns_C*                      UI_Shop_Crowns;                                    // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 Order_Id;                                          // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Trans_Id;                                          // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FDataContainerObjectWrapper            Prices;                                            // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, ExposeOnSpawn)
	struct FDataContainerObjectWrapper            Discount;                                          // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, ExposeOnSpawn)
	class FString                                 Currency;                                          // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__UI_Shop_Crowns_Item_Button_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Shop_Crowns_Item_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Shop_Crowns_Item_Button_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_Shop_Crowns_Item(int32 EntryPoint);
	void MicroTxnAuthorizationResponse_Event(const struct FMicroTxnAuthorizationResponse& Data);
	void OnPlayFabResponse_66223ADF443722A34A0A8599C770D5C1(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void OnPlayFabResponse_C3FC67CC42771B9E1E218DAC04D28114(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void OnPlayFabResponse_E83898FB4A25F8F987D2498C30BB8E81(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void PreConstruct(bool IsDesignTime);
	void SetBonus();
	void SetCurrency(const class FString& Param_Currency);
	void SetDiscount();
	void ShowError(const struct FPlayFabError& PlayFabError, int32 EventIndex);
	void SteamFinalizeTxn_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void SteamFinalizeTxn_Success(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData);
	void SteamInitTxn_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void SteamInitTxn_Success(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData);
	void WritePlayerEvent_Error_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void WritePlayerEvent_Error_Success(const struct FClientWriteEventResponse& Result, class UObject* CustomData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Shop_Crowns_Item_C">();
	}
	static class UUI_Shop_Crowns_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Shop_Crowns_Item_C>();
	}
};
static_assert(alignof(UUI_Shop_Crowns_Item_C) == 0x000008, "Wrong alignment on UUI_Shop_Crowns_Item_C");
static_assert(sizeof(UUI_Shop_Crowns_Item_C) == 0x0003A8, "Wrong size on UUI_Shop_Crowns_Item_C");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, UberGraphFrame) == 0x000280, "Member 'UUI_Shop_Crowns_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, Hover) == 0x000288, "Member 'UUI_Shop_Crowns_Item_C::Hover' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, Border_Bonus) == 0x000290, "Member 'UUI_Shop_Crowns_Item_C::Border_Bonus' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, Border_Price) == 0x000298, "Member 'UUI_Shop_Crowns_Item_C::Border_Price' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, Button) == 0x0002A0, "Member 'UUI_Shop_Crowns_Item_C::Button' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, NamedSlot_Icon) == 0x0002A8, "Member 'UUI_Shop_Crowns_Item_C::NamedSlot_Icon' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, Overlay_Discount) == 0x0002B0, "Member 'UUI_Shop_Crowns_Item_C::Overlay_Discount' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, Overlay_Loading) == 0x0002B8, "Member 'UUI_Shop_Crowns_Item_C::Overlay_Loading' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, TextBlock_Bonus) == 0x0002C0, "Member 'UUI_Shop_Crowns_Item_C::TextBlock_Bonus' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, TextBlock_CrownsWithoutBonus) == 0x0002C8, "Member 'UUI_Shop_Crowns_Item_C::TextBlock_CrownsWithoutBonus' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, TextBlock_CurrencySign_1) == 0x0002D0, "Member 'UUI_Shop_Crowns_Item_C::TextBlock_CurrencySign_1' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, TextBlock_CurrencySign_2) == 0x0002D8, "Member 'UUI_Shop_Crowns_Item_C::TextBlock_CurrencySign_2' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, TextBlock_CurrencySign_3) == 0x0002E0, "Member 'UUI_Shop_Crowns_Item_C::TextBlock_CurrencySign_3' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, TextBlock_CurrencySign_4) == 0x0002E8, "Member 'UUI_Shop_Crowns_Item_C::TextBlock_CurrencySign_4' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, TextBlock_DiscountPercent) == 0x0002F0, "Member 'UUI_Shop_Crowns_Item_C::TextBlock_DiscountPercent' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, TextBlock_Price) == 0x0002F8, "Member 'UUI_Shop_Crowns_Item_C::TextBlock_Price' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, TextBlock_Price_Discount_1) == 0x000300, "Member 'UUI_Shop_Crowns_Item_C::TextBlock_Price_Discount_1' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, TextBlock_Price_Discount_2) == 0x000308, "Member 'UUI_Shop_Crowns_Item_C::TextBlock_Price_Discount_2' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, TextBlock_Price_WithoutDiscount) == 0x000310, "Member 'UUI_Shop_Crowns_Item_C::TextBlock_Price_WithoutDiscount' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, TextBlock_TotalCrownsNumber) == 0x000318, "Member 'UUI_Shop_Crowns_Item_C::TextBlock_TotalCrownsNumber' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, WidgetSwitcher_Discount) == 0x000320, "Member 'UUI_Shop_Crowns_Item_C::WidgetSwitcher_Discount' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, ItemId) == 0x000328, "Member 'UUI_Shop_Crowns_Item_C::ItemId' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, TotalCrownsNumber) == 0x000338, "Member 'UUI_Shop_Crowns_Item_C::TotalCrownsNumber' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, CrownsWithoutBonus) == 0x00033C, "Member 'UUI_Shop_Crowns_Item_C::CrownsWithoutBonus' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, Bonus) == 0x000340, "Member 'UUI_Shop_Crowns_Item_C::Bonus' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, Price) == 0x000348, "Member 'UUI_Shop_Crowns_Item_C::Price' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, DiscountPercent) == 0x000350, "Member 'UUI_Shop_Crowns_Item_C::DiscountPercent' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, DiscountPrice) == 0x000358, "Member 'UUI_Shop_Crowns_Item_C::DiscountPrice' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, UI_Shop_Crowns) == 0x000360, "Member 'UUI_Shop_Crowns_Item_C::UI_Shop_Crowns' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, Order_Id) == 0x000368, "Member 'UUI_Shop_Crowns_Item_C::Order_Id' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, Trans_Id) == 0x000378, "Member 'UUI_Shop_Crowns_Item_C::Trans_Id' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, Prices) == 0x000388, "Member 'UUI_Shop_Crowns_Item_C::Prices' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, Discount) == 0x000390, "Member 'UUI_Shop_Crowns_Item_C::Discount' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_Item_C, Currency) == 0x000398, "Member 'UUI_Shop_Crowns_Item_C::Currency' has a wrong offset!");

}

