#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Shop_Crowns_Item

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SteamCore_structs.hpp"
#include "PlayFab_structs.hpp"
#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_Shop_Crowns_Item.UI_Shop_Crowns_Item_C.ExecuteUbergraph_UI_Shop_Crowns_Item
// 0x08A8 (0x08A8 - 0x0000)
struct UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_353F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x0010(0x0040)()
	TDelegate<void(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x0070(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_6;                   // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3540[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3541[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable_1;                            // 0x00D8(0x0040)()
	TDelegate<void(const struct FClientWriteEventResponse& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0138(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_PlayFabError;                   // 0x0160(0x0038)(ConstParm)
	int32                                         K2Node_CustomEvent_EventIndex;                     // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3542[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3543[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3544[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01C8(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0220(0x0018)()
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlayEnabled_ReturnValue;             // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3545[0x6];                                     // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabError                          K2Node_MakeStruct_PlayFabError;                    // 0x0240(0x0038)()
	struct FPlayFabError                          K2Node_MakeStruct_PlayFabError_1;                  // 0x0278(0x0038)()
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__Object;       // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response_1;                     // 0x02C0(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_7;                   // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful_1;                   // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3546[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientExecuteCloudScriptRequest       K2Node_MakeStruct_ClientExecuteCloudScriptRequest; // 0x0310(0x0030)()
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result_2;                       // 0x0340(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData_5;                   // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error_2;                        // 0x03A8(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_4;                   // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x03E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3547[0x3];                                     // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3548[0x4];                                     // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_MakeStruct_PlayFabError_2;                  // 0x0420(0x0038)()
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1; // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3549[0x3];                                     // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0464(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354A[0x4];                                     // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMicroTxnAuthorizationResponse         K2Node_CustomEvent_Data;                           // 0x0478(0x0020)(ConstParm)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue_1;        // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FMicroTxnAuthorizationResponse& Data)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x04A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptRequest       K2Node_MakeStruct_ClientExecuteCloudScriptRequest_1; // 0x04B8(0x0030)()
	class UUser*                                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x04E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                      CallFunc_ExecuteCloudScript_ReturnValue;           // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354B[0x7];                                     // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result_1;                       // 0x0500(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData_3;                   // 0x0560(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error_1;                        // 0x0568(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x05A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue_1;               // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354C[0x3];                                     // 0x05A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNumberField_ReturnValue_1;             // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354D[0x4];                                     // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x05B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_MakeStruct_PlayFabError_3;                  // 0x05C0(0x0038)()
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x05F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354E[0x7];                                     // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Shop_MicroTxnError_C*               CallFunc_Create_ReturnValue;                       // 0x0608(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0610(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_1;      // 0x0618(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0620(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0628(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_2;             // 0x0630(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_2;             // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354F[0x4];                                     // 0x063C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_2;             // 0x0640(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x0650(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_SteamOverlayIsDisabled_C*      CallFunc_Create_ReturnValue_1;                     // 0x0670(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FClientWriteEventResponse              K2Node_CustomEvent_result;                         // 0x0678(0x0018)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x0690(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x0698(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x06D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue_2;        // 0x06D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x06E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__2_Object;     // 0x06F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientWriteClientPlayerEventRequest   K2Node_MakeStruct_ClientWriteClientPlayerEventRequest; // 0x06F8(0x0038)()
	class UPlayFabClientAPI*                      CallFunc_WritePlayerEvent_ReturnValue;             // 0x0730(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3550[0x3];                                     // 0x0739(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x073C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3551[0x4];                                     // 0x074C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      Temp_struct_Variable_2;                            // 0x0750(0x0040)()
	class UPlayFabClientAPI*                      CallFunc_ExecuteCloudScript_ReturnValue_1;         // 0x0790(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3552[0x7];                                     // 0x0799(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_2;                            // 0x07A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3553[0x7];                                     // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response_2;                     // 0x07B0(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_8;                   // 0x07F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful_2;                   // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3554[0x7];                                     // 0x07F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSteamUILanguage_ReturnValue;           // 0x0800(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0810(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0820(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0838(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3555[0x7];                                     // 0x0849(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_StringToDouble_ReturnValue;          // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0860(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3556[0x4];                                     // 0x0864(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0868(0x0018)()
	float                                         CallFunc_SetNumberField_Number_ImplicitCast;       // 0x0880(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3557[0x4];                                     // 0x0884(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0888(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_1;                  // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast_1;     // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item) == 0x000008, "Wrong alignment on UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item");
static_assert(sizeof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item) == 0x0008A8, "Wrong size on UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, EntryPoint) == 0x000000, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, Temp_bool_Variable) == 0x000004, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, Temp_object_Variable) == 0x000008, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, Temp_struct_Variable) == 0x000010, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_response) == 0x000070, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_customData_6) == 0x0000B0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_customData_6' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_successful) == 0x0000B8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000BC, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, Temp_bool_Variable_1) == 0x0000CC, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, Temp_object_Variable_1) == 0x0000D0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, Temp_struct_Variable_1) == 0x0000D8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CreateDelegate_OutputDelegate_3) == 0x000118, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CreateDelegate_OutputDelegate_4) == 0x000128, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_Conv_IntToText_ReturnValue) == 0x000138, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_PlayAnimationForward_ReturnValue) == 0x000150, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000158, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_PlayFabError) == 0x000160, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_PlayFabError' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_EventIndex) == 0x000198, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_EventIndex' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetPlayerController_ReturnValue) == 0x0001A0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0001A8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x0001B0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_DynamicCast_bSuccess) == 0x0001B8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0001C0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_Conv_StringToText_ReturnValue) == 0x0001C8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_Conv_IntToString_ReturnValue) == 0x0001E0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_Concat_StrStr_ReturnValue) == 0x0001F0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000200, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000210, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000220, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetIsEnabled_ReturnValue) == 0x000238, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_IsOverlayEnabled_ReturnValue) == 0x000239, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_IsOverlayEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_MakeStruct_PlayFabError) == 0x000240, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_MakeStruct_PlayFabError' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_MakeStruct_PlayFabError_1) == 0x000278, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_MakeStruct_PlayFabError_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_ConstructJsonObject_ReturnValue) == 0x0002B0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_LowEntry_LocalVariable_Value__Object) == 0x0002B8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_response_1) == 0x0002C0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_response_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_customData_7) == 0x000300, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_customData_7' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_successful_1) == 0x000308, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_successful_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_MakeStruct_ClientExecuteCloudScriptRequest) == 0x000310, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_MakeStruct_ClientExecuteCloudScriptRequest' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_result_2) == 0x000340, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_result_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_customData_5) == 0x0003A0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_customData_5' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_error_2) == 0x0003A8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_error_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_customData_4) == 0x0003E0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_customData_4' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetStringField_ReturnValue) == 0x0003E8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetStringField_ReturnValue_1) == 0x0003F8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetBoolField_ReturnValue) == 0x000408, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetBoolField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetNumberField_ReturnValue) == 0x00040C, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_FTrunc_ReturnValue) == 0x000410, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetOwningPlayer_ReturnValue) == 0x000418, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_MakeStruct_PlayFabError_2) == 0x000420, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_MakeStruct_PlayFabError_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1) == 0x000458, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_DynamicCast_bSuccess_1) == 0x000460, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CreateDelegate_OutputDelegate_5) == 0x000464, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_Data) == 0x000478, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_ConstructJsonObject_ReturnValue_1) == 0x000498, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_ConstructJsonObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_LowEntry_LocalVariable_Value__1_Object) == 0x0004A0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_LowEntry_LocalVariable_Value__1_Object' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CreateDelegate_OutputDelegate_6) == 0x0004A8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_MakeStruct_ClientExecuteCloudScriptRequest_1) == 0x0004B8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_MakeStruct_ClientExecuteCloudScriptRequest_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0004E8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_ExecuteCloudScript_ReturnValue) == 0x0004F0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_ExecuteCloudScript_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_IsValid_ReturnValue) == 0x0004F8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_result_1) == 0x000500, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_result_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_customData_3) == 0x000560, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_customData_3' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_error_1) == 0x000568, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_error_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_customData_2) == 0x0005A0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_customData_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetBoolField_ReturnValue_1) == 0x0005A8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetBoolField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetNumberField_ReturnValue_1) == 0x0005AC, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetNumberField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_FTrunc_ReturnValue_1) == 0x0005B0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetPlayerController_ReturnValue_1) == 0x0005B8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_MakeStruct_PlayFabError_3) == 0x0005C0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_MakeStruct_PlayFabError_3' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_DynamicCast_AsPG_Player_State_Menu) == 0x0005F8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_DynamicCast_AsPG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_DynamicCast_bSuccess_2) == 0x000600, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_Create_ReturnValue) == 0x000608, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000610, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetPlayerCombinedInfo_ReturnValue_1) == 0x000618, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetPlayerCombinedInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetObjectField_ReturnValue) == 0x000620, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetObjectField_ReturnValue_1) == 0x000628, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetObjectField_ReturnValue_2) == 0x000630, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetObjectField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetNumberField_ReturnValue_2) == 0x000638, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetNumberField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetStringField_ReturnValue_2) == 0x000640, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetStringField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_MakeArray_Array) == 0x000650, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000660, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000668, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_Create_ReturnValue_1) == 0x000670, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_result) == 0x000678, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_result' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_customData_1) == 0x000690, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_customData_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_error) == 0x000698, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_error' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_customData) == 0x0006D0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_customData' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_ConstructJsonObject_ReturnValue_2) == 0x0006D8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_ConstructJsonObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CreateDelegate_OutputDelegate_7) == 0x0006E0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_LowEntry_LocalVariable_Value__2_Object) == 0x0006F0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_LowEntry_LocalVariable_Value__2_Object' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_MakeStruct_ClientWriteClientPlayerEventRequest) == 0x0006F8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_MakeStruct_ClientWriteClientPlayerEventRequest' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_WritePlayerEvent_ReturnValue) == 0x000730, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_WritePlayerEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_IsValid_ReturnValue_1) == 0x000738, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CreateDelegate_OutputDelegate_8) == 0x00073C, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, Temp_struct_Variable_2) == 0x000750, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_ExecuteCloudScript_ReturnValue_1) == 0x000790, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_ExecuteCloudScript_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_IsValid_ReturnValue_2) == 0x000798, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, Temp_object_Variable_2) == 0x0007A0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, Temp_bool_Variable_2) == 0x0007A8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_response_2) == 0x0007B0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_response_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_customData_8) == 0x0007F0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_customData_8' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CustomEvent_successful_2) == 0x0007F8, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CustomEvent_successful_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetSteamUILanguage_ReturnValue) == 0x000800, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetSteamUILanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_CreateDelegate_OutputDelegate_9) == 0x000810, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_GetText_ReturnValue) == 0x000820, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_Conv_TextToString_ReturnValue) == 0x000838, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, K2Node_Event_IsDesignTime) == 0x000848, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_Conv_StringToDouble_ReturnValue) == 0x000850, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_Conv_StringToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000858, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_FTrunc_ReturnValue_2) == 0x000860, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000868, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_SetNumberField_Number_ImplicitCast) == 0x000880, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_SetNumberField_Number_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_FTrunc_A_ImplicitCast) == 0x000888, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_FTrunc_A_ImplicitCast_1) == 0x000890, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_FTrunc_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000898, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item, CallFunc_SetNumberField_Number_ImplicitCast_1) == 0x0008A0, "Member 'UI_Shop_Crowns_Item_C_ExecuteUbergraph_UI_Shop_Crowns_Item::CallFunc_SetNumberField_Number_ImplicitCast_1' has a wrong offset!");

// Function UI_Shop_Crowns_Item.UI_Shop_Crowns_Item_C.MicroTxnAuthorizationResponse_Event
// 0x0020 (0x0020 - 0x0000)
struct UI_Shop_Crowns_Item_C_MicroTxnAuthorizationResponse_Event final
{
public:
	struct FMicroTxnAuthorizationResponse         Data;                                              // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UI_Shop_Crowns_Item_C_MicroTxnAuthorizationResponse_Event) == 0x000008, "Wrong alignment on UI_Shop_Crowns_Item_C_MicroTxnAuthorizationResponse_Event");
static_assert(sizeof(UI_Shop_Crowns_Item_C_MicroTxnAuthorizationResponse_Event) == 0x000020, "Wrong size on UI_Shop_Crowns_Item_C_MicroTxnAuthorizationResponse_Event");
static_assert(offsetof(UI_Shop_Crowns_Item_C_MicroTxnAuthorizationResponse_Event, Data) == 0x000000, "Member 'UI_Shop_Crowns_Item_C_MicroTxnAuthorizationResponse_Event::Data' has a wrong offset!");

// Function UI_Shop_Crowns_Item.UI_Shop_Crowns_Item_C.OnPlayFabResponse_66223ADF443722A34A0A8599C770D5C1
// 0x0050 (0x0050 - 0x0000)
struct UI_Shop_Crowns_Item_C_OnPlayFabResponse_66223ADF443722A34A0A8599C770D5C1 final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_Crowns_Item_C_OnPlayFabResponse_66223ADF443722A34A0A8599C770D5C1) == 0x000008, "Wrong alignment on UI_Shop_Crowns_Item_C_OnPlayFabResponse_66223ADF443722A34A0A8599C770D5C1");
static_assert(sizeof(UI_Shop_Crowns_Item_C_OnPlayFabResponse_66223ADF443722A34A0A8599C770D5C1) == 0x000050, "Wrong size on UI_Shop_Crowns_Item_C_OnPlayFabResponse_66223ADF443722A34A0A8599C770D5C1");
static_assert(offsetof(UI_Shop_Crowns_Item_C_OnPlayFabResponse_66223ADF443722A34A0A8599C770D5C1, Response) == 0x000000, "Member 'UI_Shop_Crowns_Item_C_OnPlayFabResponse_66223ADF443722A34A0A8599C770D5C1::Response' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_OnPlayFabResponse_66223ADF443722A34A0A8599C770D5C1, CustomData) == 0x000040, "Member 'UI_Shop_Crowns_Item_C_OnPlayFabResponse_66223ADF443722A34A0A8599C770D5C1::CustomData' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_Item_C_OnPlayFabResponse_66223ADF443722A34A0A8599C770D5C1, Successful) == 0x000048, "Member 'UI_Shop_Crowns_Item_C_OnPlayFabResponse_66223ADF443722A34A0A8599C770D5C1::Successful' has a wrong offset!");

// Function UI_Shop_Crowns_Item.UI_Shop_Crowns_Item_C.OnPlayFabResponse_C3FC67CC42771B9E1E218DAC04D28114
// 0x0050 (0x0050 - 0x0000)
struct UI_Shop_Crowns_Item_C_OnPlayFabResponse_C3FC67CC42771B9E1E218DAC04D28114 final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_Crowns_Item_C_OnPlayFabResponse_C3FC67CC42771B9E1E218DAC04D28114) == 0x000008, "Wrong alignment on UI_Shop_Crowns_Item_C_OnPlayFabResponse_C3FC67CC42771B9E1E218DAC04D28114");
static_assert(sizeof(UI_Shop_Crowns_Item_C_OnPlayFabResponse_C3FC67CC42771B9E1E218DAC04D28114) == 0x000050, "Wrong size on UI_Shop_Crowns_Item_C_OnPlayFabResponse_C3FC67CC42771B9E1E218DAC04D28114");
static_assert(offsetof(UI_Shop_Crowns_Item_C_OnPlayFabResponse_C3FC67CC42771B9E1E218DAC04D28114, Response) == 0x000000, "Member 'UI_Shop_Crowns_Item_C_OnPlayFabResponse_C3FC67CC42771B9E1E218DAC04D28114::Response' has a wrong offset!");
