#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Shop_Crowns

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Shop_Crowns.UI_Shop_Crowns_C
// 0x0038 (0x02B8 - 0x0280)
class UUI_Shop_Crowns_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScaleBox*                              ScaleBox_General;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Shop_Crowns_Item_C*                 UI_Shop_Crowns_Item_01;                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Shop_Crowns_Item_C*                 UI_Shop_Crowns_Item_02;                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Shop_Crowns_Item_C*                 UI_Shop_Crowns_Item_03;                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Shop_Crowns_Item_C*                 UI_Shop_Crowns_Item_04;                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Shop_Crowns_Item_C*                 UI_Shop_Crowns_Item_05;                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_Shop_Crowns(int32 EntryPoint);
	void OnUpdatePlayerCombinedInfo_Event(const TArray<EModifiedData>& ModifiedData, const class FString& CustomString);
	void SetIsActive(bool IsActive, class UUI_Shop_Crowns_Item_C* ItemLoading);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Shop_Crowns_C">();
	}
	static class UUI_Shop_Crowns_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Shop_Crowns_C>();
	}
};
static_assert(alignof(UUI_Shop_Crowns_C) == 0x000008, "Wrong alignment on UUI_Shop_Crowns_C");
static_assert(sizeof(UUI_Shop_Crowns_C) == 0x0002B8, "Wrong size on UUI_Shop_Crowns_C");
static_assert(offsetof(UUI_Shop_Crowns_C, UberGraphFrame) == 0x000280, "Member 'UUI_Shop_Crowns_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_C, ScaleBox_General) == 0x000288, "Member 'UUI_Shop_Crowns_C::ScaleBox_General' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_C, UI_Shop_Crowns_Item_01) == 0x000290, "Member 'UUI_Shop_Crowns_C::UI_Shop_Crowns_Item_01' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_C, UI_Shop_Crowns_Item_02) == 0x000298, "Member 'UUI_Shop_Crowns_C::UI_Shop_Crowns_Item_02' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_C, UI_Shop_Crowns_Item_03) == 0x0002A0, "Member 'UUI_Shop_Crowns_C::UI_Shop_Crowns_Item_03' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_C, UI_Shop_Crowns_Item_04) == 0x0002A8, "Member 'UUI_Shop_Crowns_C::UI_Shop_Crowns_Item_04' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Crowns_C, UI_Shop_Crowns_Item_05) == 0x0002B0, "Member 'UUI_Shop_Crowns_C::UI_Shop_Crowns_Item_05' has a wrong offset!");

}

