#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Shop_ConfirmPurchase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Shop_ConfirmPurchase.UI_Shop_ConfirmPurchase_C
// 0x0038 (0x02B8 - 0x0280)
class UUI_Shop_ConfirmPurchase_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Buy;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Cancel;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemName;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ItemName;                                          // 0x02A0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void BndEvt__UI_Shop_ConfirmPurchase_Button_Buy_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Shop_ConfirmPurchase_Button_Cancel_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_UI_Shop_ConfirmPurchase(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Shop_ConfirmPurchase_C">();
	}
	static class UUI_Shop_ConfirmPurchase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Shop_ConfirmPurchase_C>();
	}
};
static_assert(alignof(UUI_Shop_ConfirmPurchase_C) == 0x000008, "Wrong alignment on UUI_Shop_ConfirmPurchase_C");
static_assert(sizeof(UUI_Shop_ConfirmPurchase_C) == 0x0002B8, "Wrong size on UUI_Shop_ConfirmPurchase_C");
static_assert(offsetof(UUI_Shop_ConfirmPurchase_C, UberGraphFrame) == 0x000280, "Member 'UUI_Shop_ConfirmPurchase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Shop_ConfirmPurchase_C, Button_Buy) == 0x000288, "Member 'UUI_Shop_ConfirmPurchase_C::Button_Buy' has a wrong offset!");
static_assert(offsetof(UUI_Shop_ConfirmPurchase_C, Button_Cancel) == 0x000290, "Member 'UUI_Shop_ConfirmPurchase_C::Button_Cancel' has a wrong offset!");
static_assert(offsetof(UUI_Shop_ConfirmPurchase_C, TextBlock_ItemName) == 0x000298, "Member 'UUI_Shop_ConfirmPurchase_C::TextBlock_ItemName' has a wrong offset!");
static_assert(offsetof(UUI_Shop_ConfirmPurchase_C, ItemName) == 0x0002A0, "Member 'UUI_Shop_ConfirmPurchase_C::ItemName' has a wrong offset!");

}

