#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Shop_Crowns

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_Shop_Crowns.UI_Shop_Crowns_C.ExecuteUbergraph_UI_Shop_Crowns
// 0x0108 (0x0108 - 0x0000)
struct UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPanelWidget*>                   K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UPanelWidget*>                   K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_360B[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_360C[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<EModifiedData>& ModifiedData, const class FString& CustomString)> K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_360D[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_CustomEvent_ModifiedData;                   // 0x0068(0x0010)(ConstParm, ReferenceParm)
	class FString                                 K2Node_CustomEvent_CustomString;                   // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<EModifiedData>                         K2Node_MakeArray_Array_1;                          // 0x0088(0x0010)(ConstParm, ReferenceParm)
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_360E[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_Crowns_Item_C*                 K2Node_DynamicCast_AsUI_Shop_Crowns_Item;          // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_360F[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           K2Node_DynamicCast_AsPanel_Widget;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3610[0x2];                                     // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3611[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3612[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns) == 0x000008, "Wrong alignment on UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns");
static_assert(sizeof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns) == 0x000108, "Wrong size on UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, EntryPoint) == 0x000000, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, K2Node_MakeArray_Array) == 0x000008, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000018, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, CallFunc_Array_Get_Item) == 0x000030, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, CallFunc_GetChildrenCount_ReturnValue) == 0x000038, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, CallFunc_GetPlayerController_ReturnValue) == 0x000060, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, K2Node_CustomEvent_ModifiedData) == 0x000068, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::K2Node_CustomEvent_ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, K2Node_CustomEvent_CustomString) == 0x000078, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::K2Node_CustomEvent_CustomString' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, K2Node_MakeArray_Array_1) == 0x000088, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, K2Node_DynamicCast_AsPG_Player_State_Menu) == 0x000098, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::K2Node_DynamicCast_AsPG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, Temp_int_Variable) == 0x0000A4, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, CallFunc_GetChildAt_ReturnValue) == 0x0000A8, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, K2Node_DynamicCast_AsUI_Shop_Crowns_Item) == 0x0000B0, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::K2Node_DynamicCast_AsUI_Shop_Crowns_Item' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, K2Node_DynamicCast_AsPanel_Widget) == 0x0000C0, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::K2Node_DynamicCast_AsPanel_Widget' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, K2Node_DynamicCast_bSuccess_2) == 0x0000C8, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000C9, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, CallFunc_Array_Add_ReturnValue) == 0x0000CC, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D0, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x0000D8, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, CallFunc_GetObjectField_ReturnValue) == 0x0000E8, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, CallFunc_GetObjectField_ReturnValue_1) == 0x0000F0, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns, CallFunc_GetStringField_ReturnValue) == 0x0000F8, "Member 'UI_Shop_Crowns_C_ExecuteUbergraph_UI_Shop_Crowns::CallFunc_GetStringField_ReturnValue' has a wrong offset!");

// Function UI_Shop_Crowns.UI_Shop_Crowns_C.OnUpdatePlayerCombinedInfo_Event
// 0x0020 (0x0020 - 0x0000)
struct UI_Shop_Crowns_C_OnUpdatePlayerCombinedInfo_Event final
{
public:
	TArray<EModifiedData>                         ModifiedData;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 CustomString;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_Crowns_C_OnUpdatePlayerCombinedInfo_Event) == 0x000008, "Wrong alignment on UI_Shop_Crowns_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(sizeof(UI_Shop_Crowns_C_OnUpdatePlayerCombinedInfo_Event) == 0x000020, "Wrong size on UI_Shop_Crowns_C_OnUpdatePlayerCombinedInfo_Event");
static_assert(offsetof(UI_Shop_Crowns_C_OnUpdatePlayerCombinedInfo_Event, ModifiedData) == 0x000000, "Member 'UI_Shop_Crowns_C_OnUpdatePlayerCombinedInfo_Event::ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_OnUpdatePlayerCombinedInfo_Event, CustomString) == 0x000010, "Member 'UI_Shop_Crowns_C_OnUpdatePlayerCombinedInfo_Event::CustomString' has a wrong offset!");

// Function UI_Shop_Crowns.UI_Shop_Crowns_C.SetIsActive
// 0x0058 (0x0058 - 0x0000)
struct UI_Shop_Crowns_C_SetIsActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3613[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Shop_Crowns_Item_C*                 ItemLoading;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_Crowns_Item_C*                 L_ItemLoading;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          L_IsActive;                                        // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3614[0x1];                                     // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3615[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_Crowns_Item_C*                 K2Node_DynamicCast_AsUI_Shop_Crowns_Item;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3616[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_Crowns_C_SetIsActive) == 0x000008, "Wrong alignment on UI_Shop_Crowns_C_SetIsActive");
static_assert(sizeof(UI_Shop_Crowns_C_SetIsActive) == 0x000058, "Wrong size on UI_Shop_Crowns_C_SetIsActive");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, IsActive) == 0x000000, "Member 'UI_Shop_Crowns_C_SetIsActive::IsActive' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, ItemLoading) == 0x000008, "Member 'UI_Shop_Crowns_C_SetIsActive::ItemLoading' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, L_ItemLoading) == 0x000010, "Member 'UI_Shop_Crowns_C_SetIsActive::L_ItemLoading' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, L_IsActive) == 0x000018, "Member 'UI_Shop_Crowns_C_SetIsActive::L_IsActive' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, Temp_byte_Variable) == 0x000019, "Member 'UI_Shop_Crowns_C_SetIsActive::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, Temp_byte_Variable_1) == 0x00001A, "Member 'UI_Shop_Crowns_C_SetIsActive::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'UI_Shop_Crowns_C_SetIsActive::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'UI_Shop_Crowns_C_SetIsActive::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'UI_Shop_Crowns_C_SetIsActive::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, CallFunc_Array_Get_Item) == 0x000038, "Member 'UI_Shop_Crowns_C_SetIsActive::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, K2Node_DynamicCast_AsUI_Shop_Crowns_Item) == 0x000040, "Member 'UI_Shop_Crowns_C_SetIsActive::K2Node_DynamicCast_AsUI_Shop_Crowns_Item' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'UI_Shop_Crowns_C_SetIsActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'UI_Shop_Crowns_C_SetIsActive::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'UI_Shop_Crowns_C_SetIsActive::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'UI_Shop_Crowns_C_SetIsActive::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, CallFunc_IsValid_ReturnValue) == 0x000055, "Member 'UI_Shop_Crowns_C_SetIsActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, Temp_bool_Variable) == 0x000056, "Member 'UI_Shop_Crowns_C_SetIsActive::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_Crowns_C_SetIsActive, K2Node_Select_Default) == 0x000057, "Member 'UI_Shop_Crowns_C_SetIsActive::K2Node_Select_Default' has a wrong offset!");

}

