#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Shop_SteamOverlayIsDisabled

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Shop_SteamOverlayIsDisabled.UI_Shop_SteamOverlayIsDisabled_C
// 0x0028 (0x02A8 - 0x0280)
class UUI_Shop_SteamOverlayIsDisabled_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DiscordHover;                                      // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Discord;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_OK;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__UI_Shop_SteamOverlayIsDisabled_Button_Discord_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Shop_SteamOverlayIsDisabled_Button_Discord_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Shop_SteamOverlayIsDisabled_Button_Discord_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_WarningNoPC_Button_Yes_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_Shop_SteamOverlayIsDisabled(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Shop_SteamOverlayIsDisabled_C">();
	}
	static class UUI_Shop_SteamOverlayIsDisabled_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Shop_SteamOverlayIsDisabled_C>();
	}
};
static_assert(alignof(UUI_Shop_SteamOverlayIsDisabled_C) == 0x000008, "Wrong alignment on UUI_Shop_SteamOverlayIsDisabled_C");
static_assert(sizeof(UUI_Shop_SteamOverlayIsDisabled_C) == 0x0002A8, "Wrong size on UUI_Shop_SteamOverlayIsDisabled_C");
static_assert(offsetof(UUI_Shop_SteamOverlayIsDisabled_C, UberGraphFrame) == 0x000280, "Member 'UUI_Shop_SteamOverlayIsDisabled_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Shop_SteamOverlayIsDisabled_C, DiscordHover) == 0x000288, "Member 'UUI_Shop_SteamOverlayIsDisabled_C::DiscordHover' has a wrong offset!");
static_assert(offsetof(UUI_Shop_SteamOverlayIsDisabled_C, Show) == 0x000290, "Member 'UUI_Shop_SteamOverlayIsDisabled_C::Show' has a wrong offset!");
static_assert(offsetof(UUI_Shop_SteamOverlayIsDisabled_C, Button_Discord) == 0x000298, "Member 'UUI_Shop_SteamOverlayIsDisabled_C::Button_Discord' has a wrong offset!");
static_assert(offsetof(UUI_Shop_SteamOverlayIsDisabled_C, Button_OK) == 0x0002A0, "Member 'UUI_Shop_SteamOverlayIsDisabled_C::Button_OK' has a wrong offset!");

}

