#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Shop_WeaponInfo

#include "Basic.hpp"

#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_Shop_WeaponInfo.UI_Shop_WeaponInfo_C.AsyncLoadIcon
// 0x0030 (0x0030 - 0x0000)
struct UI_Shop_WeaponInfo_C_AsyncLoadIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              ItemIcon;                                          // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_WeaponInfo_C_AsyncLoadIcon) == 0x000008, "Wrong alignment on UI_Shop_WeaponInfo_C_AsyncLoadIcon");
static_assert(sizeof(UI_Shop_WeaponInfo_C_AsyncLoadIcon) == 0x000030, "Wrong size on UI_Shop_WeaponInfo_C_AsyncLoadIcon");
static_assert(offsetof(UI_Shop_WeaponInfo_C_AsyncLoadIcon, ItemIcon) == 0x000000, "Member 'UI_Shop_WeaponInfo_C_AsyncLoadIcon::ItemIcon' has a wrong offset!");

// Function UI_Shop_WeaponInfo.UI_Shop_WeaponInfo_C.ExecuteUbergraph_UI_Shop_WeaponInfo
// 0x0068 (0x0068 - 0x0000)
struct UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3628[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3629[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_ItemIcon;                       // 0x0038(0x0030)(HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo) == 0x000008, "Wrong alignment on UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo");
static_assert(sizeof(UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo) == 0x000068, "Wrong size on UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo");
static_assert(offsetof(UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo, EntryPoint) == 0x000000, "Member 'UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo, Temp_object_Variable) == 0x000020, "Member 'UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo, K2Node_DynamicCast_AsTexture_2D) == 0x000028, "Member 'UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo, K2Node_CustomEvent_ItemIcon) == 0x000038, "Member 'UI_Shop_WeaponInfo_C_ExecuteUbergraph_UI_Shop_WeaponInfo::K2Node_CustomEvent_ItemIcon' has a wrong offset!");

// Function UI_Shop_WeaponInfo.UI_Shop_WeaponInfo_C.OnLoaded_ECDC8DF143777CE09D69AAA24015BF8E
// 0x0008 (0x0008 - 0x0000)
struct UI_Shop_WeaponInfo_C_OnLoaded_ECDC8DF143777CE09D69AAA24015BF8E final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_WeaponInfo_C_OnLoaded_ECDC8DF143777CE09D69AAA24015BF8E) == 0x000008, "Wrong alignment on UI_Shop_WeaponInfo_C_OnLoaded_ECDC8DF143777CE09D69AAA24015BF8E");
static_assert(sizeof(UI_Shop_WeaponInfo_C_OnLoaded_ECDC8DF143777CE09D69AAA24015BF8E) == 0x000008, "Wrong size on UI_Shop_WeaponInfo_C_OnLoaded_ECDC8DF143777CE09D69AAA24015BF8E");
static_assert(offsetof(UI_Shop_WeaponInfo_C_OnLoaded_ECDC8DF143777CE09D69AAA24015BF8E, Loaded) == 0x000000, "Member 'UI_Shop_WeaponInfo_C_OnLoaded_ECDC8DF143777CE09D69AAA24015BF8E::Loaded' has a wrong offset!");

// Function UI_Shop_WeaponInfo.UI_Shop_WeaponInfo_C.SetNewWeaponInfo
// 0x00C8 (0x00C8 - 0x0000)
struct UI_Shop_WeaponInfo_C_SetNewWeaponInfo final
{
public:
	class UClass*                                 Param_WeaponClass;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGunShootingType                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362A[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362B[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362C[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362D[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NormalizeToRange_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362E[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetParameters_CurrentParameter_ImplicitCast; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetParameters_CompareParameter_ImplicitCast; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362F[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo) == 0x000008, "Wrong alignment on UI_Shop_WeaponInfo_C_SetNewWeaponInfo");
static_assert(sizeof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo) == 0x0000C8, "Wrong size on UI_Shop_WeaponInfo_C_SetNewWeaponInfo");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, Param_WeaponClass) == 0x000000, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::Param_WeaponClass' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, Temp_byte_Variable) == 0x000008, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, Temp_int_Variable) == 0x00000C, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, Temp_int_Variable_1) == 0x000010, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, Temp_int_Variable_2) == 0x000014, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_IsValidClass_ReturnValue) == 0x000018, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000028, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, K2Node_Select_Default) == 0x000038, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_NormalizeToRange_ReturnValue) == 0x000040, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_GetFloatValue_ReturnValue) == 0x000048, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000058, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000060, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_FClamp_ReturnValue) == 0x000068, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000070, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_SetParameters_CurrentParameter_ImplicitCast) == 0x000078, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_SetParameters_CurrentParameter_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_SetParameters_CompareParameter_ImplicitCast) == 0x000080, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_SetParameters_CompareParameter_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000088, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000090, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000098, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x0000A0, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x0000A8, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x0000B0, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_FClamp_Value_ImplicitCast) == 0x0000B8, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Shop_WeaponInfo_C_SetNewWeaponInfo, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0000C0, "Member 'UI_Shop_WeaponInfo_C_SetNewWeaponInfo::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");

}

