#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Shop_VIP_Button

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PlayFab_structs.hpp"
#include "POLYGON_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_Shop_VIP_Button.UI_Shop_VIP_Button_C.ExecuteUbergraph_UI_Shop_VIP_Button
// 0x0498 (0x0498 - 0x0000)
struct UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35EA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result;                         // 0x0008(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue;          // 0x0098(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A8(0x0018)()
	class UPlayFabJsonObject*                     CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35EB[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x00E0(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35EC[0x6];                                     // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x0138(0x0040)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35ED[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0180(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35EE[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x01A0(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35EF[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01C8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0218(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0228(0x0018)()
	TDelegate<void(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0240(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_WarningNoPC_C*                 CallFunc_Create_ReturnValue;                       // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Menu_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Menu;      // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35F0[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EModifiedData>                         K2Node_MakeArray_Array_1;                          // 0x0278(0x0010)(ConstParm, ReferenceParm)
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0298(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35F1[0x4];                                     // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x02C0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0310(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0320(0x0018)()
	class UUI_Shop_ConfirmPurchase_C*             CallFunc_Create_ReturnValue_1;                     // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0340(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35F2[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptRequest       K2Node_MakeStruct_ClientExecuteCloudScriptRequest; // 0x0388(0x0030)()
	class UPlayFabClientAPI*                      CallFunc_ExecuteCloudScript_ReturnValue;           // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35F3[0x7];                                     // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_1;      // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35F4[0x7];                                     // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_2;             // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_1;             // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35F5[0x4];                                     // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x03F8(0x0018)()
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x0410(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0450(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0468(0x0018)()
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast;       // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button) == 0x000008, "Wrong alignment on UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button");
static_assert(sizeof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button) == 0x000498, "Wrong size on UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, EntryPoint) == 0x000000, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_CustomEvent_result) == 0x000008, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_CustomEvent_result' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_CustomEvent_customData) == 0x000068, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_CustomEvent_customData' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_GetObjectField_ReturnValue) == 0x000080, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_GetStringField_ReturnValue) == 0x000088, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_GetObjectArrayField_ReturnValue) == 0x000098, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_GetObjectArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A8, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_GetBoolField_ReturnValue) == 0x0000C8, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_GetBoolField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_GetStringField_ReturnValue_1) == 0x0000D0, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_CustomEvent_response) == 0x0000E0, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_CustomEvent_customData_2) == 0x000120, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_CustomEvent_customData_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_CustomEvent_successful) == 0x000128, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, Temp_bool_Variable) == 0x000129, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, Temp_object_Variable) == 0x000130, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, Temp_struct_Variable) == 0x000138, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_Event_IsDesignTime) == 0x000178, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Conv_IntToText_ReturnValue) == 0x000180, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Greater_IntInt_ReturnValue) == 0x000198, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0001A0, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001B8, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0001C0, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_MakeStruct_FormatArgumentData) == 0x0001C8, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_MakeArray_Array) == 0x000218, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Format_ReturnValue) == 0x000228, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_CreateDelegate_OutputDelegate_1) == 0x000240, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_GetPlayerController_ReturnValue) == 0x000250, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Create_ReturnValue) == 0x000258, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_GetPlayerController_ReturnValue_1) == 0x000260, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_DynamicCast_AsBP_PG_Player_State_Menu) == 0x000268, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_DynamicCast_AsBP_PG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_DynamicCast_bSuccess) == 0x000270, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_MakeArray_Array_1) == 0x000278, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x000288, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_GetObjectField_ReturnValue_1) == 0x000290, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_CreateDelegate_OutputDelegate_2) == 0x000298, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_GetNumberField_ReturnValue) == 0x0002A8, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Round_ReturnValue) == 0x0002AC, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0002B0, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Subtract_IntInt_ReturnValue) == 0x0002B8, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_MakeStruct_FormatArgumentData_1) == 0x0002C0, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_MakeArray_Array_2) == 0x000310, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Format_ReturnValue_1) == 0x000320, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Create_ReturnValue_1) == 0x000338, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_CreateDelegate_OutputDelegate_3) == 0x000340, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000350, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_GetPlayerController_ReturnValue_2) == 0x000358, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000360, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_DynamicCast_bSuccess_1) == 0x000368, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_ConstructJsonObject_ReturnValue) == 0x000370, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000378, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_GetPlayerController_ReturnValue_3) == 0x000380, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_MakeStruct_ClientExecuteCloudScriptRequest) == 0x000388, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_MakeStruct_ClientExecuteCloudScriptRequest' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_ExecuteCloudScript_ReturnValue) == 0x0003B8, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_ExecuteCloudScript_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_DynamicCast_AsPG_Player_State_Menu) == 0x0003C0, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_DynamicCast_AsPG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_DynamicCast_bSuccess_2) == 0x0003C8, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_GetPlayerCombinedInfo_ReturnValue_1) == 0x0003D0, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_GetPlayerCombinedInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_IsValid_ReturnValue) == 0x0003D8, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_GetObjectField_ReturnValue_2) == 0x0003E0, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_GetObjectField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_GetNumberField_ReturnValue_1) == 0x0003E8, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_GetNumberField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0003F0, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_MakeLiteralText_ReturnValue) == 0x0003F8, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_CustomEvent_error) == 0x000410, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_CustomEvent_error' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, K2Node_CustomEvent_customData_1) == 0x000448, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::K2Node_CustomEvent_customData_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000450, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000468, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Round_A_ImplicitCast) == 0x000480, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Round_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000488, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button, CallFunc_SetNumberField_Number_ImplicitCast) == 0x000490, "Member 'UI_Shop_VIP_Button_C_ExecuteUbergraph_UI_Shop_VIP_Button::CallFunc_SetNumberField_Number_ImplicitCast' has a wrong offset!");

// Function UI_Shop_VIP_Button.UI_Shop_VIP_Button_C.OnPlayFabResponse_089383D84669101F1269ABB1AD6D1DB1
// 0x0050 (0x0050 - 0x0000)
struct UI_Shop_VIP_Button_C_OnPlayFabResponse_089383D84669101F1269ABB1AD6D1DB1 final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_VIP_Button_C_OnPlayFabResponse_089383D84669101F1269ABB1AD6D1DB1) == 0x000008, "Wrong alignment on UI_Shop_VIP_Button_C_OnPlayFabResponse_089383D84669101F1269ABB1AD6D1DB1");
static_assert(sizeof(UI_Shop_VIP_Button_C_OnPlayFabResponse_089383D84669101F1269ABB1AD6D1DB1) == 0x000050, "Wrong size on UI_Shop_VIP_Button_C_OnPlayFabResponse_089383D84669101F1269ABB1AD6D1DB1");
static_assert(offsetof(UI_Shop_VIP_Button_C_OnPlayFabResponse_089383D84669101F1269ABB1AD6D1DB1, Response) == 0x000000, "Member 'UI_Shop_VIP_Button_C_OnPlayFabResponse_089383D84669101F1269ABB1AD6D1DB1::Response' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_OnPlayFabResponse_089383D84669101F1269ABB1AD6D1DB1, CustomData) == 0x000040, "Member 'UI_Shop_VIP_Button_C_OnPlayFabResponse_089383D84669101F1269ABB1AD6D1DB1::CustomData' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_OnPlayFabResponse_089383D84669101F1269ABB1AD6D1DB1, Successful) == 0x000048, "Member 'UI_Shop_VIP_Button_C_OnPlayFabResponse_089383D84669101F1269ABB1AD6D1DB1::Successful' has a wrong offset!");

// Function UI_Shop_VIP_Button.UI_Shop_VIP_Button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Shop_VIP_Button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_VIP_Button_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Shop_VIP_Button_C_PreConstruct");
static_assert(sizeof(UI_Shop_VIP_Button_C_PreConstruct) == 0x000001, "Wrong size on UI_Shop_VIP_Button_C_PreConstruct");
static_assert(offsetof(UI_Shop_VIP_Button_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Shop_VIP_Button_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_Shop_VIP_Button.UI_Shop_VIP_Button_C.PurchaseVIP_Failure
// 0x0040 (0x0040 - 0x0000)
struct UI_Shop_VIP_Button_C_PurchaseVIP_Failure final
{
public:
	struct FPlayFabError                          Error;                                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_VIP_Button_C_PurchaseVIP_Failure) == 0x000008, "Wrong alignment on UI_Shop_VIP_Button_C_PurchaseVIP_Failure");
static_assert(sizeof(UI_Shop_VIP_Button_C_PurchaseVIP_Failure) == 0x000040, "Wrong size on UI_Shop_VIP_Button_C_PurchaseVIP_Failure");
static_assert(offsetof(UI_Shop_VIP_Button_C_PurchaseVIP_Failure, Error) == 0x000000, "Member 'UI_Shop_VIP_Button_C_PurchaseVIP_Failure::Error' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_PurchaseVIP_Failure, CustomData) == 0x000038, "Member 'UI_Shop_VIP_Button_C_PurchaseVIP_Failure::CustomData' has a wrong offset!");

// Function UI_Shop_VIP_Button.UI_Shop_VIP_Button_C.PurchaseVIP_Success
// 0x0068 (0x0068 - 0x0000)
struct UI_Shop_VIP_Button_C_PurchaseVIP_Success final
{
public:
	struct FClientExecuteCloudScriptResult        Result;                                            // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_VIP_Button_C_PurchaseVIP_Success) == 0x000008, "Wrong alignment on UI_Shop_VIP_Button_C_PurchaseVIP_Success");
static_assert(sizeof(UI_Shop_VIP_Button_C_PurchaseVIP_Success) == 0x000068, "Wrong size on UI_Shop_VIP_Button_C_PurchaseVIP_Success");
static_assert(offsetof(UI_Shop_VIP_Button_C_PurchaseVIP_Success, Result) == 0x000000, "Member 'UI_Shop_VIP_Button_C_PurchaseVIP_Success::Result' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_PurchaseVIP_Success, CustomData) == 0x000060, "Member 'UI_Shop_VIP_Button_C_PurchaseVIP_Success::CustomData' has a wrong offset!");

// Function UI_Shop_VIP_Button.UI_Shop_VIP_Button_C.SetCanBuy
// 0x0180 (0x0180 - 0x0000)
struct UI_Shop_VIP_Button_C_SetCanBuy final
{
public:
	int32                                         PC;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35F6[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35F7[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x006C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0080(0x0014)()
	uint8                                         Pad_35F8[0xC];                                     // 0x0094(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00A0(0x00D0)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_VIP_Button_C_SetCanBuy) == 0x000010, "Wrong alignment on UI_Shop_VIP_Button_C_SetCanBuy");
static_assert(sizeof(UI_Shop_VIP_Button_C_SetCanBuy) == 0x000180, "Wrong size on UI_Shop_VIP_Button_C_SetCanBuy");
static_assert(offsetof(UI_Shop_VIP_Button_C_SetCanBuy, PC) == 0x000000, "Member 'UI_Shop_VIP_Button_C_SetCanBuy::PC' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_SetCanBuy, Temp_bool_Variable) == 0x000004, "Member 'UI_Shop_VIP_Button_C_SetCanBuy::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_SetCanBuy, Temp_struct_Variable) == 0x000008, "Member 'UI_Shop_VIP_Button_C_SetCanBuy::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_VIP_Button_C_SetCanBuy, Temp_struct_Variable_1) == 0x000018, "Member 'UI_Shop_VIP_Button_C_SetCanBuy::Temp_struct_Variable_1' has a wrong offset!");
