#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Scoreboard

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "POLYGON_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_Scoreboard.UI_Scoreboard_C.AddPlayersToTab
// 0x0140 (0x0140 - 0x0000)
struct UI_Scoreboard_C_AddPlayersToTab final
{
public:
	ETeam                                         Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APG_PlayerState_Game*>           L_Players;                                         // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         L_AddToIndex;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC2[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APG_PlayerState_Game*                   L_Player;                                          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	ETeam                                         L_Team;                                            // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETeam                                         Temp_byte_Variable;                                // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC3[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           Temp_object_Variable_1;                            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           Temp_object_Variable_2;                            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC4[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC5[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           Temp_object_Variable_3;                            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETeam                                         Temp_byte_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC6[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APG_PlayerState_Game*>           Temp_object_Variable_4;                            // 0x0080(0x0010)(ReferenceParm)
	class ABP_PG_GameState_Game_C*                CallFunc_GetGameStateBP_MyGameState;               // 0x0090(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class APG_PlayerState_Game*>           Temp_object_Variable_5;                            // 0x0098(0x0010)(ReferenceParm)
	ETeam                                         Temp_byte_Variable_2;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC7[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC8[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           K2Node_Select_Default;                             // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Scoreboard_Player_C*                CallFunc_Create_ReturnValue;                       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Game*                   CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC9[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScore_ReturnValue;                     // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DCA[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APG_PlayerState_Game*                   CallFunc_Array_Get_Item_1;                         // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScore_ReturnValue_1;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DCB[0x5];                                     // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APG_PlayerState_Game*>           K2Node_Select_Default_1;                           // 0x0108(0x0010)(ReferenceParm)
	class UPanelWidget*                           K2Node_Select_Default_2;                           // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Game*                   CallFunc_Array_Get_Item_2;                         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DCC[0x3];                                     // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Scoreboard_C_AddPlayersToTab) == 0x000008, "Wrong alignment on UI_Scoreboard_C_AddPlayersToTab");
static_assert(sizeof(UI_Scoreboard_C_AddPlayersToTab) == 0x000140, "Wrong size on UI_Scoreboard_C_AddPlayersToTab");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, Team) == 0x000000, "Member 'UI_Scoreboard_C_AddPlayersToTab::Team' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, L_Players) == 0x000008, "Member 'UI_Scoreboard_C_AddPlayersToTab::L_Players' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, L_AddToIndex) == 0x000018, "Member 'UI_Scoreboard_C_AddPlayersToTab::L_AddToIndex' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, L_Player) == 0x000020, "Member 'UI_Scoreboard_C_AddPlayersToTab::L_Player' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, L_Team) == 0x000028, "Member 'UI_Scoreboard_C_AddPlayersToTab::L_Team' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00002A, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, Temp_byte_Variable) == 0x00002B, "Member 'UI_Scoreboard_C_AddPlayersToTab::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_BooleanOR_ReturnValue) == 0x00002C, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, Temp_object_Variable) == 0x000030, "Member 'UI_Scoreboard_C_AddPlayersToTab::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, Temp_object_Variable_1) == 0x000038, "Member 'UI_Scoreboard_C_AddPlayersToTab::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, Temp_object_Variable_2) == 0x000040, "Member 'UI_Scoreboard_C_AddPlayersToTab::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'UI_Scoreboard_C_AddPlayersToTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, Temp_bool_True_if_break_was_hit_Variable) == 0x000050, "Member 'UI_Scoreboard_C_AddPlayersToTab::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, Temp_int_Array_Index_Variable) == 0x000054, "Member 'UI_Scoreboard_C_AddPlayersToTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Not_PreBool_ReturnValue) == 0x000058, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, Temp_int_Array_Index_Variable_1) == 0x00005C, "Member 'UI_Scoreboard_C_AddPlayersToTab::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, Temp_int_Loop_Counter_Variable_1) == 0x000064, "Member 'UI_Scoreboard_C_AddPlayersToTab::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Add_IntInt_ReturnValue_2) == 0x000068, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, Temp_int_Array_Index_Variable_2) == 0x00006C, "Member 'UI_Scoreboard_C_AddPlayersToTab::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, Temp_object_Variable_3) == 0x000070, "Member 'UI_Scoreboard_C_AddPlayersToTab::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, Temp_byte_Variable_1) == 0x000078, "Member 'UI_Scoreboard_C_AddPlayersToTab::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, Temp_object_Variable_4) == 0x000080, "Member 'UI_Scoreboard_C_AddPlayersToTab::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_GetGameStateBP_MyGameState) == 0x000090, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_GetGameStateBP_MyGameState' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, Temp_object_Variable_5) == 0x000098, "Member 'UI_Scoreboard_C_AddPlayersToTab::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, Temp_byte_Variable_2) == 0x0000A8, "Member 'UI_Scoreboard_C_AddPlayersToTab::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, Temp_int_Loop_Counter_Variable_2) == 0x0000AC, "Member 'UI_Scoreboard_C_AddPlayersToTab::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000B0, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, K2Node_Select_Default) == 0x0000B8, "Member 'UI_Scoreboard_C_AddPlayersToTab::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000C0, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Create_ReturnValue) == 0x0000C8, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_AddChild_ReturnValue) == 0x0000D8, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Less_IntInt_ReturnValue) == 0x0000E4, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_GetScore_ReturnValue) == 0x0000E8, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_GetScore_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Array_Get_Item_1) == 0x0000F0, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_GetScore_ReturnValue_1) == 0x0000F8, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_GetScore_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Array_Length_ReturnValue_1) == 0x0000FC, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000100, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Less_IntInt_ReturnValue_1) == 0x000101, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_BooleanAND_ReturnValue) == 0x000102, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, K2Node_Select_Default_1) == 0x000108, "Member 'UI_Scoreboard_C_AddPlayersToTab::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, K2Node_Select_Default_2) == 0x000118, "Member 'UI_Scoreboard_C_AddPlayersToTab::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Array_Get_Item_2) == 0x000120, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Array_Length_ReturnValue_2) == 0x000128, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Less_IntInt_ReturnValue_2) == 0x00012C, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000130, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_AddPlayersToTab, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000138, "Member 'UI_Scoreboard_C_AddPlayersToTab::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function UI_Scoreboard.UI_Scoreboard_C.ExecuteUbergraph_UI_Scoreboard
// 0x0108 (0x0108 - 0x0000)
struct UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETeam                                         Temp_byte_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DCD[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBorder*                                Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBorder*                                Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ETeam                                         Temp_byte_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DCE[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBorder*                                Temp_object_Variable_2;                            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBorder*                                Temp_object_Variable_3;                            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DCF[0x5];                                     // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_GameState_Game_C*                CallFunc_GetGameStateBP_MyGameState;               // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ABP_PG_GameState_Game_C*                CallFunc_GetGameStateBP_MyGameState_1;             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ABP_PG_GameState_Game_C*                CallFunc_GetGameStateBP_MyGameState_2;             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_GetScoreBravoTeam_ReturnValue;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetScoreAlphaTeam_ReturnValue;            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0080(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0098(0x0018)()
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DD0[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DD1[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBorder*                                K2Node_Select_Default;                             // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBorder*                                K2Node_Select_Default_1;                           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard) == 0x000008, "Wrong alignment on UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard");
static_assert(sizeof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard) == 0x000108, "Wrong size on UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, EntryPoint) == 0x000000, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, Temp_byte_Variable) == 0x000024, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, Temp_object_Variable) == 0x000028, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, Temp_object_Variable_1) == 0x000030, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, Temp_byte_Variable_1) == 0x000038, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, Temp_object_Variable_2) == 0x000040, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, Temp_object_Variable_3) == 0x000048, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, Temp_bool_Has_Been_Initd_Variable) == 0x000050, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, Temp_bool_IsClosed_Variable) == 0x000051, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, K2Node_Event_IsDesignTime) == 0x000052, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000058, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, CallFunc_GetGameStateBP_MyGameState) == 0x000060, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::CallFunc_GetGameStateBP_MyGameState' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, CallFunc_GetGameStateBP_MyGameState_1) == 0x000068, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::CallFunc_GetGameStateBP_MyGameState_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, CallFunc_GetGameStateBP_MyGameState_2) == 0x000070, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::CallFunc_GetGameStateBP_MyGameState_2' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, CallFunc_GetScoreBravoTeam_ReturnValue) == 0x000078, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::CallFunc_GetScoreBravoTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, CallFunc_GetScoreAlphaTeam_ReturnValue) == 0x00007C, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::CallFunc_GetScoreAlphaTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, CallFunc_Conv_IntToText_ReturnValue) == 0x000080, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000098, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, K2Node_CustomEvent_InVisibility) == 0x0000B0, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, K2Node_SwitchEnum_CmpSuccess) == 0x0000B1, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000B8, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x0000C0, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000C9, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0000CA, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, CallFunc_BooleanAND_ReturnValue) == 0x0000CB, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, K2Node_Select_Default) == 0x0000D0, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, K2Node_Select_Default_1) == 0x0000D8, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E0, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F0, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000100, "Member 'UI_Scoreboard_C_ExecuteUbergraph_UI_Scoreboard::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function UI_Scoreboard.UI_Scoreboard_C.OnKeyUp
// 0x0218 (0x0218 - 0x0000)
struct UI_Scoreboard_C_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DD2[0x6];                                     // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UI_Scoreboard_C_OnKeyUp) == 0x000008, "Wrong alignment on UI_Scoreboard_C_OnKeyUp");
static_assert(sizeof(UI_Scoreboard_C_OnKeyUp) == 0x000218, "Wrong size on UI_Scoreboard_C_OnKeyUp");
static_assert(offsetof(UI_Scoreboard_C_OnKeyUp, MyGeometry) == 0x000000, "Member 'UI_Scoreboard_C_OnKeyUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_OnKeyUp, InKeyEvent) == 0x000038, "Member 'UI_Scoreboard_C_OnKeyUp::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_OnKeyUp, ReturnValue) == 0x000078, "Member 'UI_Scoreboard_C_OnKeyUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_OnKeyUp, CallFunc_GetKey_ReturnValue) == 0x000130, "Member 'UI_Scoreboard_C_OnKeyUp::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000148, "Member 'UI_Scoreboard_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_OnKeyUp, CallFunc_IsValid_ReturnValue) == 0x000149, "Member 'UI_Scoreboard_C_OnKeyUp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_OnKeyUp, CallFunc_GetPlayerController_ReturnValue) == 0x000150, "Member 'UI_Scoreboard_C_OnKeyUp::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_OnKeyUp, CallFunc_GetPlayerController_ReturnValue_1) == 0x000158, "Member 'UI_Scoreboard_C_OnKeyUp::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_OnKeyUp, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UI_Scoreboard_C_OnKeyUp::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UI_Scoreboard.UI_Scoreboard_C.OnVisibilityChanged_Event
// 0x0001 (0x0001 - 0x0000)
struct UI_Scoreboard_C_OnVisibilityChanged_Event final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Scoreboard_C_OnVisibilityChanged_Event) == 0x000001, "Wrong alignment on UI_Scoreboard_C_OnVisibilityChanged_Event");
static_assert(sizeof(UI_Scoreboard_C_OnVisibilityChanged_Event) == 0x000001, "Wrong size on UI_Scoreboard_C_OnVisibilityChanged_Event");
static_assert(offsetof(UI_Scoreboard_C_OnVisibilityChanged_Event, InVisibility) == 0x000000, "Member 'UI_Scoreboard_C_OnVisibilityChanged_Event::InVisibility' has a wrong offset!");

// Function UI_Scoreboard.UI_Scoreboard_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Scoreboard_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Scoreboard_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Scoreboard_C_PreConstruct");
static_assert(sizeof(UI_Scoreboard_C_PreConstruct) == 0x000001, "Wrong size on UI_Scoreboard_C_PreConstruct");
static_assert(offsetof(UI_Scoreboard_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Scoreboard_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_Scoreboard.UI_Scoreboard_C.SortPlayers
// 0x00B0 (0x00B0 - 0x0000)
struct UI_Scoreboard_C_SortPlayers final
{
public:
	class UUI_Scoreboard_Player_C*                Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridPanel*                             Tab;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Scoreboard_Player_C*                L_OtherPlayer;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Scoreboard_Player_C*                L_Player;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DD3[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Scoreboard_Player_C*                K2Node_DynamicCast_AsUI_Scoreboard_Player;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DD4[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScore_ReturnValue;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DD5[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_1;             // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScore_ReturnValue_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DD6[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_2;             // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_3;             // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DD7[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue_4;             // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DD8[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Scoreboard_C_SortPlayers) == 0x000008, "Wrong alignment on UI_Scoreboard_C_SortPlayers");
static_assert(sizeof(UI_Scoreboard_C_SortPlayers) == 0x0000B0, "Wrong size on UI_Scoreboard_C_SortPlayers");
static_assert(offsetof(UI_Scoreboard_C_SortPlayers, Player) == 0x000000, "Member 'UI_Scoreboard_C_SortPlayers::Player' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_SortPlayers, Tab) == 0x000008, "Member 'UI_Scoreboard_C_SortPlayers::Tab' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_SortPlayers, L_OtherPlayer) == 0x000010, "Member 'UI_Scoreboard_C_SortPlayers::L_OtherPlayer' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_C_SortPlayers, L_Player) == 0x000018, "Member 'UI_Scoreboard_C_SortPlayers::L_Player' has a wrong offset!");
