#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Shop_WeaponInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Shop_WeaponInfo.UI_Shop_WeaponInfo_C
// 0x0070 (0x02F0 - 0x0280)
class UUI_Shop_WeaponInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_WeaponIcon;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_WeaponName;                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ItemCharacteristic_Parameter_C*     UI_ItemParameter_AccuracyHip;                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ItemCharacteristic_Parameter_C*     UI_ItemParameter_Damage;                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ItemCharacteristic_Parameter_C*     UI_ItemParameter_MagazineCapacity;                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ItemCharacteristic_Parameter_C*     UI_ItemParameter_Mobility;                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ItemCharacteristic_Parameter_C*     UI_ItemParameter_RateOfFire;                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ItemCharacteristic_Parameter_C*     UI_ItemParameter_Recoil;                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ItemCharacteristic_Parameter_C*     UI_ItemParameter_RecoilControl;                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_RecoilControl;                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_ShootingType;                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 WeaponClass;                                       // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CurveItemParameterMultiplier;                      // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AsyncLoadIcon(TSoftObjectPtr<class UTexture2D> ItemIcon);
	void ExecuteUbergraph_UI_Shop_WeaponInfo(int32 EntryPoint);
	void OnLoaded_ECDC8DF143777CE09D69AAA24015BF8E(class UObject* Loaded);
	void SetNewWeaponInfo(class UClass* Param_WeaponClass);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Shop_WeaponInfo_C">();
	}
	static class UUI_Shop_WeaponInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Shop_WeaponInfo_C>();
	}
};
static_assert(alignof(UUI_Shop_WeaponInfo_C) == 0x000008, "Wrong alignment on UUI_Shop_WeaponInfo_C");
static_assert(sizeof(UUI_Shop_WeaponInfo_C) == 0x0002F0, "Wrong size on UUI_Shop_WeaponInfo_C");
static_assert(offsetof(UUI_Shop_WeaponInfo_C, UberGraphFrame) == 0x000280, "Member 'UUI_Shop_WeaponInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Shop_WeaponInfo_C, Image_WeaponIcon) == 0x000288, "Member 'UUI_Shop_WeaponInfo_C::Image_WeaponIcon' has a wrong offset!");
static_assert(offsetof(UUI_Shop_WeaponInfo_C, TextBlock_WeaponName) == 0x000290, "Member 'UUI_Shop_WeaponInfo_C::TextBlock_WeaponName' has a wrong offset!");
static_assert(offsetof(UUI_Shop_WeaponInfo_C, UI_ItemParameter_AccuracyHip) == 0x000298, "Member 'UUI_Shop_WeaponInfo_C::UI_ItemParameter_AccuracyHip' has a wrong offset!");
static_assert(offsetof(UUI_Shop_WeaponInfo_C, UI_ItemParameter_Damage) == 0x0002A0, "Member 'UUI_Shop_WeaponInfo_C::UI_ItemParameter_Damage' has a wrong offset!");
static_assert(offsetof(UUI_Shop_WeaponInfo_C, UI_ItemParameter_MagazineCapacity) == 0x0002A8, "Member 'UUI_Shop_WeaponInfo_C::UI_ItemParameter_MagazineCapacity' has a wrong offset!");
static_assert(offsetof(UUI_Shop_WeaponInfo_C, UI_ItemParameter_Mobility) == 0x0002B0, "Member 'UUI_Shop_WeaponInfo_C::UI_ItemParameter_Mobility' has a wrong offset!");
static_assert(offsetof(UUI_Shop_WeaponInfo_C, UI_ItemParameter_RateOfFire) == 0x0002B8, "Member 'UUI_Shop_WeaponInfo_C::UI_ItemParameter_RateOfFire' has a wrong offset!");
static_assert(offsetof(UUI_Shop_WeaponInfo_C, UI_ItemParameter_Recoil) == 0x0002C0, "Member 'UUI_Shop_WeaponInfo_C::UI_ItemParameter_Recoil' has a wrong offset!");
static_assert(offsetof(UUI_Shop_WeaponInfo_C, UI_ItemParameter_RecoilControl) == 0x0002C8, "Member 'UUI_Shop_WeaponInfo_C::UI_ItemParameter_RecoilControl' has a wrong offset!");
static_assert(offsetof(UUI_Shop_WeaponInfo_C, VerticalBox_RecoilControl) == 0x0002D0, "Member 'UUI_Shop_WeaponInfo_C::VerticalBox_RecoilControl' has a wrong offset!");
static_assert(offsetof(UUI_Shop_WeaponInfo_C, WidgetSwitcher_ShootingType) == 0x0002D8, "Member 'UUI_Shop_WeaponInfo_C::WidgetSwitcher_ShootingType' has a wrong offset!");
static_assert(offsetof(UUI_Shop_WeaponInfo_C, WeaponClass) == 0x0002E0, "Member 'UUI_Shop_WeaponInfo_C::WeaponClass' has a wrong offset!");
static_assert(offsetof(UUI_Shop_WeaponInfo_C, CurveItemParameterMultiplier) == 0x0002E8, "Member 'UUI_Shop_WeaponInfo_C::CurveItemParameterMultiplier' has a wrong offset!");

}

