#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Scoreboard_Player_Menu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_Scoreboard_Player_Menu.UI_Scoreboard_Player_Menu_C.ExecuteUbergraph_UI_Scoreboard_Player_Menu
// 0x0120 (0x0120 - 0x0000)
struct UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue;   // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0030(0x0078)(ConstParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerController_Game*              K2Node_DynamicCast_AsPG_Player_Controller_Game;    // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA3[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Game*                   K2Node_DynamicCast_AsPG_Player_State_Game;         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA4[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA5[0x2];                                     // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerController_Game*              K2Node_DynamicCast_AsPG_Player_Controller_Game_1;  // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA6[0x5];                                     // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Scoreboard_Player_Menu_Report_C*    CallFunc_Create_ReturnValue;                       // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu) == 0x000008, "Wrong alignment on UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu");
static_assert(sizeof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu) == 0x000120, "Wrong size on UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, EntryPoint) == 0x000000, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, CallFunc_GetMousePositionOnViewport_ReturnValue) == 0x000008, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::CallFunc_GetMousePositionOnViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000020, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, K2Node_Event_MouseEvent) == 0x000030, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, CallFunc_GetPlayerController_ReturnValue) == 0x0000A8, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, K2Node_DynamicCast_AsPG_Player_Controller_Game) == 0x0000B0, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::K2Node_DynamicCast_AsPG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000C0, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, K2Node_DynamicCast_AsPG_Player_State_Game) == 0x0000C8, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::K2Node_DynamicCast_AsPG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000D8, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, CallFunc_Array_Find_ReturnValue) == 0x0000E0, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E4, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000E5, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, CallFunc_GetPlayerController_ReturnValue_3) == 0x0000E8, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x0000F0, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, K2Node_DynamicCast_AsPG_Player_Controller_Game_1) == 0x0000F8, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::K2Node_DynamicCast_AsPG_Player_Controller_Game_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000101, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, CallFunc_BooleanOR_ReturnValue) == 0x000102, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, CallFunc_GetPlayerController_ReturnValue_4) == 0x000108, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, CallFunc_Create_ReturnValue) == 0x000110, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000118, "Member 'UI_Scoreboard_Player_Menu_C_ExecuteUbergraph_UI_Scoreboard_Player_Menu::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function UI_Scoreboard_Player_Menu.UI_Scoreboard_Player_Menu_C.OnMouseButtonDown_Background
// 0x0220 (0x0220 - 0x0000)
struct UI_Scoreboard_Player_Menu_C_OnMouseButtonDown_Background final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
};
static_assert(alignof(UI_Scoreboard_Player_Menu_C_OnMouseButtonDown_Background) == 0x000008, "Wrong alignment on UI_Scoreboard_Player_Menu_C_OnMouseButtonDown_Background");
static_assert(sizeof(UI_Scoreboard_Player_Menu_C_OnMouseButtonDown_Background) == 0x000220, "Wrong size on UI_Scoreboard_Player_Menu_C_OnMouseButtonDown_Background");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_OnMouseButtonDown_Background, MyGeometry) == 0x000000, "Member 'UI_Scoreboard_Player_Menu_C_OnMouseButtonDown_Background::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_OnMouseButtonDown_Background, MouseEvent) == 0x000038, "Member 'UI_Scoreboard_Player_Menu_C_OnMouseButtonDown_Background::MouseEvent' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_OnMouseButtonDown_Background, ReturnValue) == 0x0000B0, "Member 'UI_Scoreboard_Player_Menu_C_OnMouseButtonDown_Background::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_OnMouseButtonDown_Background, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'UI_Scoreboard_Player_Menu_C_OnMouseButtonDown_Background::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UI_Scoreboard_Player_Menu.UI_Scoreboard_Player_Menu_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct UI_Scoreboard_Player_Menu_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UI_Scoreboard_Player_Menu_C_OnMouseLeave) == 0x000008, "Wrong alignment on UI_Scoreboard_Player_Menu_C_OnMouseLeave");
static_assert(sizeof(UI_Scoreboard_Player_Menu_C_OnMouseLeave) == 0x000078, "Wrong size on UI_Scoreboard_Player_Menu_C_OnMouseLeave");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UI_Scoreboard_Player_Menu_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UI_Scoreboard_Player_Menu.UI_Scoreboard_Player_Menu_C.SetFocusToScoreboard
// 0x0020 (0x0020 - 0x0000)
struct UI_Scoreboard_Player_Menu_C_SetFocusToScoreboard final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Scoreboard_Player_Menu_C_SetFocusToScoreboard) == 0x000008, "Wrong alignment on UI_Scoreboard_Player_Menu_C_SetFocusToScoreboard");
static_assert(sizeof(UI_Scoreboard_Player_Menu_C_SetFocusToScoreboard) == 0x000020, "Wrong size on UI_Scoreboard_Player_Menu_C_SetFocusToScoreboard");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_SetFocusToScoreboard, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'UI_Scoreboard_Player_Menu_C_SetFocusToScoreboard::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_SetFocusToScoreboard, CallFunc_GetPlayerController_ReturnValue_1) == 0x000008, "Member 'UI_Scoreboard_Player_Menu_C_SetFocusToScoreboard::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_SetFocusToScoreboard, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x000010, "Member 'UI_Scoreboard_Player_Menu_C_SetFocusToScoreboard::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_Menu_C_SetFocusToScoreboard, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UI_Scoreboard_Player_Menu_C_SetFocusToScoreboard::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

