#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Scoreboard_Player_Menu_Report

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Scoreboard_Player_Menu_Report.UI_Scoreboard_Player_Menu_Report_C
// 0x0040 (0x02C0 - 0x0280)
class UUI_Scoreboard_Player_Menu_Report_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_128;                                        // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Cheater;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Toxic;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Menu;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APG_PlayerState_Game*                   Player;                                            // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 Comment;                                           // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__UI_Scoreboard_Player_Menu_Report_Button_Cheater_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Scoreboard_Player_Menu_Report_Button_Toxic_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_Scoreboard_Player_Menu_Report(int32 EntryPoint);
	struct FEventReply OnMouseButtonDown_Background(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnPlayFabResponse_860D98224F067764473B2486553C01BB(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void SendReport();
	void SendReport_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void SendReport_Success(const struct FClientReportPlayerClientResult& Result, class UObject* CustomData);
	void SetFocusToScoreboard();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Scoreboard_Player_Menu_Report_C">();
	}
	static class UUI_Scoreboard_Player_Menu_Report_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Scoreboard_Player_Menu_Report_C>();
	}
};
static_assert(alignof(UUI_Scoreboard_Player_Menu_Report_C) == 0x000008, "Wrong alignment on UUI_Scoreboard_Player_Menu_Report_C");
static_assert(sizeof(UUI_Scoreboard_Player_Menu_Report_C) == 0x0002C0, "Wrong size on UUI_Scoreboard_Player_Menu_Report_C");
static_assert(offsetof(UUI_Scoreboard_Player_Menu_Report_C, UberGraphFrame) == 0x000280, "Member 'UUI_Scoreboard_Player_Menu_Report_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Scoreboard_Player_Menu_Report_C, Border_128) == 0x000288, "Member 'UUI_Scoreboard_Player_Menu_Report_C::Border_128' has a wrong offset!");
static_assert(offsetof(UUI_Scoreboard_Player_Menu_Report_C, Button_Cheater) == 0x000290, "Member 'UUI_Scoreboard_Player_Menu_Report_C::Button_Cheater' has a wrong offset!");
static_assert(offsetof(UUI_Scoreboard_Player_Menu_Report_C, Button_Toxic) == 0x000298, "Member 'UUI_Scoreboard_Player_Menu_Report_C::Button_Toxic' has a wrong offset!");
static_assert(offsetof(UUI_Scoreboard_Player_Menu_Report_C, Overlay_Menu) == 0x0002A0, "Member 'UUI_Scoreboard_Player_Menu_Report_C::Overlay_Menu' has a wrong offset!");
static_assert(offsetof(UUI_Scoreboard_Player_Menu_Report_C, Player) == 0x0002A8, "Member 'UUI_Scoreboard_Player_Menu_Report_C::Player' has a wrong offset!");
static_assert(offsetof(UUI_Scoreboard_Player_Menu_Report_C, Comment) == 0x0002B0, "Member 'UUI_Scoreboard_Player_Menu_Report_C::Comment' has a wrong offset!");

}

