#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ServerPassword

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_ServerPassword.UI_ServerPassword_C
// 0x0068 (0x02E8 - 0x0280)
class UUI_ServerPassword_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowErrorMessage;                                  // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Cancel;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_OK;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_ShowPassword;                               // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_Password;                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ErrorMessage;                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnPasswordEntered;                                 // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 CorrectServerPassword;                             // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnCanceled;                                        // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__UI_ServerPassword_Button_Cancel_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_ServerPassword_Button_Ok_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_ServerPassword_Button_ShowPassword_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Destruct();
	void ExecuteUbergraph_UI_ServerPassword(int32 EntryPoint);
	void OnCanceled__DelegateSignature();
	void OnPasswordEntered__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_ServerPassword_C">();
	}
	static class UUI_ServerPassword_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_ServerPassword_C>();
	}
};
static_assert(alignof(UUI_ServerPassword_C) == 0x000008, "Wrong alignment on UUI_ServerPassword_C");
static_assert(sizeof(UUI_ServerPassword_C) == 0x0002E8, "Wrong size on UUI_ServerPassword_C");
static_assert(offsetof(UUI_ServerPassword_C, UberGraphFrame) == 0x000280, "Member 'UUI_ServerPassword_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_ServerPassword_C, ShowErrorMessage) == 0x000288, "Member 'UUI_ServerPassword_C::ShowErrorMessage' has a wrong offset!");
static_assert(offsetof(UUI_ServerPassword_C, Button_Cancel) == 0x000290, "Member 'UUI_ServerPassword_C::Button_Cancel' has a wrong offset!");
static_assert(offsetof(UUI_ServerPassword_C, Button_OK) == 0x000298, "Member 'UUI_ServerPassword_C::Button_OK' has a wrong offset!");
static_assert(offsetof(UUI_ServerPassword_C, Button_ShowPassword) == 0x0002A0, "Member 'UUI_ServerPassword_C::Button_ShowPassword' has a wrong offset!");
static_assert(offsetof(UUI_ServerPassword_C, EditableTextBox_Password) == 0x0002A8, "Member 'UUI_ServerPassword_C::EditableTextBox_Password' has a wrong offset!");
static_assert(offsetof(UUI_ServerPassword_C, TextBlock_ErrorMessage) == 0x0002B0, "Member 'UUI_ServerPassword_C::TextBlock_ErrorMessage' has a wrong offset!");
static_assert(offsetof(UUI_ServerPassword_C, OnPasswordEntered) == 0x0002B8, "Member 'UUI_ServerPassword_C::OnPasswordEntered' has a wrong offset!");
static_assert(offsetof(UUI_ServerPassword_C, CorrectServerPassword) == 0x0002C8, "Member 'UUI_ServerPassword_C::CorrectServerPassword' has a wrong offset!");
static_assert(offsetof(UUI_ServerPassword_C, OnCanceled) == 0x0002D8, "Member 'UUI_ServerPassword_C::OnCanceled' has a wrong offset!");

}

