#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ServerList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "PlayFab_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_ServerList.UI_ServerList_C
// 0x00F0 (0x0370 - 0x0280)
class UUI_ServerList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RotateRefreshButton;                               // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_JoinServer;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_MapSort;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_ModeSort;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_PingSort;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_PlayersSort;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Refresh;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MapPreview;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_ServerScoreAlphaTeam;                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_ServerScoreBravoTeam;                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_ServerList;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ServerInfo;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ServerCurrentPlayerNumber;               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ServerMap;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ServerRegion;                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ServerScoreAlphaTeam;                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ServerScoreBravoTeam;                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ServerTimer;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ServerTotalPlayersNumber;                // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_ServerHasPassword;                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_ServerMode;                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 ServerMap;                                         // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UVaRestRequestJSON*                     RequestServerPing;                                 // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UUI_ServerInfo_C*>               Servers;                                           // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UUI_ServerInfo_C*                       SelectedServer;                                    // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnServerListUpdated;                               // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__Button_JoinServer_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Refresh_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__UI_ServerList_Button_MapSort_K2Node_ComponentBoundEvent_10_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__UI_ServerList_Button_MapSort_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_ServerList_Button_MapSort_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_ServerList_Button_ModeSort_K2Node_ComponentBoundEvent_11_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__UI_ServerList_Button_ModeSort_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_ServerList_Button_ModeSort_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_ServerList_Button_PingSort_K2Node_ComponentBoundEvent_14_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__UI_ServerList_Button_PingSort_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_ServerList_Button_PingSort_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_ServerList_Button_PlayersSort_K2Node_ComponentBoundEvent_13_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__UI_ServerList_Button_PlayersSort_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_ServerList_Button_PlayersSort_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_UI_ServerList(int32 EntryPoint);
	void ForceSearchServers();
	void OnPlayFabResponse_BC315A8A41E7AFC93E0DE28FE55E005A(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnServerListUpdated__DelegateSignature();
	void RequestServerList_Failure(const struct FPlayFabError& Error, class UObject* CustomData);
	void RequestServerList_Success(const struct FClientGetUserDataResult& Result, class UObject* CustomData);
	void SelectServer(class UUI_ServerInfo_C* Server);
	void ServerSelected_Event(class UUI_ServerInfo_C* Server_Info);
	void SortByMap();
	void SortbyPing(bool L_Reversed);
	void SortByPlayers(bool Reversed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_ServerList_C">();
	}
	static class UUI_ServerList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_ServerList_C>();
	}
};
static_assert(alignof(UUI_ServerList_C) == 0x000008, "Wrong alignment on UUI_ServerList_C");
static_assert(sizeof(UUI_ServerList_C) == 0x000370, "Wrong size on UUI_ServerList_C");
static_assert(offsetof(UUI_ServerList_C, UberGraphFrame) == 0x000280, "Member 'UUI_ServerList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, RotateRefreshButton) == 0x000288, "Member 'UUI_ServerList_C::RotateRefreshButton' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, Button_JoinServer) == 0x000290, "Member 'UUI_ServerList_C::Button_JoinServer' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, Button_MapSort) == 0x000298, "Member 'UUI_ServerList_C::Button_MapSort' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, Button_ModeSort) == 0x0002A0, "Member 'UUI_ServerList_C::Button_ModeSort' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, Button_PingSort) == 0x0002A8, "Member 'UUI_ServerList_C::Button_PingSort' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, Button_PlayersSort) == 0x0002B0, "Member 'UUI_ServerList_C::Button_PlayersSort' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, Button_Refresh) == 0x0002B8, "Member 'UUI_ServerList_C::Button_Refresh' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, Image_MapPreview) == 0x0002C0, "Member 'UUI_ServerList_C::Image_MapPreview' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, ProgressBar_ServerScoreAlphaTeam) == 0x0002C8, "Member 'UUI_ServerList_C::ProgressBar_ServerScoreAlphaTeam' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, ProgressBar_ServerScoreBravoTeam) == 0x0002D0, "Member 'UUI_ServerList_C::ProgressBar_ServerScoreBravoTeam' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, ScrollBox_ServerList) == 0x0002D8, "Member 'UUI_ServerList_C::ScrollBox_ServerList' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, SizeBox_ServerInfo) == 0x0002E0, "Member 'UUI_ServerList_C::SizeBox_ServerInfo' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, TextBlock_ServerCurrentPlayerNumber) == 0x0002E8, "Member 'UUI_ServerList_C::TextBlock_ServerCurrentPlayerNumber' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, TextBlock_ServerMap) == 0x0002F0, "Member 'UUI_ServerList_C::TextBlock_ServerMap' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, TextBlock_ServerRegion) == 0x0002F8, "Member 'UUI_ServerList_C::TextBlock_ServerRegion' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, TextBlock_ServerScoreAlphaTeam) == 0x000300, "Member 'UUI_ServerList_C::TextBlock_ServerScoreAlphaTeam' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, TextBlock_ServerScoreBravoTeam) == 0x000308, "Member 'UUI_ServerList_C::TextBlock_ServerScoreBravoTeam' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, TextBlock_ServerTimer) == 0x000310, "Member 'UUI_ServerList_C::TextBlock_ServerTimer' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, TextBlock_ServerTotalPlayersNumber) == 0x000318, "Member 'UUI_ServerList_C::TextBlock_ServerTotalPlayersNumber' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, WidgetSwitcher_ServerHasPassword) == 0x000320, "Member 'UUI_ServerList_C::WidgetSwitcher_ServerHasPassword' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, WidgetSwitcher_ServerMode) == 0x000328, "Member 'UUI_ServerList_C::WidgetSwitcher_ServerMode' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, ServerMap) == 0x000330, "Member 'UUI_ServerList_C::ServerMap' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, RequestServerPing) == 0x000340, "Member 'UUI_ServerList_C::RequestServerPing' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, Servers) == 0x000348, "Member 'UUI_ServerList_C::Servers' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, SelectedServer) == 0x000358, "Member 'UUI_ServerList_C::SelectedServer' has a wrong offset!");
static_assert(offsetof(UUI_ServerList_C, OnServerListUpdated) == 0x000360, "Member 'UUI_ServerList_C::OnServerListUpdated' has a wrong offset!");

}

