#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ShopItem

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "PlayFab_structs.hpp"
#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_ShopItem.UI_ShopItem_C.AsyncLoadIcon
// 0x0030 (0x0030 - 0x0000)
struct UI_ShopItem_C_AsyncLoadIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              ItemIcon;                                          // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(UI_ShopItem_C_AsyncLoadIcon) == 0x000008, "Wrong alignment on UI_ShopItem_C_AsyncLoadIcon");
static_assert(sizeof(UI_ShopItem_C_AsyncLoadIcon) == 0x000030, "Wrong size on UI_ShopItem_C_AsyncLoadIcon");
static_assert(offsetof(UI_ShopItem_C_AsyncLoadIcon, ItemIcon) == 0x000000, "Member 'UI_ShopItem_C_AsyncLoadIcon::ItemIcon' has a wrong offset!");

// Function UI_ShopItem.UI_ShopItem_C.ExecuteUbergraph_UI_ShopItem
// 0x0780 (0x0780 - 0x0000)
struct UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3641[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3642[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_2;                            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3643[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<EModifiedData>& ModifiedData, const class FString& CustomString)> K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3644[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_4;                            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_5;                            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3645[0x2];                                     // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetColorByID_Color;                       // 0x00D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorByID_Found;                       // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3646[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Subtract_LinearColorLinearColor_ReturnValue; // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00F8(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0130(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x01A8(0x0078)(ConstParm)
	struct FLinearColor                           CallFunc_GetColorByID_Color_1;                     // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorByID_Found_1;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3647[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetColorByID_Color_2;                     // 0x0234(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorByID_Found_2;                     // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3648[0x3];                                     // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetColorByID_Color_3;                     // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorByID_Found_3;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3649[0x3];                                     // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetColorByID_Color_4;                     // 0x025C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorByID_Found_4;                     // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364A[0x3];                                     // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Subtract_LinearColorLinearColor_ReturnValue_1; // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Subtract_LinearColorLinearColor_ReturnValue_2; // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByID_Color_5;                     // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorByID_Found_5;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364B[0x3];                                     // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Subtract_LinearColorLinearColor_ReturnValue_3; // 0x02A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByID_Color_6;                     // 0x02B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorByID_Found_6;                     // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364C[0x3];                                     // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x02C8(0x0014)()
	uint8                                         Pad_364D[0x4];                                     // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCatalogVersionByItemType_Catalog;      // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364E[0x6];                                     // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptResult        K2Node_CustomEvent_result;                         // 0x0308(0x0060)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientExecuteCloudScriptRequest       K2Node_MakeStruct_ClientExecuteCloudScriptRequest; // 0x0370(0x0030)()
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue;          // 0x03B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x03C8(0x0018)()
	TArray<class UPlayFabJsonObject*>             K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x03E0(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetBoolField_ReturnValue;                 // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364F[0x7];                                     // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x03F8(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0438(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0450(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3650[0x3];                                     // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetColorByID_Color_7;                     // 0x046C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetColorByID_Found_7;                     // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3651[0x3];                                     // 0x047D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0480(0x0014)()
	uint8                                         Pad_3652[0x4];                                     // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0498(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3653[0x7];                                     // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x04B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x04C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_PlayerState_Menu*                   K2Node_DynamicCast_AsPG_Player_State_Menu;         // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3654[0x3];                                     // 0x04D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FClientExecuteCloudScriptResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x04DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3655[0x4];                                     // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue;        // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabClientAPI*                      CallFunc_ExecuteCloudScript_ReturnValue;           // 0x04F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_1;             // 0x0500(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3656[0x7];                                     // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPlayFabJsonObject*>             CallFunc_GetObjectArrayField_ReturnValue_1;        // 0x0510(0x0010)(ReferenceParm)
	struct FPlayFabBaseModel                      Temp_struct_Variable_2;                            // 0x0520(0x0040)()
	class UObject*                                Temp_object_Variable_1;                            // 0x0560(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0568(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3657[0x4];                                     // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0580(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0588(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_WarningNoPC_C*                 CallFunc_Create_ReturnValue;                       // 0x0590(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0598(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3658[0x7];                                     // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EModifiedData>                         K2Node_CustomEvent_ModifiedData;                   // 0x05A8(0x0010)(ConstParm, ReferenceParm)
	class FString                                 K2Node_CustomEvent_CustomString;                   // 0x05B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default_1;                           // 0x05C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default_2;                           // 0x05D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Menu_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Menu;      // 0x05E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3659[0x3];                                     // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x05F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365A[0x4];                                     // 0x0604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_1;      // 0x0608(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_2;             // 0x0610(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_1;             // 0x0618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Shop_ConfirmPurchase_C*             CallFunc_Create_ReturnValue_1;                     // 0x0620(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_LowEntry_LocalVariable_Value__2_Object;     // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365B[0x4];                                     // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Shop_ConfirmPurchase_C*             K2Node_LowEntry_LocalVariable_Value__3_Object;     // 0x0630(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365C[0x7];                                     // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x0640(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x0680(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365D[0x7];                                     // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EModifiedData>                         K2Node_MakeArray_Array;                            // 0x0690(0x0010)(ConstParm, ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x06A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x06A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_ItemIcon;                       // 0x06B0(0x0030)(HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x06E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365E[0x3];                                     // 0x06F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365F[0x7];                                     // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerState_Menu_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Menu_1;    // 0x0710(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3660[0x7];                                     // 0x0719(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetPlayerCombinedInfo_ReturnValue_2;      // 0x0720(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue_3;             // 0x0728(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_2;             // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3661[0x3];                                     // 0x0739(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_3;                           // 0x073C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x074C(0x0014)()
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNumberField_Number_ImplicitCast;       // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3662[0x4];                                     // 0x0774(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Round_A_ImplicitCast_1;                   // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem) == 0x000008, "Wrong alignment on UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem");
static_assert(sizeof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem) == 0x000780, "Wrong size on UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, EntryPoint) == 0x000000, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, Temp_string_Variable) == 0x000008, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, Temp_string_Variable_1) == 0x000018, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, Temp_bool_Variable) == 0x000028, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, Temp_string_Variable_2) == 0x000030, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, Temp_string_Variable_3) == 0x000040, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, Temp_bool_Variable_1) == 0x000050, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, Temp_struct_Variable) == 0x000064, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, Temp_struct_Variable_1) == 0x000074, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, Temp_bool_Variable_2) == 0x000084, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, Temp_string_Variable_4) == 0x000088, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::Temp_string_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, Temp_string_Variable_5) == 0x000098, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::Temp_string_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_CustomEvent_Loaded) == 0x0000A8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, Temp_object_Variable) == 0x0000C0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_DynamicCast_AsTexture_2D) == 0x0000C8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_Event_IsDesignTime) == 0x0000D1, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetColorByID_Color) == 0x0000D4, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetColorByID_Color' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetColorByID_Found) == 0x0000E4, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetColorByID_Found' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Subtract_LinearColorLinearColor_ReturnValue) == 0x0000E8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Subtract_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_Event_MyGeometry) == 0x0000F8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_Event_MouseEvent_1) == 0x000130, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_Event_MouseEvent) == 0x0001A8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetColorByID_Color_1) == 0x000220, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetColorByID_Color_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetColorByID_Found_1) == 0x000230, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetColorByID_Found_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetColorByID_Color_2) == 0x000234, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetColorByID_Color_2' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetColorByID_Found_2) == 0x000244, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetColorByID_Found_2' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetColorByID_Color_3) == 0x000248, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetColorByID_Color_3' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetColorByID_Found_3) == 0x000258, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetColorByID_Found_3' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetColorByID_Color_4) == 0x00025C, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetColorByID_Color_4' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetColorByID_Found_4) == 0x00026C, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetColorByID_Found_4' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Subtract_LinearColorLinearColor_ReturnValue_1) == 0x000270, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Subtract_LinearColorLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Subtract_LinearColorLinearColor_ReturnValue_2) == 0x000280, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Subtract_LinearColorLinearColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetColorByID_Color_5) == 0x000290, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetColorByID_Color_5' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetColorByID_Found_5) == 0x0002A0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetColorByID_Found_5' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Subtract_LinearColorLinearColor_ReturnValue_3) == 0x0002A4, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Subtract_LinearColorLinearColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetColorByID_Color_6) == 0x0002B4, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetColorByID_Color_6' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetColorByID_Found_6) == 0x0002C4, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetColorByID_Found_6' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_MakeStruct_SlateColor) == 0x0002C8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetCatalogVersionByItemType_Catalog) == 0x0002E0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetCatalogVersionByItemType_Catalog' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Not_PreBool_ReturnValue) == 0x0002F0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002F1, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_ConstructJsonObject_ReturnValue) == 0x0002F8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000300, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_CustomEvent_result) == 0x000308, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_CustomEvent_result' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_CustomEvent_customData_1) == 0x000368, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_CustomEvent_customData_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_MakeStruct_ClientExecuteCloudScriptRequest) == 0x000370, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_MakeStruct_ClientExecuteCloudScriptRequest' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetObjectField_ReturnValue) == 0x0003A0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetStringField_ReturnValue) == 0x0003A8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetObjectArrayField_ReturnValue) == 0x0003B8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetObjectArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Conv_StringToText_ReturnValue) == 0x0003C8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_LowEntry_LocalVariable_Value__1_Object) == 0x0003E0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_LowEntry_LocalVariable_Value__1_Object' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetBoolField_ReturnValue) == 0x0003F0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetBoolField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_CustomEvent_error) == 0x0003F8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_CustomEvent_error' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_CustomEvent_customData) == 0x000430, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_CustomEvent_customData' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000438, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000450, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Not_PreBool_ReturnValue_2) == 0x000468, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetColorByID_Color_7) == 0x00046C, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetColorByID_Color_7' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetColorByID_Found_7) == 0x00047C, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetColorByID_Found_7' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_MakeStruct_SlateColor_1) == 0x000480, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_MakeLiteralText_ReturnValue) == 0x000498, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, Temp_bool_Variable_3) == 0x0004B0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetPlayerController_ReturnValue) == 0x0004B8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_CreateDelegate_OutputDelegate_2) == 0x0004C0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_DynamicCast_AsPG_Player_State_Menu) == 0x0004D0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_DynamicCast_AsPG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_DynamicCast_bSuccess_1) == 0x0004D8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_CreateDelegate_OutputDelegate_3) == 0x0004DC, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetPlayerCombinedInfo_ReturnValue) == 0x0004F0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetPlayerCombinedInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_ExecuteCloudScript_ReturnValue) == 0x0004F8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_ExecuteCloudScript_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetObjectField_ReturnValue_1) == 0x000500, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetObjectField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_IsValid_ReturnValue) == 0x000508, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetObjectArrayField_ReturnValue_1) == 0x000510, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetObjectArrayField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, Temp_struct_Variable_2) == 0x000520, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, Temp_object_Variable_1) == 0x000560, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_Select_Default) == 0x000568, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetNumberField_ReturnValue) == 0x000578, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetPlayerController_ReturnValue_1) == 0x000580, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetPlayerController_ReturnValue_2) == 0x000588, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Create_ReturnValue) == 0x000590, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000598, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_DynamicCast_bSuccess_2) == 0x0005A0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_CustomEvent_ModifiedData) == 0x0005A8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_CustomEvent_ModifiedData' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_CustomEvent_CustomString) == 0x0005B8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_CustomEvent_CustomString' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_Select_Default_1) == 0x0005C8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_Select_Default_2) == 0x0005D8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_DynamicCast_AsBP_PG_Player_State_Menu) == 0x0005E8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_DynamicCast_AsBP_PG_Player_State_Menu' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_DynamicCast_bSuccess_3) == 0x0005F0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_CreateDelegate_OutputDelegate_4) == 0x0005F4, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetPlayerCombinedInfo_ReturnValue_1) == 0x000608, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetPlayerCombinedInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetObjectField_ReturnValue_2) == 0x000610, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetObjectField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetNumberField_ReturnValue_1) == 0x000618, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetNumberField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Round_ReturnValue) == 0x00061C, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Create_ReturnValue_1) == 0x000620, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_LowEntry_LocalVariable_Value__2_Object) == 0x000628, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_LowEntry_LocalVariable_Value__2_Object' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_LowEntry_LocalVariable_Value__3_Object) == 0x000630, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_LowEntry_LocalVariable_Value__3_Object' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, Temp_bool_Variable_4) == 0x000638, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_CustomEvent_response) == 0x000640, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_CustomEvent_customData_2) == 0x000680, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_CustomEvent_customData_2' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_CustomEvent_successful) == 0x000688, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_MakeArray_Array) == 0x000690, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_PlayAnimation_ReturnValue) == 0x0006A0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_PlayAnimation_ReturnValue_1) == 0x0006A8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_CustomEvent_ItemIcon) == 0x0006B0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_CustomEvent_ItemIcon' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_CreateDelegate_OutputDelegate_5) == 0x0006E0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0006F0, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Subtract_IntInt_ReturnValue) == 0x0006F4, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0006F8, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000700, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Not_PreBool_ReturnValue_3) == 0x000708, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_DynamicCast_AsBP_PG_Player_State_Menu_1) == 0x000710, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_DynamicCast_AsBP_PG_Player_State_Menu_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_DynamicCast_bSuccess_4) == 0x000718, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetPlayerCombinedInfo_ReturnValue_2) == 0x000720, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetPlayerCombinedInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetObjectField_ReturnValue_3) == 0x000728, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetObjectField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GetNumberField_ReturnValue_2) == 0x000730, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GetNumberField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Round_ReturnValue_1) == 0x000734, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000738, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_Select_Default_3) == 0x00073C, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, K2Node_MakeStruct_SlateColor_2) == 0x00074C, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000760, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Round_A_ImplicitCast) == 0x000768, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Round_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_SetNumberField_Number_ImplicitCast) == 0x000770, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_SetNumberField_Number_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem, CallFunc_Round_A_ImplicitCast_1) == 0x000778, "Member 'UI_ShopItem_C_ExecuteUbergraph_UI_ShopItem::CallFunc_Round_A_ImplicitCast_1' has a wrong offset!");

// Function UI_ShopItem.UI_ShopItem_C.GetCatalogVersionByItemType
// 0x0020 (0x0020 - 0x0000)
struct UI_ShopItem_C_GetCatalogVersionByItemType final
{
public:
	class FString                                 Catalog;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsItem_Module_Skin;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ShopItem_C_GetCatalogVersionByItemType) == 0x000008, "Wrong alignment on UI_ShopItem_C_GetCatalogVersionByItemType");
static_assert(sizeof(UI_ShopItem_C_GetCatalogVersionByItemType) == 0x000020, "Wrong size on UI_ShopItem_C_GetCatalogVersionByItemType");
static_assert(offsetof(UI_ShopItem_C_GetCatalogVersionByItemType, Catalog) == 0x000000, "Member 'UI_ShopItem_C_GetCatalogVersionByItemType::Catalog' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_GetCatalogVersionByItemType, K2Node_ClassDynamicCast_AsItem_Module_Skin) == 0x000010, "Member 'UI_ShopItem_C_GetCatalogVersionByItemType::K2Node_ClassDynamicCast_AsItem_Module_Skin' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_GetCatalogVersionByItemType, K2Node_ClassDynamicCast_bSuccess) == 0x000018, "Member 'UI_ShopItem_C_GetCatalogVersionByItemType::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_GetCatalogVersionByItemType, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'UI_ShopItem_C_GetCatalogVersionByItemType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UI_ShopItem.UI_ShopItem_C.IsHoveredDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_ShopItem_C_IsHoveredDelegate__DelegateSignature final
{
public:
	class UUI_ShopItem_C*                         Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsHovered;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ShopItem_C_IsHoveredDelegate__DelegateSignature) == 0x000008, "Wrong alignment on UI_ShopItem_C_IsHoveredDelegate__DelegateSignature");
static_assert(sizeof(UI_ShopItem_C_IsHoveredDelegate__DelegateSignature) == 0x000010, "Wrong size on UI_ShopItem_C_IsHoveredDelegate__DelegateSignature");
static_assert(offsetof(UI_ShopItem_C_IsHoveredDelegate__DelegateSignature, Item) == 0x000000, "Member 'UI_ShopItem_C_IsHoveredDelegate__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(UI_ShopItem_C_IsHoveredDelegate__DelegateSignature, Param_IsHovered) == 0x000008, "Member 'UI_ShopItem_C_IsHoveredDelegate__DelegateSignature::Param_IsHovered' has a wrong offset!");

// Function UI_ShopItem.UI_ShopItem_C.OnLoaded_2C5F359C4097A5010239688BB380D317
// 0x0008 (0x0008 - 0x0000)
struct UI_ShopItem_C_OnLoaded_2C5F359C4097A5010239688BB380D317 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
