#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Shop_Weapon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Shop_Weapon.UI_Shop_Weapon_C
// 0x0060 (0x02E0 - 0x0280)
class UUI_Shop_Weapon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_Header;                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_WeaponInfo;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           UI_Button_Cosmetics;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           UI_Button_Primary;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           UI_Button_Secondary;                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Shop_WeaponModules_C*               UI_Shop_WeaponCosmetics;                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Shop_WeaponInfo_C*                  UI_Shop_WeaponInfo;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_WeaponClass;                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_PrimaryWeapons;                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_SecondaryWeapons;                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          PrimaryWeaponsInfo;                                // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddNewWeaponItem(class UClass* WeaponClass, class UUI_ShopItem_C** CreatedItem);
	void BndEvt__UI_Button_Primary_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature(class UUI_Button_C* Button);
	void BndEvt__UI_Button_Secondary_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature(class UUI_Button_C* Button);
	void BndEvt__UI_Shop_Weapon_UI_Button_Modules_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature(class UUI_Button_C* Button);
	void ExecuteUbergraph_UI_Shop_Weapon(int32 EntryPoint);
	void IsHoveredDelegate_Event(class UUI_ShopItem_C* Item, bool Param_IsHovered);
	void PreConstruct(bool IsDesignTime);
	void SetActivePage(int32 Param_Index, class UUI_Button_C* Button);
	void SetWeaponIsHovered(class UUI_ShopItem_C* Weapon, bool Param_IsHovered);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Shop_Weapon_C">();
	}
	static class UUI_Shop_Weapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Shop_Weapon_C>();
	}
};
static_assert(alignof(UUI_Shop_Weapon_C) == 0x000008, "Wrong alignment on UUI_Shop_Weapon_C");
static_assert(sizeof(UUI_Shop_Weapon_C) == 0x0002E0, "Wrong size on UUI_Shop_Weapon_C");
static_assert(offsetof(UUI_Shop_Weapon_C, UberGraphFrame) == 0x000280, "Member 'UUI_Shop_Weapon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Weapon_C, HorizontalBox_Header) == 0x000288, "Member 'UUI_Shop_Weapon_C::HorizontalBox_Header' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Weapon_C, Overlay_WeaponInfo) == 0x000290, "Member 'UUI_Shop_Weapon_C::Overlay_WeaponInfo' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Weapon_C, UI_Button_Cosmetics) == 0x000298, "Member 'UUI_Shop_Weapon_C::UI_Button_Cosmetics' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Weapon_C, UI_Button_Primary) == 0x0002A0, "Member 'UUI_Shop_Weapon_C::UI_Button_Primary' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Weapon_C, UI_Button_Secondary) == 0x0002A8, "Member 'UUI_Shop_Weapon_C::UI_Button_Secondary' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Weapon_C, UI_Shop_WeaponCosmetics) == 0x0002B0, "Member 'UUI_Shop_Weapon_C::UI_Shop_WeaponCosmetics' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Weapon_C, UI_Shop_WeaponInfo) == 0x0002B8, "Member 'UUI_Shop_Weapon_C::UI_Shop_WeaponInfo' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Weapon_C, WidgetSwitcher_WeaponClass) == 0x0002C0, "Member 'UUI_Shop_Weapon_C::WidgetSwitcher_WeaponClass' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Weapon_C, WrapBox_PrimaryWeapons) == 0x0002C8, "Member 'UUI_Shop_Weapon_C::WrapBox_PrimaryWeapons' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Weapon_C, WrapBox_SecondaryWeapons) == 0x0002D0, "Member 'UUI_Shop_Weapon_C::WrapBox_SecondaryWeapons' has a wrong offset!");
static_assert(offsetof(UUI_Shop_Weapon_C, PrimaryWeaponsInfo) == 0x0002D8, "Member 'UUI_Shop_Weapon_C::PrimaryWeaponsInfo' has a wrong offset!");

}

