#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ServerInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PlayFab_structs.hpp"
#include "UMG_classes.hpp"
#include "POLYGON_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_ServerInfo.UI_ServerInfo_C
// 0x00A0 (0x0320 - 0x0280)
class UUI_ServerInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Background;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Connect;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_SelectServer;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HasPassword;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MapImage;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_CurrentPlayersNumber;                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Ping;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ServerMap;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ServerMode;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ServerName;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_TotalPlayersNumber;                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Slash;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EAzureRegion                                  ServerRegion;                                      // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34CB[0x3];                                     // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Ping;                                              // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     ServerInfo;                                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     SessionCookie;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34CC[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             ServerSelected;                                    // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UObject*                                UI_ExperimentalModeTooltip;                        // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_Connect_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__Button_SelectServer_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__Button_SelectServer_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_SelectServer_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ConnectToServer();
	void Construct();
	void ExecuteUbergraph_UI_ServerInfo(int32 EntryPoint);
	void HoverButton(bool Hover_);
	void LoadMapTexture(TSoftObjectPtr<class UTexture2D> SoftTextureObject);
	void OnConnectionFinished_Event(bool IsSuccessful);
	void OnLoaded_F93DBF9642E98A40ED7E4D94E7862904(class UObject* Loaded);
	void OnPingCompleted_Event(const TArray<struct FPingQoSInfo>& Result);
	void ServerSelected__DelegateSignature(class UUI_ServerInfo_C* Server_Info);
	void Set_Ping(int32 Param_Ping);
	void SetIsSelected(bool Param_IsSelected);
	void SetRegionPing();
	void SetServerParameters();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_ServerInfo_C">();
	}
	static class UUI_ServerInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_ServerInfo_C>();
	}
};
static_assert(alignof(UUI_ServerInfo_C) == 0x000008, "Wrong alignment on UUI_ServerInfo_C");
static_assert(sizeof(UUI_ServerInfo_C) == 0x000320, "Wrong size on UUI_ServerInfo_C");
static_assert(offsetof(UUI_ServerInfo_C, UberGraphFrame) == 0x000280, "Member 'UUI_ServerInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, Border_Background) == 0x000288, "Member 'UUI_ServerInfo_C::Border_Background' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, Button_Connect) == 0x000290, "Member 'UUI_ServerInfo_C::Button_Connect' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, Button_SelectServer) == 0x000298, "Member 'UUI_ServerInfo_C::Button_SelectServer' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, Image_HasPassword) == 0x0002A0, "Member 'UUI_ServerInfo_C::Image_HasPassword' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, Image_MapImage) == 0x0002A8, "Member 'UUI_ServerInfo_C::Image_MapImage' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, Text_CurrentPlayersNumber) == 0x0002B0, "Member 'UUI_ServerInfo_C::Text_CurrentPlayersNumber' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, Text_Ping) == 0x0002B8, "Member 'UUI_ServerInfo_C::Text_Ping' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, Text_ServerMap) == 0x0002C0, "Member 'UUI_ServerInfo_C::Text_ServerMap' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, Text_ServerMode) == 0x0002C8, "Member 'UUI_ServerInfo_C::Text_ServerMode' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, Text_ServerName) == 0x0002D0, "Member 'UUI_ServerInfo_C::Text_ServerName' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, Text_TotalPlayersNumber) == 0x0002D8, "Member 'UUI_ServerInfo_C::Text_TotalPlayersNumber' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, TextBlock_Slash) == 0x0002E0, "Member 'UUI_ServerInfo_C::TextBlock_Slash' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, ServerRegion) == 0x0002E8, "Member 'UUI_ServerInfo_C::ServerRegion' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, Ping) == 0x0002EC, "Member 'UUI_ServerInfo_C::Ping' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, ServerInfo) == 0x0002F0, "Member 'UUI_ServerInfo_C::ServerInfo' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, SessionCookie) == 0x0002F8, "Member 'UUI_ServerInfo_C::SessionCookie' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, IsSelected) == 0x000300, "Member 'UUI_ServerInfo_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, ServerSelected) == 0x000308, "Member 'UUI_ServerInfo_C::ServerSelected' has a wrong offset!");
static_assert(offsetof(UUI_ServerInfo_C, UI_ExperimentalModeTooltip) == 0x000318, "Member 'UUI_ServerInfo_C::UI_ExperimentalModeTooltip' has a wrong offset!");

}

