#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ServerInfo

#include "Basic.hpp"

#include "POLYGON_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "PingQoS_structs.hpp"
#include "PlayFab_structs.hpp"


namespace SDK::Params
{

// Function UI_ServerInfo.UI_ServerInfo_C.ExecuteUbergraph_UI_ServerInfo
// 0x01B8 (0x01B8 - 0x0000)
struct UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34CD[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTask_Multiplayer_ConnectToServer_C*    CallFunc_CreateAction_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsSuccessful)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34CE[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34CF[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D0[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAzureRegion                                  CallFunc_GetRegionEnum_ReturnValue;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D1[0x1];                                     // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPingQoSInfo>                   K2Node_CustomEvent_result;                         // 0x0070(0x0010)(ConstParm, ReferenceParm)
	class UPingQoSSubsystem*                      CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPingQoSInfo                           CallFunc_Array_Get_Item;                           // 0x0088(0x0040)()
	TDelegate<void(TArray<struct FPingQoSInfo>& Result)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAzureRegion                                  CallFunc_GetRegionEnum_ReturnValue_1;              // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPingQoSSubsystem*                      CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsSuccessful;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D2[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D3[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_1;             // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D4[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_2;             // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1; // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D5[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_2; // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D6[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_SoftTextureObject;              // 0x0178(0x0030)(HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_1;                  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo) == 0x000008, "Wrong alignment on UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo");
static_assert(sizeof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo) == 0x0001B8, "Wrong size on UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, EntryPoint) == 0x000000, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_CreateAction_ReturnValue) == 0x000008, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_CreateAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, K2Node_CustomEvent_Loaded) == 0x000020, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, Temp_object_Variable) == 0x000028, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, K2Node_DynamicCast_AsTexture_2D) == 0x000030, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, Temp_bool_True_if_break_was_hit_Variable) == 0x000039, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_GetObjectField_ReturnValue) == 0x000048, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_GetStringField_ReturnValue) == 0x000058, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_GetRegionEnum_ReturnValue) == 0x00006C, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_GetRegionEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_Not_PreBool_ReturnValue_1) == 0x00006D, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_Not_PreBool_ReturnValue_2) == 0x00006E, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, K2Node_CustomEvent_result) == 0x000070, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::K2Node_CustomEvent_result' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000080, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_Array_Get_Item) == 0x000088, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C8, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_Less_IntInt_ReturnValue) == 0x0000DC, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_GetRegionEnum_ReturnValue_1) == 0x0000DD, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_GetRegionEnum_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_BooleanAND_ReturnValue) == 0x0000DE, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000DF, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_GetEngineSubsystem_ReturnValue_1) == 0x0000E0, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_GetEngineSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E8, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, K2Node_CustomEvent_IsSuccessful) == 0x0000F8, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::K2Node_CustomEvent_IsSuccessful' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_GetOwningPlayer_ReturnValue) == 0x000100, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000108, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_GetNumberField_ReturnValue) == 0x000114, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_FTrunc_ReturnValue) == 0x000118, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_GetNumberField_ReturnValue_1) == 0x00011C, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_GetNumberField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_GetStringField_ReturnValue_1) == 0x000120, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_FTrunc_ReturnValue_1) == 0x000130, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_GetPlayerController_ReturnValue) == 0x000138, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_GetStringField_ReturnValue_2) == 0x000140, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_GetStringField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1) == 0x000150, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_1' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, K2Node_DynamicCast_bSuccess_2) == 0x000158, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_GetPlayerController_ReturnValue_1) == 0x000160, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_2) == 0x000168, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu_2' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, K2Node_DynamicCast_bSuccess_3) == 0x000170, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, K2Node_CustomEvent_SoftTextureObject) == 0x000178, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::K2Node_CustomEvent_SoftTextureObject' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_FTrunc_A_ImplicitCast) == 0x0001A8, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo, CallFunc_FTrunc_A_ImplicitCast_1) == 0x0001B0, "Member 'UI_ServerInfo_C_ExecuteUbergraph_UI_ServerInfo::CallFunc_FTrunc_A_ImplicitCast_1' has a wrong offset!");

// Function UI_ServerInfo.UI_ServerInfo_C.HoverButton
// 0x00B8 (0x00B8 - 0x0000)
struct UI_ServerInfo_C_HoverButton final
{
public:
	bool                                          Hover_;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_Hover_;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateColorStylingMode                        Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateColorStylingMode                        Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D7[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D8[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D9[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateColorStylingMode                        K2Node_Select_Default_2;                           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34DA[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_3;                           // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00A4(0x0014)()
};
static_assert(alignof(UI_ServerInfo_C_HoverButton) == 0x000004, "Wrong alignment on UI_ServerInfo_C_HoverButton");
static_assert(sizeof(UI_ServerInfo_C_HoverButton) == 0x0000B8, "Wrong size on UI_ServerInfo_C_HoverButton");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, Hover_) == 0x000000, "Member 'UI_ServerInfo_C_HoverButton::Hover_' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, L_Hover_) == 0x000001, "Member 'UI_ServerInfo_C_HoverButton::L_Hover_' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, Temp_bool_Variable) == 0x000002, "Member 'UI_ServerInfo_C_HoverButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, Temp_byte_Variable) == 0x000003, "Member 'UI_ServerInfo_C_HoverButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, Temp_byte_Variable_1) == 0x000004, "Member 'UI_ServerInfo_C_HoverButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, Temp_bool_Variable_1) == 0x000005, "Member 'UI_ServerInfo_C_HoverButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, Temp_struct_Variable) == 0x000008, "Member 'UI_ServerInfo_C_HoverButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, Temp_struct_Variable_1) == 0x000018, "Member 'UI_ServerInfo_C_HoverButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, Temp_bool_Variable_2) == 0x000028, "Member 'UI_ServerInfo_C_HoverButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, Temp_struct_Variable_2) == 0x00002C, "Member 'UI_ServerInfo_C_HoverButton::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, Temp_struct_Variable_3) == 0x00003C, "Member 'UI_ServerInfo_C_HoverButton::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, Temp_bool_Variable_3) == 0x00004C, "Member 'UI_ServerInfo_C_HoverButton::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, Temp_struct_Variable_4) == 0x000050, "Member 'UI_ServerInfo_C_HoverButton::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, Temp_struct_Variable_5) == 0x000060, "Member 'UI_ServerInfo_C_HoverButton::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, K2Node_Select_Default) == 0x000070, "Member 'UI_ServerInfo_C_HoverButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, K2Node_Select_Default_1) == 0x000080, "Member 'UI_ServerInfo_C_HoverButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, K2Node_Select_Default_2) == 0x000090, "Member 'UI_ServerInfo_C_HoverButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, K2Node_Select_Default_3) == 0x000094, "Member 'UI_ServerInfo_C_HoverButton::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_HoverButton, K2Node_MakeStruct_SlateColor) == 0x0000A4, "Member 'UI_ServerInfo_C_HoverButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function UI_ServerInfo.UI_ServerInfo_C.LoadMapTexture
// 0x0030 (0x0030 - 0x0000)
struct UI_ServerInfo_C_LoadMapTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              SoftTextureObject;                                 // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(UI_ServerInfo_C_LoadMapTexture) == 0x000008, "Wrong alignment on UI_ServerInfo_C_LoadMapTexture");
static_assert(sizeof(UI_ServerInfo_C_LoadMapTexture) == 0x000030, "Wrong size on UI_ServerInfo_C_LoadMapTexture");
static_assert(offsetof(UI_ServerInfo_C_LoadMapTexture, SoftTextureObject) == 0x000000, "Member 'UI_ServerInfo_C_LoadMapTexture::SoftTextureObject' has a wrong offset!");

// Function UI_ServerInfo.UI_ServerInfo_C.OnConnectionFinished_Event
// 0x0001 (0x0001 - 0x0000)
struct UI_ServerInfo_C_OnConnectionFinished_Event final
{
public:
	bool                                          IsSuccessful;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ServerInfo_C_OnConnectionFinished_Event) == 0x000001, "Wrong alignment on UI_ServerInfo_C_OnConnectionFinished_Event");
static_assert(sizeof(UI_ServerInfo_C_OnConnectionFinished_Event) == 0x000001, "Wrong size on UI_ServerInfo_C_OnConnectionFinished_Event");
static_assert(offsetof(UI_ServerInfo_C_OnConnectionFinished_Event, IsSuccessful) == 0x000000, "Member 'UI_ServerInfo_C_OnConnectionFinished_Event::IsSuccessful' has a wrong offset!");

// Function UI_ServerInfo.UI_ServerInfo_C.OnLoaded_F93DBF9642E98A40ED7E4D94E7862904
// 0x0008 (0x0008 - 0x0000)
struct UI_ServerInfo_C_OnLoaded_F93DBF9642E98A40ED7E4D94E7862904 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ServerInfo_C_OnLoaded_F93DBF9642E98A40ED7E4D94E7862904) == 0x000008, "Wrong alignment on UI_ServerInfo_C_OnLoaded_F93DBF9642E98A40ED7E4D94E7862904");
static_assert(sizeof(UI_ServerInfo_C_OnLoaded_F93DBF9642E98A40ED7E4D94E7862904) == 0x000008, "Wrong size on UI_ServerInfo_C_OnLoaded_F93DBF9642E98A40ED7E4D94E7862904");
static_assert(offsetof(UI_ServerInfo_C_OnLoaded_F93DBF9642E98A40ED7E4D94E7862904, Loaded) == 0x000000, "Member 'UI_ServerInfo_C_OnLoaded_F93DBF9642E98A40ED7E4D94E7862904::Loaded' has a wrong offset!");

// Function UI_ServerInfo.UI_ServerInfo_C.OnPingCompleted_Event
// 0x0010 (0x0010 - 0x0000)
struct UI_ServerInfo_C_OnPingCompleted_Event final
{
public:
	TArray<struct FPingQoSInfo>                   Result;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UI_ServerInfo_C_OnPingCompleted_Event) == 0x000008, "Wrong alignment on UI_ServerInfo_C_OnPingCompleted_Event");
static_assert(sizeof(UI_ServerInfo_C_OnPingCompleted_Event) == 0x000010, "Wrong size on UI_ServerInfo_C_OnPingCompleted_Event");
static_assert(offsetof(UI_ServerInfo_C_OnPingCompleted_Event, Result) == 0x000000, "Member 'UI_ServerInfo_C_OnPingCompleted_Event::Result' has a wrong offset!");

// Function UI_ServerInfo.UI_ServerInfo_C.ServerSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ServerInfo_C_ServerSelected__DelegateSignature final
{
public:
	class UUI_ServerInfo_C*                       Server_Info;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ServerInfo_C_ServerSelected__DelegateSignature) == 0x000008, "Wrong alignment on UI_ServerInfo_C_ServerSelected__DelegateSignature");
static_assert(sizeof(UI_ServerInfo_C_ServerSelected__DelegateSignature) == 0x000008, "Wrong size on UI_ServerInfo_C_ServerSelected__DelegateSignature");
static_assert(offsetof(UI_ServerInfo_C_ServerSelected__DelegateSignature, Server_Info) == 0x000000, "Member 'UI_ServerInfo_C_ServerSelected__DelegateSignature::Server_Info' has a wrong offset!");

// Function UI_ServerInfo.UI_ServerInfo_C.Set Ping
// 0x0020 (0x0020 - 0x0000)
struct UI_ServerInfo_C_Set_Ping final
{
public:
	int32                                         Param_Ping;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34DB[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(UI_ServerInfo_C_Set_Ping) == 0x000008, "Wrong alignment on UI_ServerInfo_C_Set_Ping");
static_assert(sizeof(UI_ServerInfo_C_Set_Ping) == 0x000020, "Wrong size on UI_ServerInfo_C_Set_Ping");
static_assert(offsetof(UI_ServerInfo_C_Set_Ping, Param_Ping) == 0x000000, "Member 'UI_ServerInfo_C_Set_Ping::Param_Ping' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_Set_Ping, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'UI_ServerInfo_C_Set_Ping::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_Set_Ping, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000005, "Member 'UI_ServerInfo_C_Set_Ping::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_Set_Ping, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'UI_ServerInfo_C_Set_Ping::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_Set_Ping, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'UI_ServerInfo_C_Set_Ping::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function UI_ServerInfo.UI_ServerInfo_C.SetIsSelected
// 0x0001 (0x0001 - 0x0000)
struct UI_ServerInfo_C_SetIsSelected final
{
public:
	bool                                          Param_IsSelected;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ServerInfo_C_SetIsSelected) == 0x000001, "Wrong alignment on UI_ServerInfo_C_SetIsSelected");
static_assert(sizeof(UI_ServerInfo_C_SetIsSelected) == 0x000001, "Wrong size on UI_ServerInfo_C_SetIsSelected");
static_assert(offsetof(UI_ServerInfo_C_SetIsSelected, Param_IsSelected) == 0x000000, "Member 'UI_ServerInfo_C_SetIsSelected::Param_IsSelected' has a wrong offset!");

// Function UI_ServerInfo.UI_ServerInfo_C.SetServerParameters
// 0x0240 (0x0240 - 0x0000)
struct UI_ServerInfo_C_SetServerParameters final
{
public:
	TArray<class FString>                         CallFunc_GetStringArrayField_ReturnValue;          // 0x0000(0x0010)(ReferenceParm)
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34DC[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0068(0x0018)()
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34DD[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMapInfo                               CallFunc_GetDataTableRowFromName_OutRow;           // 0x00A0(0x00E8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34DE[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0190(0x0018)()
	EGameMode                                     CallFunc_Array_Get_Item;                           // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameMode                                     Temp_byte_Variable;                                // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34DF[0x6];                                     // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x01C0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01D8(0x0018)()
	class FString                                 CallFunc_GetStringField_ReturnValue_2;             // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_1;                   // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34E0[0x5];                                     // 0x0203(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_3;             // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34E1[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0220(0x0018)()
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ServerInfo_C_SetServerParameters) == 0x000008, "Wrong alignment on UI_ServerInfo_C_SetServerParameters");
static_assert(sizeof(UI_ServerInfo_C_SetServerParameters) == 0x000240, "Wrong size on UI_ServerInfo_C_SetServerParameters");
static_assert(offsetof(UI_ServerInfo_C_SetServerParameters, CallFunc_GetStringArrayField_ReturnValue) == 0x000000, "Member 'UI_ServerInfo_C_SetServerParameters::CallFunc_GetStringArrayField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_SetServerParameters, Temp_text_Variable) == 0x000010, "Member 'UI_ServerInfo_C_SetServerParameters::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UI_ServerInfo_C_SetServerParameters, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'UI_ServerInfo_C_SetServerParameters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
