#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Shop_MicroTxnError

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_Shop_MicroTxnError.UI_Shop_MicroTxnError_C.ExecuteUbergraph_UI_Shop_MicroTxnError
// 0x0020 (0x0020 - 0x0000)
struct UI_Shop_MicroTxnError_C_ExecuteUbergraph_UI_Shop_MicroTxnError final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_353C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_MicroTxnError_C_ExecuteUbergraph_UI_Shop_MicroTxnError) == 0x000008, "Wrong alignment on UI_Shop_MicroTxnError_C_ExecuteUbergraph_UI_Shop_MicroTxnError");
static_assert(sizeof(UI_Shop_MicroTxnError_C_ExecuteUbergraph_UI_Shop_MicroTxnError) == 0x000020, "Wrong size on UI_Shop_MicroTxnError_C_ExecuteUbergraph_UI_Shop_MicroTxnError");
static_assert(offsetof(UI_Shop_MicroTxnError_C_ExecuteUbergraph_UI_Shop_MicroTxnError, EntryPoint) == 0x000000, "Member 'UI_Shop_MicroTxnError_C_ExecuteUbergraph_UI_Shop_MicroTxnError::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Shop_MicroTxnError_C_ExecuteUbergraph_UI_Shop_MicroTxnError, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'UI_Shop_MicroTxnError_C_ExecuteUbergraph_UI_Shop_MicroTxnError::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_MicroTxnError_C_ExecuteUbergraph_UI_Shop_MicroTxnError, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'UI_Shop_MicroTxnError_C_ExecuteUbergraph_UI_Shop_MicroTxnError::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_MicroTxnError_C_ExecuteUbergraph_UI_Shop_MicroTxnError, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000018, "Member 'UI_Shop_MicroTxnError_C_ExecuteUbergraph_UI_Shop_MicroTxnError::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

}

