#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Scoreboard_Player_Menu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Scoreboard_Player_Menu.UI_Scoreboard_Player_Menu_C
// 0x0030 (0x02B0 - 0x0280)
class UUI_Scoreboard_Player_Menu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_128;                                        // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Report;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_VoteKick;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Menu;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APG_PlayerState_Game*                   Player;                                            // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__UI_Scoreboard_Player_Menu_Button_Report_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Scoreboard_Player_Menu_Button_VoteKick_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_Scoreboard_Player_Menu(int32 EntryPoint);
	struct FEventReply OnMouseButtonDown_Background(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void SetFocusToScoreboard();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Scoreboard_Player_Menu_C">();
	}
	static class UUI_Scoreboard_Player_Menu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Scoreboard_Player_Menu_C>();
	}
};
static_assert(alignof(UUI_Scoreboard_Player_Menu_C) == 0x000008, "Wrong alignment on UUI_Scoreboard_Player_Menu_C");
static_assert(sizeof(UUI_Scoreboard_Player_Menu_C) == 0x0002B0, "Wrong size on UUI_Scoreboard_Player_Menu_C");
static_assert(offsetof(UUI_Scoreboard_Player_Menu_C, UberGraphFrame) == 0x000280, "Member 'UUI_Scoreboard_Player_Menu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Scoreboard_Player_Menu_C, Border_128) == 0x000288, "Member 'UUI_Scoreboard_Player_Menu_C::Border_128' has a wrong offset!");
static_assert(offsetof(UUI_Scoreboard_Player_Menu_C, Button_Report) == 0x000290, "Member 'UUI_Scoreboard_Player_Menu_C::Button_Report' has a wrong offset!");
static_assert(offsetof(UUI_Scoreboard_Player_Menu_C, Button_VoteKick) == 0x000298, "Member 'UUI_Scoreboard_Player_Menu_C::Button_VoteKick' has a wrong offset!");
static_assert(offsetof(UUI_Scoreboard_Player_Menu_C, Overlay_Menu) == 0x0002A0, "Member 'UUI_Scoreboard_Player_Menu_C::Overlay_Menu' has a wrong offset!");
static_assert(offsetof(UUI_Scoreboard_Player_Menu_C, Player) == 0x0002A8, "Member 'UUI_Scoreboard_Player_Menu_C::Player' has a wrong offset!");

}

