#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Shop_Premium

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_Shop_Premium.UI_Shop_Premium_C.BndEvt__UI_Shop_Premium_UI_Button_Crowns_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_Crowns_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_Crowns_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_Crowns_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature");
static_assert(sizeof(UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_Crowns_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_Crowns_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature");
static_assert(offsetof(UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_Crowns_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_Crowns_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Shop_Premium.UI_Shop_Premium_C.BndEvt__UI_Shop_Premium_UI_Button_Offers_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_Offers_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_Offers_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_Offers_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature");
static_assert(sizeof(UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_Offers_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_Offers_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature");
static_assert(offsetof(UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_Offers_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_Offers_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Shop_Premium.UI_Shop_Premium_C.BndEvt__UI_Shop_Premium_UI_Button_VIP_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_VIP_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature final
{
public:
	class UUI_Button_C*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_VIP_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_VIP_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature");
static_assert(sizeof(UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_VIP_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature) == 0x000008, "Wrong size on UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_VIP_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature");
static_assert(offsetof(UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_VIP_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature, Button) == 0x000000, "Member 'UI_Shop_Premium_C_BndEvt__UI_Shop_Premium_UI_Button_VIP_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature::Button' has a wrong offset!");

// Function UI_Shop_Premium.UI_Shop_Premium_C.ExecuteUbergraph_UI_Shop_Premium
// 0x0020 (0x0020 - 0x0000)
struct UI_Shop_Premium_C_ExecuteUbergraph_UI_Shop_Premium final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_387D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_Premium_C_ExecuteUbergraph_UI_Shop_Premium) == 0x000008, "Wrong alignment on UI_Shop_Premium_C_ExecuteUbergraph_UI_Shop_Premium");
static_assert(sizeof(UI_Shop_Premium_C_ExecuteUbergraph_UI_Shop_Premium) == 0x000020, "Wrong size on UI_Shop_Premium_C_ExecuteUbergraph_UI_Shop_Premium");
static_assert(offsetof(UI_Shop_Premium_C_ExecuteUbergraph_UI_Shop_Premium, EntryPoint) == 0x000000, "Member 'UI_Shop_Premium_C_ExecuteUbergraph_UI_Shop_Premium::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Shop_Premium_C_ExecuteUbergraph_UI_Shop_Premium, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'UI_Shop_Premium_C_ExecuteUbergraph_UI_Shop_Premium::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(UI_Shop_Premium_C_ExecuteUbergraph_UI_Shop_Premium, K2Node_ComponentBoundEvent_Button_2) == 0x000010, "Member 'UI_Shop_Premium_C_ExecuteUbergraph_UI_Shop_Premium::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(UI_Shop_Premium_C_ExecuteUbergraph_UI_Shop_Premium, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'UI_Shop_Premium_C_ExecuteUbergraph_UI_Shop_Premium::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");

// Function UI_Shop_Premium.UI_Shop_Premium_C.SetActivePage
// 0x0058 (0x0058 - 0x0000)
struct UI_Shop_Premium_C_SetActivePage final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_387E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Button_C*                           Button;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_C*                           L_Button;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         L_Index;                                           // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_387F[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Button_C*                           K2Node_DynamicCast_AsUI_Button;                    // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_Premium_C_SetActivePage) == 0x000008, "Wrong alignment on UI_Shop_Premium_C_SetActivePage");
static_assert(sizeof(UI_Shop_Premium_C_SetActivePage) == 0x000058, "Wrong size on UI_Shop_Premium_C_SetActivePage");
static_assert(offsetof(UI_Shop_Premium_C_SetActivePage, Param_Index) == 0x000000, "Member 'UI_Shop_Premium_C_SetActivePage::Param_Index' has a wrong offset!");
static_assert(offsetof(UI_Shop_Premium_C_SetActivePage, Button) == 0x000008, "Member 'UI_Shop_Premium_C_SetActivePage::Button' has a wrong offset!");
static_assert(offsetof(UI_Shop_Premium_C_SetActivePage, L_Button) == 0x000010, "Member 'UI_Shop_Premium_C_SetActivePage::L_Button' has a wrong offset!");
static_assert(offsetof(UI_Shop_Premium_C_SetActivePage, L_Index) == 0x000018, "Member 'UI_Shop_Premium_C_SetActivePage::L_Index' has a wrong offset!");
static_assert(offsetof(UI_Shop_Premium_C_SetActivePage, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'UI_Shop_Premium_C_SetActivePage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_Premium_C_SetActivePage, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'UI_Shop_Premium_C_SetActivePage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_Shop_Premium_C_SetActivePage, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'UI_Shop_Premium_C_SetActivePage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Premium_C_SetActivePage, CallFunc_GetAllChildren_ReturnValue) == 0x000028, "Member 'UI_Shop_Premium_C_SetActivePage::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Premium_C_SetActivePage, CallFunc_Array_Get_Item) == 0x000038, "Member 'UI_Shop_Premium_C_SetActivePage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_Shop_Premium_C_SetActivePage, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'UI_Shop_Premium_C_SetActivePage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_Premium_C_SetActivePage, K2Node_DynamicCast_AsUI_Button) == 0x000048, "Member 'UI_Shop_Premium_C_SetActivePage::K2Node_DynamicCast_AsUI_Button' has a wrong offset!");
static_assert(offsetof(UI_Shop_Premium_C_SetActivePage, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UI_Shop_Premium_C_SetActivePage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Shop_Premium_C_SetActivePage, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'UI_Shop_Premium_C_SetActivePage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

