#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SpawnProtection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_SpawnProtection.UI_SpawnProtection_C
// 0x0018 (0x0298 - 0x0280)
class UUI_SpawnProtection_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HealthProtectionVisibilityAnimation;               // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Shield;                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_SpawnProtection(int32 EntryPoint);
	void OnHealthProtection_Event();
	void OnPossessedPawnChanged_Event(class APawn* OldPawn, class APawn* NewPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_SpawnProtection_C">();
	}
	static class UUI_SpawnProtection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_SpawnProtection_C>();
	}
};
static_assert(alignof(UUI_SpawnProtection_C) == 0x000008, "Wrong alignment on UUI_SpawnProtection_C");
static_assert(sizeof(UUI_SpawnProtection_C) == 0x000298, "Wrong size on UUI_SpawnProtection_C");
static_assert(offsetof(UUI_SpawnProtection_C, UberGraphFrame) == 0x000280, "Member 'UUI_SpawnProtection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_SpawnProtection_C, HealthProtectionVisibilityAnimation) == 0x000288, "Member 'UUI_SpawnProtection_C::HealthProtectionVisibilityAnimation' has a wrong offset!");
static_assert(offsetof(UUI_SpawnProtection_C, WidgetSwitcher_Shield) == 0x000290, "Member 'UUI_SpawnProtection_C::WidgetSwitcher_Shield' has a wrong offset!");

}

