#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ServerPassword

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_ServerPassword.UI_ServerPassword_C.ExecuteUbergraph_UI_ServerPassword
// 0x0048 (0x0048 - 0x0000)
struct UI_ServerPassword_C_ExecuteUbergraph_UI_ServerPassword final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3446[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3447[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ServerPassword_C_ExecuteUbergraph_UI_ServerPassword) == 0x000008, "Wrong alignment on UI_ServerPassword_C_ExecuteUbergraph_UI_ServerPassword");
static_assert(sizeof(UI_ServerPassword_C_ExecuteUbergraph_UI_ServerPassword) == 0x000048, "Wrong size on UI_ServerPassword_C_ExecuteUbergraph_UI_ServerPassword");
static_assert(offsetof(UI_ServerPassword_C_ExecuteUbergraph_UI_ServerPassword, EntryPoint) == 0x000000, "Member 'UI_ServerPassword_C_ExecuteUbergraph_UI_ServerPassword::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_ServerPassword_C_ExecuteUbergraph_UI_ServerPassword, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'UI_ServerPassword_C_ExecuteUbergraph_UI_ServerPassword::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerPassword_C_ExecuteUbergraph_UI_ServerPassword, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'UI_ServerPassword_C_ExecuteUbergraph_UI_ServerPassword::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerPassword_C_ExecuteUbergraph_UI_ServerPassword, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000030, "Member 'UI_ServerPassword_C_ExecuteUbergraph_UI_ServerPassword::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerPassword_C_ExecuteUbergraph_UI_ServerPassword, CallFunc_PlayAnimationForward_ReturnValue) == 0x000038, "Member 'UI_ServerPassword_C_ExecuteUbergraph_UI_ServerPassword::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerPassword_C_ExecuteUbergraph_UI_ServerPassword, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'UI_ServerPassword_C_ExecuteUbergraph_UI_ServerPassword::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

