#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Shop_WarningNoPC

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_Shop_WarningNoPC.UI_Shop_WarningNoPC_C.ExecuteUbergraph_UI_Shop_WarningNoPC
// 0x0058 (0x0058 - 0x0000)
struct UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D7[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTask_Menu_GeneralMenuScreen_SetActivePage_C* CallFunc_CreateAction_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D8[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D9[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0040(0x0018)()
};
static_assert(alignof(UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC) == 0x000008, "Wrong alignment on UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC");
static_assert(sizeof(UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC) == 0x000058, "Wrong size on UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC");
static_assert(offsetof(UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC, EntryPoint) == 0x000000, "Member 'UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC, CallFunc_CreateAction_ReturnValue) == 0x000018, "Member 'UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC::CallFunc_CreateAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC, K2Node_Event_IsDesignTime) == 0x000028, "Member 'UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000030, "Member 'UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC, CallFunc_Conv_IntToText_ReturnValue) == 0x000040, "Member 'UI_Shop_WarningNoPC_C_ExecuteUbergraph_UI_Shop_WarningNoPC::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function UI_Shop_WarningNoPC.UI_Shop_WarningNoPC_C.OnMadeChoice__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_Shop_WarningNoPC_C_OnMadeChoice__DelegateSignature final
{
public:
	bool                                          Yes;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_WarningNoPC_C_OnMadeChoice__DelegateSignature) == 0x000001, "Wrong alignment on UI_Shop_WarningNoPC_C_OnMadeChoice__DelegateSignature");
static_assert(sizeof(UI_Shop_WarningNoPC_C_OnMadeChoice__DelegateSignature) == 0x000001, "Wrong size on UI_Shop_WarningNoPC_C_OnMadeChoice__DelegateSignature");
static_assert(offsetof(UI_Shop_WarningNoPC_C_OnMadeChoice__DelegateSignature, Yes) == 0x000000, "Member 'UI_Shop_WarningNoPC_C_OnMadeChoice__DelegateSignature::Yes' has a wrong offset!");

// Function UI_Shop_WarningNoPC.UI_Shop_WarningNoPC_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Shop_WarningNoPC_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Shop_WarningNoPC_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Shop_WarningNoPC_C_PreConstruct");
static_assert(sizeof(UI_Shop_WarningNoPC_C_PreConstruct) == 0x000001, "Wrong size on UI_Shop_WarningNoPC_C_PreConstruct");
static_assert(offsetof(UI_Shop_WarningNoPC_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Shop_WarningNoPC_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

