#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ServerList

#include "Basic.hpp"

#include "PlayFab_structs.hpp"
#include "POLYGON_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_ServerList.UI_ServerList_C.ExecuteUbergraph_UI_ServerList
// 0x0388 (0x0388 - 0x0000)
struct UI_ServerList_C_ExecuteUbergraph_UI_ServerList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WithEditor_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34EA[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FClientGetUserDataResult& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUI_ServerInfo_C* Server_Info)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34EB[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34EC[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34ED[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabError                          K2Node_CustomEvent_error;                          // 0x0048(0x0038)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00A0(0x0018)()
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x00B8(0x0040)()
	class UObject*                                Temp_object_Variable;                              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_ServerInfo_C*                       K2Node_CustomEvent_Server_Info;                    // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34EE[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x010C(0x0008)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34EF[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F0[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_ServerInfo_C*                       CallFunc_Create_ReturnValue;                       // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F1[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F2[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Menu_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu; // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F3[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientGetUserDataRequest              K2Node_MakeStruct_ClientGetUserDataRequest;        // 0x0170(0x0030)()
	class UPlayFabClientAPI*                      CallFunc_GetUserReadOnlyData_ReturnValue;          // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FClientGetUserDataResult               K2Node_CustomEvent_result;                         // 0x01A8(0x0018)(NoDestructor)
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F4[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetFieldNames_ReturnValue;                // 0x01D0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F5[0x4];                                     // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F6[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue_2;             // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_DateTimeFromIsoString_Result;             // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DateTimeFromIsoString_ReturnValue;        // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F7[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x0250(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_2;                   // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F8[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__Object;       // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DecodeJson_ReturnValue;                   // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34F9[0x3];                                     // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue;                        // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBuildNumber_ReturnValue;               // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34FA[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PG_GameInstance_C*                  CallFunc_GetGameInstance_MyGameIntance;            // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClientGameInstance*                    CallFunc_GetClientGameInstance_ReturnValue;        // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x02D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetServerTime_ReturnValue;                // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34FB[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetDuration_ReturnValue;                  // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0305(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34FC[0x2];                                     // 0x0306(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue_1;        // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DecodeJson_ReturnValue_1;                 // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34FD[0x7];                                     // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue_3;             // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList) == 0x000008, "Wrong alignment on UI_ServerList_C_ExecuteUbergraph_UI_ServerList");
static_assert(sizeof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList) == 0x000388, "Wrong size on UI_ServerList_C_ExecuteUbergraph_UI_ServerList");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, EntryPoint) == 0x000000, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_WithEditor_ReturnValue) == 0x000004, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_WithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, Temp_bool_Variable) == 0x000028, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Not_PreBool_ReturnValue) == 0x000034, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, Temp_int_Array_Index_Variable) == 0x000038, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_CustomEvent_error) == 0x000048, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_CustomEvent_error' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_CustomEvent_customData_1) == 0x000080, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_CustomEvent_customData_1' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000A0, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, Temp_struct_Variable) == 0x0000B8, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, Temp_object_Variable) == 0x0000F8, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_CustomEvent_Server_Info) == 0x000100, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_CustomEvent_Server_Info' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, Temp_bool_Variable_1) == 0x000108, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_Event_InFocusEvent) == 0x00010C, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_IsValid_ReturnValue) == 0x000114, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_CreateDelegate_OutputDelegate_2) == 0x000118, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_IsValid_ReturnValue_1) == 0x000128, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000130, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Create_ReturnValue) == 0x000138, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Array_Add_ReturnValue) == 0x000140, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_AddChild_ReturnValue) == 0x000148, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_GetIsEnabled_ReturnValue) == 0x000150, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_GetPlayerController_ReturnValue) == 0x000158, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu) == 0x000160, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_DynamicCast_AsBP_PG_Player_Controller_Menu' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_MakeStruct_ClientGetUserDataRequest) == 0x000170, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_MakeStruct_ClientGetUserDataRequest' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_GetUserReadOnlyData_ReturnValue) == 0x0001A0, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_GetUserReadOnlyData_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_CustomEvent_result) == 0x0001A8, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_CustomEvent_result' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_CustomEvent_customData) == 0x0001C0, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_CustomEvent_customData' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_IsValid_ReturnValue_2) == 0x0001C8, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_GetFieldNames_ReturnValue) == 0x0001D0, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_GetFieldNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Array_Get_Item) == 0x0001E0, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Array_Length_ReturnValue) == 0x0001F0, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_GetObjectField_ReturnValue) == 0x0001F8, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Less_IntInt_ReturnValue) == 0x000200, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_GetStringField_ReturnValue) == 0x000208, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_GetStringField_ReturnValue_1) == 0x000218, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_GetStringField_ReturnValue_2) == 0x000228, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_GetStringField_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_DateTimeFromIsoString_Result) == 0x000238, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_DateTimeFromIsoString_Result' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_DateTimeFromIsoString_ReturnValue) == 0x000240, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_DateTimeFromIsoString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_ConstructJsonObject_ReturnValue) == 0x000248, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_CustomEvent_response) == 0x000250, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_CustomEvent_customData_2) == 0x000290, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_CustomEvent_customData_2' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_CustomEvent_successful) == 0x000298, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_LowEntry_LocalVariable_Value__Object) == 0x0002A0, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_GetNumberField_ReturnValue) == 0x0002A8, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_DecodeJson_ReturnValue) == 0x0002AC, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_DecodeJson_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Round_ReturnValue) == 0x0002B0, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_GetBuildNumber_ReturnValue) == 0x0002B4, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_GetBuildNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002B8, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_GetGameInstance_MyGameIntance) == 0x0002C0, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_GetGameInstance_MyGameIntance' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_GetClientGameInstance_ReturnValue) == 0x0002C8, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_GetClientGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002D0, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_GetServerTime_ReturnValue) == 0x0002E0, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_GetServerTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x0002E8, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, Temp_bool_Variable_2) == 0x0002F0, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_GetDuration_ReturnValue) == 0x0002F8, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_GetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_GetTotalSeconds_ReturnValue) == 0x000300, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Not_PreBool_ReturnValue_1) == 0x000304, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000305, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000308, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_ConstructJsonObject_ReturnValue_1) == 0x000318, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_ConstructJsonObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, K2Node_LowEntry_LocalVariable_Value__1_Object) == 0x000320, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::K2Node_LowEntry_LocalVariable_Value__1_Object' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_DecodeJson_ReturnValue_1) == 0x000328, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_DecodeJson_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_GetStringField_ReturnValue_3) == 0x000330, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_GetStringField_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Concat_StrStr_ReturnValue) == 0x000340, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000350, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000360, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Round_A_ImplicitCast) == 0x000370, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Round_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x000378, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_ExecuteUbergraph_UI_ServerList, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000380, "Member 'UI_ServerList_C_ExecuteUbergraph_UI_ServerList::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function UI_ServerList.UI_ServerList_C.OnPlayFabResponse_BC315A8A41E7AFC93E0DE28FE55E005A
// 0x0050 (0x0050 - 0x0000)
struct UI_ServerList_C_OnPlayFabResponse_BC315A8A41E7AFC93E0DE28FE55E005A final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ServerList_C_OnPlayFabResponse_BC315A8A41E7AFC93E0DE28FE55E005A) == 0x000008, "Wrong alignment on UI_ServerList_C_OnPlayFabResponse_BC315A8A41E7AFC93E0DE28FE55E005A");
static_assert(sizeof(UI_ServerList_C_OnPlayFabResponse_BC315A8A41E7AFC93E0DE28FE55E005A) == 0x000050, "Wrong size on UI_ServerList_C_OnPlayFabResponse_BC315A8A41E7AFC93E0DE28FE55E005A");
static_assert(offsetof(UI_ServerList_C_OnPlayFabResponse_BC315A8A41E7AFC93E0DE28FE55E005A, Response) == 0x000000, "Member 'UI_ServerList_C_OnPlayFabResponse_BC315A8A41E7AFC93E0DE28FE55E005A::Response' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_OnPlayFabResponse_BC315A8A41E7AFC93E0DE28FE55E005A, CustomData) == 0x000040, "Member 'UI_ServerList_C_OnPlayFabResponse_BC315A8A41E7AFC93E0DE28FE55E005A::CustomData' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_OnPlayFabResponse_BC315A8A41E7AFC93E0DE28FE55E005A, Successful) == 0x000048, "Member 'UI_ServerList_C_OnPlayFabResponse_BC315A8A41E7AFC93E0DE28FE55E005A::Successful' has a wrong offset!");

// Function UI_ServerList.UI_ServerList_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UI_ServerList_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UI_ServerList_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on UI_ServerList_C_OnRemovedFromFocusPath");
static_assert(sizeof(UI_ServerList_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on UI_ServerList_C_OnRemovedFromFocusPath");
static_assert(offsetof(UI_ServerList_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'UI_ServerList_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function UI_ServerList.UI_ServerList_C.RequestServerList_Failure
// 0x0040 (0x0040 - 0x0000)
struct UI_ServerList_C_RequestServerList_Failure final
{
public:
	struct FPlayFabError                          Error;                                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ServerList_C_RequestServerList_Failure) == 0x000008, "Wrong alignment on UI_ServerList_C_RequestServerList_Failure");
static_assert(sizeof(UI_ServerList_C_RequestServerList_Failure) == 0x000040, "Wrong size on UI_ServerList_C_RequestServerList_Failure");
static_assert(offsetof(UI_ServerList_C_RequestServerList_Failure, Error) == 0x000000, "Member 'UI_ServerList_C_RequestServerList_Failure::Error' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_RequestServerList_Failure, CustomData) == 0x000038, "Member 'UI_ServerList_C_RequestServerList_Failure::CustomData' has a wrong offset!");

// Function UI_ServerList.UI_ServerList_C.RequestServerList_Success
// 0x0020 (0x0020 - 0x0000)
struct UI_ServerList_C_RequestServerList_Success final
{
public:
	struct FClientGetUserDataResult               Result;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                                CustomData;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ServerList_C_RequestServerList_Success) == 0x000008, "Wrong alignment on UI_ServerList_C_RequestServerList_Success");
static_assert(sizeof(UI_ServerList_C_RequestServerList_Success) == 0x000020, "Wrong size on UI_ServerList_C_RequestServerList_Success");
static_assert(offsetof(UI_ServerList_C_RequestServerList_Success, Result) == 0x000000, "Member 'UI_ServerList_C_RequestServerList_Success::Result' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_RequestServerList_Success, CustomData) == 0x000018, "Member 'UI_ServerList_C_RequestServerList_Success::CustomData' has a wrong offset!");

// Function UI_ServerList.UI_ServerList_C.SelectServer
// 0x05D8 (0x05D8 - 0x0000)
struct UI_ServerList_C_SelectServer final
{
public:
	class UUI_ServerInfo_C*                       Server;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0080(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x0098(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00B0(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x00C8(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x00E0(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x00F8(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x0110(0x0018)()
	class FText                                   Temp_text_Variable_12;                             // 0x0128(0x0018)()
	class FText                                   Temp_text_Variable_13;                             // 0x0140(0x0018)()
	class FText                                   Temp_text_Variable_14;                             // 0x0158(0x0018)()
	class FText                                   Temp_text_Variable_15;                             // 0x0170(0x0018)()
	class FText                                   Temp_text_Variable_16;                             // 0x0188(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34FE[0x1];                                     // 0x01A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34FF[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_17;                             // 0x01B0(0x0018)()
	class UPlayFabJsonObject*                     CallFunc_GetObjectField_ReturnValue;               // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3500[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNumberField_ReturnValue;               // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_1;             // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x01E0(0x0018)()
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3501[0x4];                                     // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0200(0x0018)()
	class FText                                   Temp_text_Variable_18;                             // 0x0218(0x0018)()
	class FText                                   Temp_text_Variable_19;                             // 0x0230(0x0018)()
	class FText                                   Temp_text_Variable_20;                             // 0x0248(0x0018)()
	EAzureRegion                                  Temp_byte_Variable;                                // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3502[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_21;                             // 0x0268(0x0018)()
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMapInfo                               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0298(0x00E8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_1;                   // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3503[0x6];                                     // 0x0382(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3504[0x4];                                     // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumberField_ReturnValue_2;             // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue_2;                   // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3505[0x3];                                     // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue_2;                      // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3506[0x4];                                     // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x03C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x03D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x03E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3507[0x6];                                     // 0x040A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_1;                           // 0x0410(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default_2;                           // 0x0420(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0430(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0448(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0460(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x04B0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0500(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0510(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0528(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0540(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x0558(0x0018)()
	class FText                                   Temp_text_Variable_22;                             // 0x0570(0x0018)()
	class FText                                   K2Node_Select_Default_3;                           // 0x0588(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3508[0x7];                                     // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Round_A_ImplicitCast_1;                   // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x05CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Round_A_ImplicitCast_2;                   // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ServerList_C_SelectServer) == 0x000008, "Wrong alignment on UI_ServerList_C_SelectServer");
static_assert(sizeof(UI_ServerList_C_SelectServer) == 0x0005D8, "Wrong size on UI_ServerList_C_SelectServer");
static_assert(offsetof(UI_ServerList_C_SelectServer, Server) == 0x000000, "Member 'UI_ServerList_C_SelectServer::Server' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable) == 0x000008, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_1) == 0x000020, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_2) == 0x000038, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_3) == 0x000050, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_4) == 0x000068, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_5) == 0x000080, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_6) == 0x000098, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_7) == 0x0000B0, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_8) == 0x0000C8, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_9) == 0x0000E0, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_10) == 0x0000F8, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_11) == 0x000110, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_11' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_12) == 0x000128, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_12' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_13) == 0x000140, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_13' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_14) == 0x000158, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_14' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_15) == 0x000170, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_15' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_16) == 0x000188, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_16' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_bool_Variable) == 0x0001A0, "Member 'UI_ServerList_C_SelectServer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_bool_Variable_1) == 0x0001A1, "Member 'UI_ServerList_C_SelectServer::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_bool_Variable_2) == 0x0001A2, "Member 'UI_ServerList_C_SelectServer::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_int_Variable) == 0x0001A4, "Member 'UI_ServerList_C_SelectServer::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_int_Variable_1) == 0x0001A8, "Member 'UI_ServerList_C_SelectServer::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_17) == 0x0001B0, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_17' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, CallFunc_GetObjectField_ReturnValue) == 0x0001C8, "Member 'UI_ServerList_C_SelectServer::CallFunc_GetObjectField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, CallFunc_HasField_ReturnValue) == 0x0001D0, "Member 'UI_ServerList_C_SelectServer::CallFunc_HasField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, CallFunc_GetNumberField_ReturnValue) == 0x0001D4, "Member 'UI_ServerList_C_SelectServer::CallFunc_GetNumberField_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, CallFunc_Round_ReturnValue) == 0x0001D8, "Member 'UI_ServerList_C_SelectServer::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, CallFunc_GetNumberField_ReturnValue_1) == 0x0001DC, "Member 'UI_ServerList_C_SelectServer::CallFunc_GetNumberField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, CallFunc_Conv_IntToText_ReturnValue) == 0x0001E0, "Member 'UI_ServerList_C_SelectServer::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, CallFunc_Round_ReturnValue_1) == 0x0001F8, "Member 'UI_ServerList_C_SelectServer::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000200, "Member 'UI_ServerList_C_SelectServer::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ServerList_C_SelectServer, Temp_text_Variable_18) == 0x000218, "Member 'UI_ServerList_C_SelectServer::Temp_text_Variable_18' has a wrong offset!");
