#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Scoreboard_Player

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_Scoreboard_Player.UI_Scoreboard_Player_C.ExecuteUbergraph_UI_Scoreboard_Player
// 0x0130 (0x0130 - 0x0000)
struct UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA8[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA9[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetCompressedPing_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BAA[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Multiply_ByteByte_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BAB[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ByteToText_ReturnValue;              // 0x0070(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BAC[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BAD[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BAE[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00B4(0x0014)()
	struct FLevelInfo                             CallFunc_GetCurrentLevelInfo_ReturnValue;          // 0x00C8(0x0048)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BAF[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0118(0x0018)()
};
static_assert(alignof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player) == 0x000008, "Wrong alignment on UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player");
static_assert(sizeof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player) == 0x000130, "Wrong size on UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, EntryPoint) == 0x000000, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, K2Node_CustomEvent_Loaded) == 0x000028, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, Temp_object_Variable) == 0x000030, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, K2Node_DynamicCast_AsTexture_2D) == 0x000038, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, CallFunc_GetCompressedPing_ReturnValue) == 0x000054, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::CallFunc_GetCompressedPing_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, K2Node_CreateDelegate_OutputDelegate_3) == 0x000058, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, CallFunc_Multiply_ByteByte_ReturnValue) == 0x000068, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::CallFunc_Multiply_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, CallFunc_Conv_ByteToText_ReturnValue) == 0x000070, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::CallFunc_Conv_ByteToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, K2Node_CreateDelegate_OutputDelegate_4) == 0x00008C, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000A0, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, CallFunc_GetOwner_ReturnValue) == 0x0000A8, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000B0, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, K2Node_MakeStruct_SlateColor) == 0x0000B4, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, CallFunc_GetCurrentLevelInfo_ReturnValue) == 0x0000C8, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::CallFunc_GetCurrentLevelInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, CallFunc_Greater_IntInt_ReturnValue) == 0x000110, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player, CallFunc_Conv_IntToText_ReturnValue) == 0x000118, "Member 'UI_Scoreboard_Player_C_ExecuteUbergraph_UI_Scoreboard_Player::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function UI_Scoreboard_Player.UI_Scoreboard_Player_C.OnLoaded_35F61F374CADE7A5EBBD56B37A053F44
// 0x0008 (0x0008 - 0x0000)
struct UI_Scoreboard_Player_C_OnLoaded_35F61F374CADE7A5EBBD56B37A053F44 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Scoreboard_Player_C_OnLoaded_35F61F374CADE7A5EBBD56B37A053F44) == 0x000008, "Wrong alignment on UI_Scoreboard_Player_C_OnLoaded_35F61F374CADE7A5EBBD56B37A053F44");
static_assert(sizeof(UI_Scoreboard_Player_C_OnLoaded_35F61F374CADE7A5EBBD56B37A053F44) == 0x000008, "Wrong size on UI_Scoreboard_Player_C_OnLoaded_35F61F374CADE7A5EBBD56B37A053F44");
static_assert(offsetof(UI_Scoreboard_Player_C_OnLoaded_35F61F374CADE7A5EBBD56B37A053F44, Loaded) == 0x000000, "Member 'UI_Scoreboard_Player_C_OnLoaded_35F61F374CADE7A5EBBD56B37A053F44::Loaded' has a wrong offset!");

// Function UI_Scoreboard_Player.UI_Scoreboard_Player_C.OnMouseButtonDown
// 0x0238 (0x0238 - 0x0000)
struct UI_Scoreboard_Player_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Scoreboard_Player_Menu_C*           CallFunc_Create_ReturnValue;                       // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB0[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0180(0x00B8)()
};
static_assert(alignof(UI_Scoreboard_Player_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UI_Scoreboard_Player_C_OnMouseButtonDown");
static_assert(sizeof(UI_Scoreboard_Player_C_OnMouseButtonDown) == 0x000238, "Wrong size on UI_Scoreboard_Player_C_OnMouseButtonDown");
static_assert(offsetof(UI_Scoreboard_Player_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UI_Scoreboard_Player_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UI_Scoreboard_Player_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'UI_Scoreboard_Player_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_OnMouseButtonDown, CallFunc_GetPlayerController_ReturnValue) == 0x000168, "Member 'UI_Scoreboard_Player_C_OnMouseButtonDown::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_OnMouseButtonDown, CallFunc_Create_ReturnValue) == 0x000170, "Member 'UI_Scoreboard_Player_C_OnMouseButtonDown::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_OnMouseButtonDown, CallFunc_IsValid_ReturnValue) == 0x000178, "Member 'UI_Scoreboard_Player_C_OnMouseButtonDown::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000180, "Member 'UI_Scoreboard_Player_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UI_Scoreboard_Player.UI_Scoreboard_Player_C.SetKillsOfPlayer
// 0x0018 (0x0018 - 0x0000)
struct UI_Scoreboard_Player_C_SetKillsOfPlayer final
{
public:
	class FText                                   CallFunc_Conv_ByteToText_ReturnValue;              // 0x0000(0x0018)()
};
static_assert(alignof(UI_Scoreboard_Player_C_SetKillsOfPlayer) == 0x000008, "Wrong alignment on UI_Scoreboard_Player_C_SetKillsOfPlayer");
static_assert(sizeof(UI_Scoreboard_Player_C_SetKillsOfPlayer) == 0x000018, "Wrong size on UI_Scoreboard_Player_C_SetKillsOfPlayer");
static_assert(offsetof(UI_Scoreboard_Player_C_SetKillsOfPlayer, CallFunc_Conv_ByteToText_ReturnValue) == 0x000000, "Member 'UI_Scoreboard_Player_C_SetKillsOfPlayer::CallFunc_Conv_ByteToText_ReturnValue' has a wrong offset!");

// Function UI_Scoreboard_Player.UI_Scoreboard_Player_C.SetPlayerDeaths
// 0x0018 (0x0018 - 0x0000)
struct UI_Scoreboard_Player_C_SetPlayerDeaths final
{
public:
	class FText                                   CallFunc_Conv_ByteToText_ReturnValue;              // 0x0000(0x0018)()
};
static_assert(alignof(UI_Scoreboard_Player_C_SetPlayerDeaths) == 0x000008, "Wrong alignment on UI_Scoreboard_Player_C_SetPlayerDeaths");
static_assert(sizeof(UI_Scoreboard_Player_C_SetPlayerDeaths) == 0x000018, "Wrong size on UI_Scoreboard_Player_C_SetPlayerDeaths");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerDeaths, CallFunc_Conv_ByteToText_ReturnValue) == 0x000000, "Member 'UI_Scoreboard_Player_C_SetPlayerDeaths::CallFunc_Conv_ByteToText_ReturnValue' has a wrong offset!");

// Function UI_Scoreboard_Player.UI_Scoreboard_Player_C.SetPlayerGameScore
// 0x0028 (0x0028 - 0x0000)
struct UI_Scoreboard_Player_C_SetPlayerGameScore final
{
public:
	float                                         CallFunc_GetScore_ReturnValue;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Scoreboard_Player_C_SetPlayerGameScore) == 0x000008, "Wrong alignment on UI_Scoreboard_Player_C_SetPlayerGameScore");
static_assert(sizeof(UI_Scoreboard_Player_C_SetPlayerGameScore) == 0x000028, "Wrong size on UI_Scoreboard_Player_C_SetPlayerGameScore");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerGameScore, CallFunc_GetScore_ReturnValue) == 0x000000, "Member 'UI_Scoreboard_Player_C_SetPlayerGameScore::CallFunc_GetScore_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerGameScore, CallFunc_Round_ReturnValue) == 0x000004, "Member 'UI_Scoreboard_Player_C_SetPlayerGameScore::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerGameScore, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'UI_Scoreboard_Player_C_SetPlayerGameScore::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerGameScore, CallFunc_Round_A_ImplicitCast) == 0x000020, "Member 'UI_Scoreboard_Player_C_SetPlayerGameScore::CallFunc_Round_A_ImplicitCast' has a wrong offset!");

// Function UI_Scoreboard_Player.UI_Scoreboard_Player_C.SetPlayerName
// 0x0078 (0x0078 - 0x0000)
struct UI_Scoreboard_Player_C_SetPlayerName final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB1[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0014)()
	uint8                                         Pad_3BB2[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
};
static_assert(alignof(UI_Scoreboard_Player_C_SetPlayerName) == 0x000008, "Wrong alignment on UI_Scoreboard_Player_C_SetPlayerName");
static_assert(sizeof(UI_Scoreboard_Player_C_SetPlayerName) == 0x000078, "Wrong size on UI_Scoreboard_Player_C_SetPlayerName");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerName, Temp_bool_Variable) == 0x000000, "Member 'UI_Scoreboard_Player_C_SetPlayerName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerName, Temp_byte_Variable) == 0x000001, "Member 'UI_Scoreboard_Player_C_SetPlayerName::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerName, Temp_byte_Variable_1) == 0x000002, "Member 'UI_Scoreboard_Player_C_SetPlayerName::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerName, Temp_bool_Variable_1) == 0x000003, "Member 'UI_Scoreboard_Player_C_SetPlayerName::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerName, Temp_struct_Variable) == 0x000004, "Member 'UI_Scoreboard_Player_C_SetPlayerName::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerName, Temp_struct_Variable_1) == 0x000014, "Member 'UI_Scoreboard_Player_C_SetPlayerName::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerName, K2Node_Select_Default) == 0x000024, "Member 'UI_Scoreboard_Player_C_SetPlayerName::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerName, K2Node_Select_Default_1) == 0x000028, "Member 'UI_Scoreboard_Player_C_SetPlayerName::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerName, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'UI_Scoreboard_Player_C_SetPlayerName::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerName, CallFunc_GetPlayerName_ReturnValue) == 0x000050, "Member 'UI_Scoreboard_Player_C_SetPlayerName::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerName, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'UI_Scoreboard_Player_C_SetPlayerName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UI_Scoreboard_Player.UI_Scoreboard_Player_C.SetPlayerNumber
// 0x0028 (0x0028 - 0x0000)
struct UI_Scoreboard_Player_C_SetPlayerNumber final
{
public:
	int32                                         NewNumber;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Scoreboard_Player_C_SetPlayerNumber) == 0x000008, "Wrong alignment on UI_Scoreboard_Player_C_SetPlayerNumber");
static_assert(sizeof(UI_Scoreboard_Player_C_SetPlayerNumber) == 0x000028, "Wrong size on UI_Scoreboard_Player_C_SetPlayerNumber");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerNumber, NewNumber) == 0x000000, "Member 'UI_Scoreboard_Player_C_SetPlayerNumber::NewNumber' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerNumber, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'UI_Scoreboard_Player_C_SetPlayerNumber::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerNumber, CallFunc_Percent_IntInt_ReturnValue) == 0x000020, "Member 'UI_Scoreboard_Player_C_SetPlayerNumber::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SetPlayerNumber, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000024, "Member 'UI_Scoreboard_Player_C_SetPlayerNumber::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UI_Scoreboard_Player.UI_Scoreboard_Player_C.SortPlayers
// 0x0020 (0x0020 - 0x0000)
struct UI_Scoreboard_Player_C_SortPlayers final
{
public:
	class UGridPanel*                             GridTeam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Scoreboard_Player_C*                L_PlayerSlot;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          L_IsSorted;                                        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB4[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridPanel*                             L_GridTeam;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Scoreboard_Player_C_SortPlayers) == 0x000008, "Wrong alignment on UI_Scoreboard_Player_C_SortPlayers");
static_assert(sizeof(UI_Scoreboard_Player_C_SortPlayers) == 0x000020, "Wrong size on UI_Scoreboard_Player_C_SortPlayers");
static_assert(offsetof(UI_Scoreboard_Player_C_SortPlayers, GridTeam) == 0x000000, "Member 'UI_Scoreboard_Player_C_SortPlayers::GridTeam' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SortPlayers, L_PlayerSlot) == 0x000008, "Member 'UI_Scoreboard_Player_C_SortPlayers::L_PlayerSlot' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SortPlayers, L_IsSorted) == 0x000010, "Member 'UI_Scoreboard_Player_C_SortPlayers::L_IsSorted' has a wrong offset!");
static_assert(offsetof(UI_Scoreboard_Player_C_SortPlayers, L_GridTeam) == 0x000018, "Member 'UI_Scoreboard_Player_C_SortPlayers::L_GridTeam' has a wrong offset!");

}

