#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_TeamBaseMarker

#include "Basic.hpp"

#include "POLYGON_structs.hpp"


namespace SDK::Params
{

// Function UI_TeamBaseMarker.UI_TeamBaseMarker_C.ExecuteUbergraph_UI_TeamBaseMarker
// 0x0098 (0x0098 - 0x0000)
struct UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC0[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC1[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APG_Game_Character*                     K2Node_DynamicCast_AsPG_Game_Character;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC2[0x1];                                     // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC3[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PG_PlayerController_Game_C*         K2Node_DynamicCast_AsBP_PG_Player_Controller_Game; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC4[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC5[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PG_PlayerState_Game_C*              K2Node_DynamicCast_AsBP_PG_Player_State_Game_1;    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC6[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker) == 0x000008, "Wrong alignment on UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker");
static_assert(sizeof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker) == 0x000098, "Wrong size on UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, EntryPoint) == 0x000000, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, K2Node_Event_IsDesignTime) == 0x000014, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, K2Node_DynamicCast_AsBP_PG_Player_State_Game) == 0x000020, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::K2Node_DynamicCast_AsBP_PG_Player_State_Game' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000030, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, K2Node_DynamicCast_AsPG_Game_Character) == 0x000038, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::K2Node_DynamicCast_AsPG_Game_Character' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000041, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, CallFunc_BooleanAND_ReturnValue) == 0x000054, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, CallFunc_GetPlayerController_ReturnValue_1) == 0x000058, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, K2Node_DynamicCast_AsBP_PG_Player_Controller_Game) == 0x000060, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::K2Node_DynamicCast_AsBP_PG_Player_Controller_Game' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, CallFunc_GetPlayerController_ReturnValue_2) == 0x000070, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, K2Node_DynamicCast_AsBP_PG_Player_State_Game_1) == 0x000080, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::K2Node_DynamicCast_AsBP_PG_Player_State_Game_1' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, K2Node_DynamicCast_bSuccess_3) == 0x000088, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000089, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00008A, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00008B, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, CallFunc_BooleanOR_ReturnValue) == 0x00008C, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000090, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000094, "Member 'UI_TeamBaseMarker_C_ExecuteUbergraph_UI_TeamBaseMarker::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");

// Function UI_TeamBaseMarker.UI_TeamBaseMarker_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_TeamBaseMarker_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_TeamBaseMarker_C_PreConstruct) == 0x000001, "Wrong alignment on UI_TeamBaseMarker_C_PreConstruct");
static_assert(sizeof(UI_TeamBaseMarker_C_PreConstruct) == 0x000001, "Wrong size on UI_TeamBaseMarker_C_PreConstruct");
static_assert(offsetof(UI_TeamBaseMarker_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_TeamBaseMarker_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_TeamBaseMarker.UI_TeamBaseMarker_C.SelectAsSpawnPointDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_TeamBaseMarker_C_SelectAsSpawnPointDelegate__DelegateSignature final
{
public:
	EControlPoint                                 Point;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_TeamBaseMarker_C_SelectAsSpawnPointDelegate__DelegateSignature) == 0x000001, "Wrong alignment on UI_TeamBaseMarker_C_SelectAsSpawnPointDelegate__DelegateSignature");
static_assert(sizeof(UI_TeamBaseMarker_C_SelectAsSpawnPointDelegate__DelegateSignature) == 0x000001, "Wrong size on UI_TeamBaseMarker_C_SelectAsSpawnPointDelegate__DelegateSignature");
static_assert(offsetof(UI_TeamBaseMarker_C_SelectAsSpawnPointDelegate__DelegateSignature, Point) == 0x000000, "Member 'UI_TeamBaseMarker_C_SelectAsSpawnPointDelegate__DelegateSignature::Point' has a wrong offset!");

}

