#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_UpgradeLevelOfPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "POLYGON_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_UpgradeLevelOfPlayer.UI_UpgradeLevelOfPlayer_C
// 0x00D8 (0x0358 - 0x0280)
class UUI_UpgradeLevelOfPlayer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unlocks;                                           // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DisplayNewLevel;                                   // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_NewLevelIcon;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_UnlockImage;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lines_01;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lines_02;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LinesRainbow_01;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LinesRainbow_02;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NewLevel;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Unlocks;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_NewLevel;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_NewLevel_1;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_NewLevel_2;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_UnlockItem_Name;                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Lock;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLevelInfo                             CurrentLevel;                                      // 0x0300(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSubclassOf<class AItem_General>>      NewAvaliableItems;                                 // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_UI_UpgradeLevelOfPlayer(int32 EntryPoint);
	void OnLoaded_1C3DEABF479ED1124FB5CC964FCC7D87(class UObject* Loaded);
	void OnLoaded_CA54BF554483FB7A8A73F1A47DB82EDC(class UObject* Loaded);
	void PreConstruct(bool IsDesignTime);
	void ShowUnlockItem();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_UpgradeLevelOfPlayer_C">();
	}
	static class UUI_UpgradeLevelOfPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_UpgradeLevelOfPlayer_C>();
	}
};
static_assert(alignof(UUI_UpgradeLevelOfPlayer_C) == 0x000008, "Wrong alignment on UUI_UpgradeLevelOfPlayer_C");
static_assert(sizeof(UUI_UpgradeLevelOfPlayer_C) == 0x000358, "Wrong size on UUI_UpgradeLevelOfPlayer_C");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, UberGraphFrame) == 0x000280, "Member 'UUI_UpgradeLevelOfPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, Unlocks) == 0x000288, "Member 'UUI_UpgradeLevelOfPlayer_C::Unlocks' has a wrong offset!");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, DisplayNewLevel) == 0x000290, "Member 'UUI_UpgradeLevelOfPlayer_C::DisplayNewLevel' has a wrong offset!");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, Image_NewLevelIcon) == 0x000298, "Member 'UUI_UpgradeLevelOfPlayer_C::Image_NewLevelIcon' has a wrong offset!");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, Image_UnlockImage) == 0x0002A0, "Member 'UUI_UpgradeLevelOfPlayer_C::Image_UnlockImage' has a wrong offset!");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, Lines_01) == 0x0002A8, "Member 'UUI_UpgradeLevelOfPlayer_C::Lines_01' has a wrong offset!");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, Lines_02) == 0x0002B0, "Member 'UUI_UpgradeLevelOfPlayer_C::Lines_02' has a wrong offset!");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, LinesRainbow_01) == 0x0002B8, "Member 'UUI_UpgradeLevelOfPlayer_C::LinesRainbow_01' has a wrong offset!");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, LinesRainbow_02) == 0x0002C0, "Member 'UUI_UpgradeLevelOfPlayer_C::LinesRainbow_02' has a wrong offset!");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, Overlay_NewLevel) == 0x0002C8, "Member 'UUI_UpgradeLevelOfPlayer_C::Overlay_NewLevel' has a wrong offset!");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, Overlay_Unlocks) == 0x0002D0, "Member 'UUI_UpgradeLevelOfPlayer_C::Overlay_Unlocks' has a wrong offset!");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, TextBlock_NewLevel) == 0x0002D8, "Member 'UUI_UpgradeLevelOfPlayer_C::TextBlock_NewLevel' has a wrong offset!");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, TextBlock_NewLevel_1) == 0x0002E0, "Member 'UUI_UpgradeLevelOfPlayer_C::TextBlock_NewLevel_1' has a wrong offset!");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, TextBlock_NewLevel_2) == 0x0002E8, "Member 'UUI_UpgradeLevelOfPlayer_C::TextBlock_NewLevel_2' has a wrong offset!");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, TextBlock_UnlockItem_Name) == 0x0002F0, "Member 'UUI_UpgradeLevelOfPlayer_C::TextBlock_UnlockItem_Name' has a wrong offset!");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, WidgetSwitcher_Lock) == 0x0002F8, "Member 'UUI_UpgradeLevelOfPlayer_C::WidgetSwitcher_Lock' has a wrong offset!");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, CurrentLevel) == 0x000300, "Member 'UUI_UpgradeLevelOfPlayer_C::CurrentLevel' has a wrong offset!");
static_assert(offsetof(UUI_UpgradeLevelOfPlayer_C, NewAvaliableItems) == 0x000348, "Member 'UUI_UpgradeLevelOfPlayer_C::NewAvaliableItems' has a wrong offset!");

}

