#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Weapons

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Weapons.UI_Weapons_C
// 0x0028 (0x02A8 - 0x0280)
class UUI_Weapons_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowAnimation;                                     // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Primary;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Secondary;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_PG_Game_Character_C*                Character;                                         // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_Weapons(int32 EntryPoint);
	void OnLoaded_321EB0874E76A481910ADFAA8B0A3201(class UObject* Loaded);
	void OnLoaded_E41DF5A1487589D026FEA2ADA77B92A5(class UObject* Loaded);
	void OnPossessedPawnChanged_Event(class APawn* OldPawn, class APawn* NewPawn);
	void OnSetCurrentGun_Event(class AItem_Gun_General* OldCurrentGun);
	void OnSetPlayerState_Event();
	void OnSetPrimaryGun_Event(class AItem_Gun_General* OldGun);
	void OnSetSecondaryGun_Event(class AItem_Gun_General* OldGun);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Weapons_C">();
	}
	static class UUI_Weapons_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Weapons_C>();
	}
};
static_assert(alignof(UUI_Weapons_C) == 0x000008, "Wrong alignment on UUI_Weapons_C");
static_assert(sizeof(UUI_Weapons_C) == 0x0002A8, "Wrong size on UUI_Weapons_C");
static_assert(offsetof(UUI_Weapons_C, UberGraphFrame) == 0x000280, "Member 'UUI_Weapons_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Weapons_C, ShowAnimation) == 0x000288, "Member 'UUI_Weapons_C::ShowAnimation' has a wrong offset!");
static_assert(offsetof(UUI_Weapons_C, Image_Primary) == 0x000290, "Member 'UUI_Weapons_C::Image_Primary' has a wrong offset!");
static_assert(offsetof(UUI_Weapons_C, Image_Secondary) == 0x000298, "Member 'UUI_Weapons_C::Image_Secondary' has a wrong offset!");
static_assert(offsetof(UUI_Weapons_C, Character) == 0x0002A0, "Member 'UUI_Weapons_C::Character' has a wrong offset!");

}

