#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ultra_Dynamic_Weather_Interface

#include "Basic.hpp"

#include "UDS_and_UDW_State_structs.hpp"


namespace SDK::Params
{

// Function Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Apply State
// 0x0178 (0x0178 - 0x0000)
struct Ultra_Dynamic_Weather_Interface_C_Apply_State final
{
public:
	struct FUDS_and_UDW_State                     State;                                             // 0x0000(0x0178)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_Interface_C_Apply_State) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_Interface_C_Apply_State");
static_assert(sizeof(Ultra_Dynamic_Weather_Interface_C_Apply_State) == 0x000178, "Wrong size on Ultra_Dynamic_Weather_Interface_C_Apply_State");
static_assert(offsetof(Ultra_Dynamic_Weather_Interface_C_Apply_State, State) == 0x000000, "Member 'Ultra_Dynamic_Weather_Interface_C_Apply_State::State' has a wrong offset!");

// Function Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Destroy Close Thunder Component
// 0x0008 (0x0008 - 0x0000)
struct Ultra_Dynamic_Weather_Interface_C_Destroy_Close_Thunder_Component final
{
public:
	class USceneComponent*                        Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_Interface_C_Destroy_Close_Thunder_Component) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_Interface_C_Destroy_Close_Thunder_Component");
static_assert(sizeof(Ultra_Dynamic_Weather_Interface_C_Destroy_Close_Thunder_Component) == 0x000008, "Wrong size on Ultra_Dynamic_Weather_Interface_C_Destroy_Close_Thunder_Component");
static_assert(offsetof(Ultra_Dynamic_Weather_Interface_C_Destroy_Close_Thunder_Component, Component) == 0x000000, "Member 'Ultra_Dynamic_Weather_Interface_C_Destroy_Close_Thunder_Component::Component' has a wrong offset!");

// Function Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Get Close Thunder Sound Occlusion
// 0x0010 (0x0010 - 0x0000)
struct Ultra_Dynamic_Weather_Interface_C_Get_Close_Thunder_Sound_Occlusion final
{
public:
	double                                        Volume;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LPF;                                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_Interface_C_Get_Close_Thunder_Sound_Occlusion) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_Interface_C_Get_Close_Thunder_Sound_Occlusion");
static_assert(sizeof(Ultra_Dynamic_Weather_Interface_C_Get_Close_Thunder_Sound_Occlusion) == 0x000010, "Wrong size on Ultra_Dynamic_Weather_Interface_C_Get_Close_Thunder_Sound_Occlusion");
static_assert(offsetof(Ultra_Dynamic_Weather_Interface_C_Get_Close_Thunder_Sound_Occlusion, Volume) == 0x000000, "Member 'Ultra_Dynamic_Weather_Interface_C_Get_Close_Thunder_Sound_Occlusion::Volume' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_Interface_C_Get_Close_Thunder_Sound_Occlusion, LPF) == 0x000008, "Member 'Ultra_Dynamic_Weather_Interface_C_Get_Close_Thunder_Sound_Occlusion::LPF' has a wrong offset!");

// Function Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Get Intended Cloud Direction
// 0x0008 (0x0008 - 0x0000)
struct Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Direction final
{
public:
	double                                        Intended_Cloud_Direction;                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Direction) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Direction");
static_assert(sizeof(Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Direction) == 0x000008, "Wrong size on Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Direction");
static_assert(offsetof(Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Direction, Intended_Cloud_Direction) == 0x000000, "Member 'Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Direction::Intended_Cloud_Direction' has a wrong offset!");

// Function Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Get Intended Cloud Speed
// 0x0008 (0x0008 - 0x0000)
struct Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Speed final
{
public:
	double                                        Intended_Cloud_Speed;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Speed) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Speed");
static_assert(sizeof(Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Speed) == 0x000008, "Wrong size on Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Speed");
static_assert(offsetof(Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Speed, Intended_Cloud_Speed) == 0x000000, "Member 'Ultra_Dynamic_Weather_Interface_C_Get_Intended_Cloud_Speed::Intended_Cloud_Speed' has a wrong offset!");

// Function Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Get State for Saving
// 0x0178 (0x0178 - 0x0000)
struct Ultra_Dynamic_Weather_Interface_C_Get_State_for_Saving final
{
public:
	struct FUDS_and_UDW_State                     UDW_State;                                         // 0x0000(0x0178)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_Interface_C_Get_State_for_Saving) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_Interface_C_Get_State_for_Saving");
static_assert(sizeof(Ultra_Dynamic_Weather_Interface_C_Get_State_for_Saving) == 0x000178, "Wrong size on Ultra_Dynamic_Weather_Interface_C_Get_State_for_Saving");
static_assert(offsetof(Ultra_Dynamic_Weather_Interface_C_Get_State_for_Saving, UDW_State) == 0x000000, "Member 'Ultra_Dynamic_Weather_Interface_C_Get_State_for_Saving::UDW_State' has a wrong offset!");

// Function Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Update Weather Settings from UDS
// 0x0018 (0x0018 - 0x0000)
struct Ultra_Dynamic_Weather_Interface_C_Update_Weather_Settings_from_UDS final
{
public:
	double                                        Cloud_Coverage;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fog;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Dust;                                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_Interface_C_Update_Weather_Settings_from_UDS) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_Interface_C_Update_Weather_Settings_from_UDS");
static_assert(sizeof(Ultra_Dynamic_Weather_Interface_C_Update_Weather_Settings_from_UDS) == 0x000018, "Wrong size on Ultra_Dynamic_Weather_Interface_C_Update_Weather_Settings_from_UDS");
static_assert(offsetof(Ultra_Dynamic_Weather_Interface_C_Update_Weather_Settings_from_UDS, Cloud_Coverage) == 0x000000, "Member 'Ultra_Dynamic_Weather_Interface_C_Update_Weather_Settings_from_UDS::Cloud_Coverage' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_Interface_C_Update_Weather_Settings_from_UDS, Fog) == 0x000008, "Member 'Ultra_Dynamic_Weather_Interface_C_Update_Weather_Settings_from_UDS::Fog' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_Interface_C_Update_Weather_Settings_from_UDS, Dust) == 0x000010, "Member 'Ultra_Dynamic_Weather_Interface_C_Update_Weather_Settings_from_UDS::Dust' has a wrong offset!");

}

