#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ultra_Dynamic_Sky

#include "Basic.hpp"

#include "UDS_FogColorMode_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UDS_LensFlareType_structs.hpp"
#include "UDS_Post_Process_Stage_structs.hpp"
#include "UDS_SkyMode_structs.hpp"
#include "UDS_CachedProperties_structs.hpp"
#include "Engine_structs.hpp"
#include "UDS_NoiseType_structs.hpp"
#include "UDS_VolRT_Mode_structs.hpp"
#include "UDS_and_UDW_State_structs.hpp"


namespace SDK::Params
{

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.2D Clouds Base Texture
// 0x0168 (0x0168 - 0x0000)
struct Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture final
{
public:
	TSoftObjectPtr<class UTexture2D>              Tex;                                               // 0x0000(0x0030)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395B[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0038(0x0030)(HasGetValueTypeHash)
	EUDS_NoiseType                                Temp_byte_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395C[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_1;                        // 0x0070(0x0030)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_2;                        // 0x00A0(0x0030)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x00D0(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395D[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x0108(0x0030)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_1;                           // 0x0138(0x0030)(HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture");
static_assert(sizeof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture) == 0x000168, "Wrong size on Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, Tex) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::Tex' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, Temp_bool_Variable) == 0x000030, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, Temp_softobject_Variable) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, Temp_byte_Variable) == 0x000068, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, Temp_softobject_Variable_1) == 0x000070, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::Temp_softobject_Variable_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, Temp_softobject_Variable_2) == 0x0000A0, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::Temp_softobject_Variable_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x0000D0, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000100, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, K2Node_Select_Default) == 0x000108, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture, K2Node_Select_Default_1) == 0x000138, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Base_Texture::K2Node_Select_Default_1' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Absent Directional Lights Brightness
// 0x0088 (0x0088 - 0x0000)
struct Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Moon_Phase_Multiplier_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Moon_Phase_Multiplier_Without_Light_Brightness; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness) == 0x000088, "Wrong size on Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, ReturnValue) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_BreakVector_X) == 0x000008, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_BreakVector_Y) == 0x000010, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_BreakVector_Z) == 0x000018, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_BreakVector_X_1) == 0x000020, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_BreakVector_Y_1) == 0x000028, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_BreakVector_Z_1) == 0x000030, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_MapRangeClamped_ReturnValue) == 0x000040, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_FClamp_ReturnValue) == 0x000048, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Moon_Phase_Multiplier_ReturnValue) == 0x000050, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Moon_Phase_Multiplier_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Moon_Phase_Multiplier_Without_Light_Brightness) == 0x000058, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Moon_Phase_Multiplier_Without_Light_Brightness' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000060, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000070, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_MapRangeClamped_ReturnValue_2) == 0x000078, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000080, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.All Volumetric Cloud MIDs
// 0x0048 (0x0048 - 0x0000)
struct Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs final
{
public:
	bool                                          Shadows;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       MIDs;                                              // 0x0008(0x0010)(Parm, OutParm)
	TArray<class UMaterialInstanceDynamic*>       All_MIDs;                                          // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395F[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3960[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs");
static_assert(sizeof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs) == 0x000048, "Wrong size on Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, Shadows) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::Shadows' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, MIDs) == 0x000008, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::MIDs' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, All_MIDs) == 0x000018, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::All_MIDs' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, CallFunc_Array_Add_ReturnValue_1) == 0x00002C, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000030, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, CallFunc_BooleanAND_ReturnValue) == 0x000031, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, CallFunc_Array_Add_ReturnValue_2) == 0x000034, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, CallFunc_Array_Add_ReturnValue_3) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, CallFunc_BooleanAND_ReturnValue_1) == 0x00003C, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, CallFunc_Array_Add_ReturnValue_4) == 0x000040, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs, CallFunc_Array_Add_ReturnValue_5) == 0x000044, "Member 'Ultra_Dynamic_Sky_C_All_Volumetric_Cloud_MIDs::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Apply Console Variable with Check
// 0x00E0 (0x00E0 - 0x0000)
struct Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check final
{
public:
	class FString                                 Cvar;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	double                                        Setting;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3961[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3962[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3963[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3964[0x2];                                     // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetConsoleVariableFloatValue_ReturnValue; // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3965[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check) == 0x0000E0, "Wrong size on Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, Cvar) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::Cvar' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, Setting) == 0x000010, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::Setting' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, Type) == 0x000018, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::Type' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, K2Node_SwitchInteger_CmpSuccess) == 0x00001C, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_FTrunc_ReturnValue) == 0x000030, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000034, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Conv_IntToString_ReturnValue) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000048, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000060, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_FTrunc_ReturnValue_1) == 0x000064, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000068, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000078, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000088, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000098, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000099, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_GetConsoleVariableFloatValue_ReturnValue) == 0x00009C, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_GetConsoleVariableFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Conv_DoubleToString_ReturnValue) == 0x0000A0, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000B0, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000C0, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x0000D8, "Member 'Ultra_Dynamic_Sky_C_Apply_Console_Variable_with_Check::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Apply Location Preset
// 0x0050 (0x0050 - 0x0000)
struct Ultra_Dynamic_Sky_C_Apply_Location_Preset final
{
public:
	struct FVector                                CallFunc_Map_Find_Value;                           // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3966[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector3f_X;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Y;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Z;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              CallFunc_BreakVector3f_InVec_ImplicitCast;         // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3967[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Latitude_ImplicitCast;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Longitude_ImplicitCast;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Time_Zone_ImplicitCast;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Apply_Location_Preset) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Apply_Location_Preset");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Apply_Location_Preset) == 0x000050, "Wrong size on Ultra_Dynamic_Sky_C_Apply_Location_Preset");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Location_Preset, CallFunc_Map_Find_Value) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Apply_Location_Preset::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Location_Preset, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'Ultra_Dynamic_Sky_C_Apply_Location_Preset::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Location_Preset, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000019, "Member 'Ultra_Dynamic_Sky_C_Apply_Location_Preset::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Location_Preset, CallFunc_BreakVector3f_X) == 0x00001C, "Member 'Ultra_Dynamic_Sky_C_Apply_Location_Preset::CallFunc_BreakVector3f_X' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Location_Preset, CallFunc_BreakVector3f_Y) == 0x000020, "Member 'Ultra_Dynamic_Sky_C_Apply_Location_Preset::CallFunc_BreakVector3f_Y' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Location_Preset, CallFunc_BreakVector3f_Z) == 0x000024, "Member 'Ultra_Dynamic_Sky_C_Apply_Location_Preset::CallFunc_BreakVector3f_Z' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Location_Preset, CallFunc_BreakVector3f_InVec_ImplicitCast) == 0x000028, "Member 'Ultra_Dynamic_Sky_C_Apply_Location_Preset::CallFunc_BreakVector3f_InVec_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Location_Preset, K2Node_VariableSet_Latitude_ImplicitCast) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_Apply_Location_Preset::K2Node_VariableSet_Latitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Location_Preset, K2Node_VariableSet_Longitude_ImplicitCast) == 0x000040, "Member 'Ultra_Dynamic_Sky_C_Apply_Location_Preset::K2Node_VariableSet_Longitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Location_Preset, K2Node_VariableSet_Time_Zone_ImplicitCast) == 0x000048, "Member 'Ultra_Dynamic_Sky_C_Apply_Location_Preset::K2Node_VariableSet_Time_Zone_ImplicitCast' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Apply Saved UDS and UDW State
// 0x01C8 (0x01C8 - 0x0000)
struct Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State final
{
public:
	struct FUDS_and_UDW_State                     State;                                             // 0x0000(0x0178)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3968[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IUltra_Dynamic_Weather_Interface_C> K2Node_DynamicCast_AsUltra_Dynamic_Weather_Interface; // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3969[0x6];                                     // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IUltra_Dynamic_Weather_Interface_C> K2Node_DynamicCast_AsUltra_Dynamic_Weather_Interface_1; // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State) == 0x0001C8, "Wrong size on Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State, State) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State::State' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State, CallFunc_BreakDateTime_Year) == 0x000178, "Member 'Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State, CallFunc_BreakDateTime_Month) == 0x00017C, "Member 'Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State, CallFunc_BreakDateTime_Day) == 0x000180, "Member 'Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State, CallFunc_BreakDateTime_Hour) == 0x000184, "Member 'Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State, CallFunc_BreakDateTime_Minute) == 0x000188, "Member 'Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State, CallFunc_BreakDateTime_Second) == 0x00018C, "Member 'Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State, CallFunc_BreakDateTime_Millisecond) == 0x000190, "Member 'Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State, K2Node_DynamicCast_AsUltra_Dynamic_Weather_Interface) == 0x000198, "Member 'Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State::K2Node_DynamicCast_AsUltra_Dynamic_Weather_Interface' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State, CallFunc_IsValid_ReturnValue) == 0x0001A9, "Member 'Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State, K2Node_DynamicCast_AsUltra_Dynamic_Weather_Interface_1) == 0x0001B0, "Member 'Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State::K2Node_DynamicCast_AsUltra_Dynamic_Weather_Interface_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State, K2Node_DynamicCast_bSuccess_1) == 0x0001C0, "Member 'Ultra_Dynamic_Sky_C_Apply_Saved_UDS_and_UDW_State::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Apply Volumetric Mode
// 0x0030 (0x0030 - 0x0000)
struct Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode final
{
public:
	EUDS_VolRT_Mode                               Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUDS_VolRT_Mode                               Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_396A[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_396B[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_396C[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode) == 0x000030, "Wrong size on Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode, Mode) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode::Mode' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode, Temp_byte_Variable) == 0x000001, "Member 'Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode, Temp_int_Variable) == 0x000004, "Member 'Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode, Temp_int_Variable_1) == 0x000008, "Member 'Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode, Temp_int_Variable_2) == 0x00000C, "Member 'Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode, Temp_int_Variable_3) == 0x000010, "Member 'Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000014, "Member 'Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode, K2Node_Select_Default) == 0x000020, "Member 'Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'Ultra_Dynamic_Sky_C_Apply_Volumetric_Mode::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Approximate Real Sun Moon and Stars
// 0x0A40 (0x0A40 - 0x0000)
struct Ultra_Dynamic_Sky_C_Approximate_Real_Sun_Moon_and_Stars final
{
public:
	int32                                         Param_Month;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Day;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Year;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_396D[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Param_Time_of_Day;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param_Time_Zone;                                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Only_Calculate_Sun;                                // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_396E[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Sun_Vector;                                        // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Moon_Vector;                                       // 0x0040(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Real_Phase;                                        // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Phase_Alignment;                                   // 0x0060(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Celestial_Orbit;                                   // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Celestial_Yaw;                                     // 0x0080(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Equation_of_Time_Offset;                           // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Equation_of_Time_Curve;                            // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Lunar_Inclination_Cycle;                           // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Moon_Center;                                       // 0x00A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lunar_Time;                                        // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Earth_Center;                                      // 0x00C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Moon_Real_Phase;                                   // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Moon_Alignment;                                    // 0x00E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Moon_Direction;                                    // 0x0100(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Celestial_North_Pole;                              // 0x0118(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stars_Orbit;                                       // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Stars_Yaw;                                         // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Sun_Direction;                                     // 0x0148(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Leap_Year;                                         // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_396F[0x3];                                     // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UTC_Year;                                          // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_Year;                                        // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3970[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Zenith_Direction;                                  // 0x0170(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        Axial_Tilt;                                        // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Viewer_Position_on_Earth;                          // 0x0190(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Local_Geocoordinate;                               // 0x01A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        Seasonal_Time;                                     // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Day_of_Year_Index;                                 // 0x01C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_Month;                                       // 0x01CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_Day;                                         // 0x01D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UTC_Day;                                           // 0x01D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UTC_Month;                                         // 0x01D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3971[0x4];                                     // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        UTC_Time_of_Year;                                  // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        UTC_Time_of_Day;                                   // 0x01E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3972[0x3];                                     // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3973[0x3];                                     // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3974[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_H_M_S_MS_to_Time_of_Day_Time;             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeUnclamped_ReturnValue;            // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
